var flatten = require('flat');

const zh_CN = {
  maintain: "维修中",
  moreLink: "更多连结",
  aboutUs: "关于我们",
  rationalBetting: "理性博彩",
  caption: "标题",
  operating: "操作",
  modifyEmail: "修改邮箱",
  inputEmail: "输入电子邮箱",
  checkSend: "确认送出",
  inputVerifyCode: "输入验证码",
  inputNewPwd: "输入新密码",
  inputNewPwdAgain: "再次输入新密码",
  selectLanguage: "语系选择",
  forget: "忘记",
  addBankCard: "新增银行卡",
  transferHistory: "转帐纪录",
  reSend: "重新寄送",
  goto: "请至",
  verifyDesc: "收取验证码，完成验证！",
  register: {
    title: "注册",
    subTitle: "会员注册",
    submit: "注册帐号",
    step: {
      _1: "填写基本资料完成注册",
      _2: "E-mail验证",
      _3: "完成验证，开通帐号"
    },
    mobileStep: {
      _1: "注册",
      _2: "验证",
      _3: "开通帐号"
    },
    placeholder: {
      account: "帐号",
      password: "密码",
      confirmPwd: "确认密码",
      name: "名称",
      idNum: "身份证字号",
      qq: "QQ",
      wechat: "微信",
      birthDay: "出生日期",
      referralCode: "推荐码",
      email: "邮箱",
      phone: "电话"
    },
    wrongMsg: {
      account: "请填入4-10位的英文数字，请用英文字母开头",
      password: "请填入4-20位的英文，数字或符号",
      confirmPwd: "请再次输入密码",
      name: "请输入名称",
      idNum: "请输入身份证字号",
      qq: "请输入QQ",
      wechat: "请输入微信",
      birthDay: "请输入出生日期",
      referralCode: "请输入推荐码",
      email: "请输入邮箱",
      phone: "请输入电话"
    }
  },
  formatErr: {
    noMatch: "密码不同",
    noAgree: "尚未同意条款"
  },
  bonuses: {
    title: "优惠活动",
    noData: "暂无优惠",
    activeTime: "活动时间",
    moreBtn: "详细内容",
    showTime: "{start} 至 {end}",
    forever: "永久开放",
    applyState: {
      auto: "无需申请",
      cs: "连系客服申请",
      agent: "连系代理申请",
      manual: "我要参加",
      applied: "已申请参加"
    }
  },
  memberMenu: {
    myWallet: "我的錢包",
    bankCard: "银行卡",
    history: "历史纪录",
    center: "基本资料",
    message: "会员讯息",
    validBets: "投注纪录",
    mainCredits: "帐户纪录",
    mainOrders: "存/取款纪录",
    gameOrder: "游戏纪录",
    bonuses: "紅利纪录",
    changePwd: "修改密码"
  },
  wallet: {
    mainBalance: "主钱包余额",
    gameBalance: "游戏钱包余额",
    deposit: "存款",
    withdraw: "取款",
    gameTransfer: "游戏转帐",
    transferToGame: "转入游戏钱包",
    transferToMain: "转回主钱包",
    mainWallet: "主钱包",
    gameWallet: "游戏钱包",
    amount: "金額",
    amountIssue: "转入金额异常",
    checkTransfer: "确定转入？",
    transferSuccess: "转入成功",
    transferInto: "转入",
    transferOut: "转回",
    transferAmount: "转帐金額"
  },
  editInfo: "编辑资料",
  center: {
    birth_day: "生日",
    name: "姓名",
    qq: "QQ",
    wechat: "微信",
    email: "邮箱"
  },
  footer: {
    companyTitle: "SUNBET 亚洲在线娱乐",
    companyDesc: "SUNBET 乃正式注册的网上博彩公司。 版权为 SUNBET 所有©"
  },
  language: {
    title: "语系选择",
    zh_cn: "简体中文",
  },
  casinoGames: {
    item1: "百家乐",
    item2: "雀九",
    item3: "轮盘",
    item4: "骰宝",
    item5: "龙虎",
    item6: "三公",
  },
  deposit: {
    singleAmount: "单笔",
    selectCannel: "选择渠道",
    amount: "存款金额",
    sumbit: "存款"
  },
  bankCard: {
    bankcardAmount: "银行卡数量",
    newBankcard: "绑定银行卡",
    channelDetailInfo: "渠道详细资料",
    bankName: "银行名称",
    province: "銀行省份",
    area: "银行城市",
    branch: "开户支行",
    accountNum: "帐户号码",
    accountName: "户名",
    checkAdd: "确认新增",
    verifyBankcard: "银行卡验证"
  },
  history: {
    bets: "投注",
    mainCredits: "帐户",
    mainOrders: "存取款",
    gameOrder: "游戏转帐",
    bonuses: "紅利",
    search: "搜索",
    time: "日期/时间",
    serialNum: "订单编号/流水号",
    name: "名称",
    orderStatus: "注单状态",
    validBets: "有效投注",
    betsAmount: "投注金額",
    winLost: "输/赢",
    detail: "详细结果",
    result: "结果",
    transferType: "类型",
    amount: "金额",
    transfered: "交易后",
    remark: "备注",
    status: "状态",
    bonusesName: "優惠名稱",
    appliedDay: "申請日",
    gameKind: "游戏馆",
    kind: "种类",
    betTime: "投注时间"
  },
  aboutUsContent: {
    title: "关于我们",
    description: "SUNBET乃正式注册的网上博彩公司。成立至今，我们不但为客户提供各网上娱乐，更承诺配备最优质的投注方法，并辅以最先进的网络技术支持，献上最佳的客户服务和最优惠的支付方案。我们致力于为广大客户提供丰富多彩的博彩活动，并极力以最优质的收费方式及丰富奖赏作为回馈。本公司的经营理念是通过向顾客提供最佳的多元化网上娱乐，以进一步拓展我们的业务。",
    section: [
      {
        title: "诚信",
        description: "作为国际专业的网上博彩游戏客户端运营企业，我们凭借集合世界级的博彩资讯专家、丰富经验的服务团队、市场营销专家、先进的软硬件开发人员建立出 SUNBET全面而完善的组织体系。我们承诺，为每一位客户提供最及时、最安全、最准确的专业博彩数据，以及全方位的国际化服务。同时， SUNBET 全部游戏设计均采用世界最领先的软件。我们更聘请了多位资深计算机专家给公司设计和提供软硬件设施维护服务，以提供最佳的技术支持，确保客户能无时无刻享受到最优质的娱乐服务。"
      },
      {
        title: "优质服务承诺",
        description: "自成立至今， SUNBET 致力提供多元化的网上娱乐，让客户能每天24小时体验到最精彩刺激的休闲享受，更借以丰富奖赏，以回馈客户对我们的支持及热情参与。 我们恪守“顾客至上”的宗旨，以力求创新，不断进步的精神，开拓多元化的娱乐业务。为此，我们聘用庞大的服务团队，凭借市场推广、软件开发、客户服务、技术支持等优秀人员的不懈努力，为客户提供专业的娱乐服务。我们承诺，置身于 SUNBET 游戏平台的客户，不论参与的是体育娱乐，还是其他网上游戏，也能享有极具价值的博彩回报。同时，对客户个人信息保密对我们来说是最重要的。我们承诺，将继续不遗余力地严格实行保密的私制度。"
      },
      {
        title: "严格维护保密及安全性",
        description: "根据规定，每位 SUNBET用户只能拥有一个相对应的账户。为维护系统的完整性及公平性原则，我们将会进行不定期的安全检查。客户的安全和游戏的公正性乃 SUNBET最重要的服务信念与宗旨。我们采用的是全球最先进的游戏软件设备，保证了软件本身的公正性。同时，本公司更用上最先进的加密措施来保证游戏的安全，并作24小时的后台检测和监控，确保我们的客户可以在一个最保密、最安全的网络游戏空间尽情玩乐。"
      },
      {
        title: "公平游戏",
        description: "SUNBET致力为玩家提供最公正的环境，在一个结合体彩及网络直播的娱乐平台上尽情游戏。 SUNBET线上娱乐平台乃现时亚洲市场最具权威及最先进的科技系统所提供。此外，所有参与现场游戏的荷官均经过严格训练及挑选，每局牌局均有主管负责监察，以确保游戏的真实度。"
      },
      {
        title: "负责任博彩",
        description: "SUNBET承诺提供「负责任博彩」，并确保每位客户能与我们一起享受到博彩的乐趣。但是我们也了解到有小部分的人有时候未必能控制自己的投注行为，如遇相关问题， SUNBET 会积极鼓励这些用户及时与我们联络，以便尽提供相关帮助。"
      }
    ]
  },
  privacyContent: {
    title: "隐私政策",
    description: "我们尊重您的私隐权并保证您数据的安全，这是我们的头等重任 走地皇(RB88) 绝对不会泄露您的个人资料给第三方，除非收到法庭传单或应可行法律的要求及判决。我们有权通过网站向有关付款平台服务提供商以及金融保险机构提供必要的个人信息以完成付款要求。",
    section: [
      {
        title: "1. 同意",
        description: "SUNBET在您访问我们的网站时收集两种信息，不识别您个人身份的追踪或综合数据，自动从每位访客身上收集；包括：",
        notice: [
          "a. 提供个人信息、注册账户或登录我们的网站即表示您明确同意SUNBET处理和披露您的个人信息，以满足本隐私权政策或条款与条件中阐述的目的。",
          "b. 如果您不同意本隐私权政策的条款，请勿使用和/或向本网站注册。"
        ]
      },
      {
        title: "2. 我们如何收集数据？",
        notice: [
          {
            content: "a. 我们可能收集、使用和处理的您的个人信息和数据包括以下：",
            list: [
              "• 您在本网站填写表格时提供给我们的个人信息，或通过本网站或电邮提交给我们的其他信息；",
              "• 函电记录，无论是通过本网站、电邮或其他方式；",
              "• 您在我们的调查或客户研究中提供的回答； ",
              "• 您与我们的交易详情，无论是通过本网站或其他方式；以及",
              "• 您访问本网站的详情，包括但不限于流量数据、位置数据、网页博客和其他通信数据。"
            ]
          },
          {
            content: "b. 请注意，您通过电邮发送给我们的任何信息是不加密的，您需要为传输这些信息自担风险。"
          }
        ]
      },
      {
        title: "3. 出于什么目的？",
        description: "SUNBET为以下目的收集和处理个人数据：",
        notice: [
          "• 建立，处理和管理您的账户",
          "• 提供投注和博彩服务；",
          "• 身份识别和/或验证；",
          "• 处理和监视您的投注；",
          "• 处理银行卡和在线付款；",
          "• 付款处理身份识别、验证和/或处理；",
          "• 监视交易活动，防止欺诈、违规博彩和洗钱；",
          "• 出于市场调查和数据分析的原因；",
          "• 基于选择加入原则（若适用）进行推广；以及",
          "• 法律和/或法规原因。"
        ]
      },
      {
        title: "4. 信息的披露",
        description: "我们有权与监管机构、体育机构和其他主管部门分享我们持有的您的信息，包括个人数据和/或博彩历史，以调查欺诈、洗钱或体育诚信问题，和遵守我们的监管责任"
      },
      {
        title: "5. Cookies、标记和其他标识符(“cookies”)",
        description: "接受条款与条件、使用或注册本服务即表示您接受我们将会使用cookies。"
      },
      {
        title: "6. 政策更新",
        description: [
          "我们将定期审查本隐私政策,有权随时修改和更新本隐私政策。",
          "我们的隐私权政策的任何更改应在本页发布，经修改的隐私权政策一经发布，更改将生效。",
          "您继续使用本网站就表明您接收这些条款的更改，我们建议您定期检查本隐私政策。"
        ]
      }
    ]
  },
  disclaimerContent: {
    title: "免责条款",
    description: "SUNBET对网站的内容及第三者在网站内提供的资料或内容之准确性等，并不会负上任何的法律责任。",
    content: [
      "SUNBET会尽力确保网站资讯的准确性、完整性以及即时性(一切以发表日期为准)，但本公司并不能保证相关内容的准确性、完整性、即时性、网络技术与排版效果可达百分百的准确无误。",
      "另外，网站内的部分资讯与其发布的日期和时间是相关的。所以，在特定日期时间之后，相关资讯可能已不再准确真实，本公司亦不承诺会更新该项目，而您也有责任在采纳这些资讯前对其真实性进行核对验证。本公司保留在没有预先通知的情况下，修改或更新网站内容资讯的权利。同时，基于某些产品或服务乃受到规章及其他限制约束，所以有关项目并不适合于所有市场。"
    ]
  },
  rationalBettingContent: {
    title: "理性博彩",
    description: "我们希望您在 SUNBET 线上娱乐城尽兴的游戏。如您对沉迷博彩有任何问题，请您参照以下评估以及协助。",
    section: [
      {
        title: "一、请您遵循以下建议：",
        list: [
          "1. 游戏前请您限制及控制您的存款，减少投注。",
          "2. 避免让博彩影响到您的日常工作和生活。",
          "3. 谨记博彩不是您的主要收入来源。",
          "4. 请勿在酒精或任何药物影响下进行游戏。",
          "5. 不要以继续游戏的方式挽回您的损失。",
          "6. 更多关于博彩责任的建议和信息，请浏览 "
        ]
      },
      {
        title: "二、以下可能为沉迷博彩迹象：",
        list: [
          "1. 您因博彩影响到自己或您身边的人。",
          "2. 在博彩上花费超过您能负担的时间或资金。",
          "3. 发现难以控制或停止博彩游戏。",
          "4. 因金钱或博彩问题与家人或朋友争吵。",
          "5. 对日常活动失去兴趣，如与朋友外出或陪伴家人。",
          "6. 总是想着或讨论博彩。",
          "7. 对他人说谎或隐藏您进行博彩的行为。",
          "8. 挽回博彩损失或以博彩摆脱经济困境。",
          "9. 进行博彩游戏直到没钱为止。",
          "10. 为博彩而借贷，出售财产或不支付帐单。",
          "11. 需要以高额赌注或长时间进行博彩获得兴奋或快感。",
          "12. 因博彩而忽视工作、学习、家庭、个人需求或家庭责任。",
          "13. 感到焦虑担心、内疚、 沮丧或易怒。"
        ]
      },
      {
        title: "三、匿名戒赌协会："
      },
      {
        title: "四、戒赌中心："
      },
      {
        title: "五、戒赌治疗："
      },
      {
        title: "六、自我限制：",
        description: "我们衷心希望所有会员尽情畅玩游戏，体验精彩刺激，但对少数在游戏中没有欢愉体验想暂停游戏的会员， SUNBET 线上娱乐城提供自我限制帐户功能， 期限可设置为最短 6 个月至最长 5 年。如果您需进一步了解自我限制条款详情或您需要自我限制 5 年以上，请您随时联系客服咨询。敬请知悉如您申请短期限的自我限制， 在该期限内将无法申请重启帐户，如您是由于沉迷博彩需要永久关闭帐户，请您“我的帐户”界面选择“博彩责任”操作关闭帐户，一旦您进行此操作， 您的帐户将永久性关闭无法恢复。无论任何原因您想关闭您的帐户，请联系我们客服协助您。"
      },
      {
        title: "七、年满 21 岁：",
        description: "SUNBET 线上娱乐城在菲律宾取得营业许可证并受其监管，依法禁止未满 21 岁的玩家在本网站进行真钱游戏。SUNBET线上娱乐城有权要求客户提供相关证明核实年龄以确保注册信息的真实性， 验证客户相关年龄证明前也有权暂停帐户和保留资金，同时遵从当地法律。为了避免非法投注，我们可能将与第三方公司核实您是否年满 18 岁。为了您个人信息和帐户安全， 请注意保密您的帐户信息和密码。"
      },
      {
        title: "八、家长控制：",
        description: "有些客户为了自己或家人可能需要一个可以限制登录部份网站和一些互联网的第三方控制系统，如以下： ",
        list: [
          "网络过滤：",
          "网络保姆："
        ]
      }
    ]
  }
};

export default flatten(zh_CN);