export const BankArea = [
  {
    "cn": "北京市",
    "code": "beijing",
    "citys": [
      {
        "cn": "北京市",
        "code": "100000",
        "area": [
          {
            "cn": "东城区",
            "code": "100000"
          },
          {
            "cn": "大兴区",
            "code": "102600"
          },
          {
            "cn": "密云县",
            "code": "101500"
          },
          {
            "cn": "平谷区",
            "code": "101200"
          },
          {
            "cn": "延庆县",
            "code": "102100"
          },
          {
            "cn": "怀柔区",
            "code": "101400"
          },
          {
            "cn": "房山区",
            "code": "102400"
          },
          {
            "cn": "昌平区",
            "code": "102200"
          },
          {
            "cn": "通州区",
            "code": "101100"
          },
          {
            "cn": "门头沟区",
            "code": "102300"
          },
          {
            "cn": "顺义区",
            "code": "101300"
          }
        ]
      }
    ]
  },
  {
    "cn": "天津市",
    "code": "tianjin",
    "citys": [
      {
        "cn": "天津市",
        "code": "300000",
        "area": [
          {
            "cn": "东丽区",
            "code": "300000"
          },
          {
            "cn": "塘沽区",
            "code": "300450"
          },
          {
            "cn": "大港区",
            "code": "300270"
          },
          {
            "cn": "宁河县",
            "code": "301500"
          },
          {
            "cn": "宝坻区",
            "code": "301800"
          },
          {
            "cn": "武清区",
            "code": "301700"
          },
          {
            "cn": "汉沽区",
            "code": "300480"
          },
          {
            "cn": "蓟县",
            "code": "301900"
          },
          {
            "cn": "静海县",
            "code": "301600"
          }
        ]
      }
    ]
  },
  {
    "cn": "河北省",
    "code": "hebei",
    "citys": [
      {
        "cn": "保定市",
        "code": "071000",
        "area": [
          {
            "cn": "北市区",
            "code": "071000"
          },
          {
            "cn": "博野县",
            "code": "071300"
          },
          {
            "cn": "唐县",
            "code": "072350"
          },
          {
            "cn": "安国市",
            "code": "071200"
          },
          {
            "cn": "安新县",
            "code": "071600"
          },
          {
            "cn": "定兴县",
            "code": "072650"
          },
          {
            "cn": "定州市",
            "code": "073000"
          },
          {
            "cn": "容城县",
            "code": "071700"
          },
          {
            "cn": "徐水县",
            "code": "072550"
          },
          {
            "cn": "易县",
            "code": "074200"
          },
          {
            "cn": "曲阳县",
            "code": "073100"
          },
          {
            "cn": "望都县",
            "code": "072450"
          },
          {
            "cn": "涞水县",
            "code": "074100"
          },
          {
            "cn": "涞源县",
            "code": "074300"
          },
          {
            "cn": "涿州市",
            "code": "072750"
          },
          {
            "cn": "清苑县",
            "code": "071100"
          },
          {
            "cn": "满城县",
            "code": "072150"
          },
          {
            "cn": "蠡县",
            "code": "071400"
          },
          {
            "cn": "阜平县",
            "code": "073200"
          },
          {
            "cn": "雄县",
            "code": "071800"
          },
          {
            "cn": "顺平县",
            "code": "072200"
          },
          {
            "cn": "高碑店市",
            "code": "074000"
          },
          {
            "cn": "高阳县",
            "code": "071500"
          }
        ]
      },
      {
        "cn": "唐山市",
        "code": "063000",
        "area": [
          {
            "cn": "丰南区",
            "code": "063300"
          },
          {
            "cn": "丰润区",
            "code": "063000"
          },
          {
            "cn": "乐亭县",
            "code": "063600"
          },
          {
            "cn": "古冶区",
            "code": "063100"
          },
          {
            "cn": "唐海县",
            "code": "063200"
          },
          {
            "cn": "滦南县",
            "code": "063500"
          },
          {
            "cn": "滦县",
            "code": "063700"
          },
          {
            "cn": "玉田县",
            "code": "064100"
          },
          {
            "cn": "迁安市",
            "code": "064400"
          },
          {
            "cn": "迁西县",
            "code": "064300"
          },
          {
            "cn": "遵化市",
            "code": "064200"
          }
        ]
      },
      {
        "cn": "廊坊市",
        "code": "065000",
        "area": [
          {
            "cn": "三河市",
            "code": "065200"
          },
          {
            "cn": "固安县",
            "code": "065500"
          },
          {
            "cn": "大厂回族自治县",
            "code": "065300"
          },
          {
            "cn": "大城县",
            "code": "065900"
          },
          {
            "cn": "安次区",
            "code": "065000"
          },
          {
            "cn": "文安县",
            "code": "065800"
          },
          {
            "cn": "永清县",
            "code": "065600"
          },
          {
            "cn": "霸州市",
            "code": "065700"
          },
          {
            "cn": "香河县",
            "code": "065400"
          }
        ]
      },
      {
        "cn": "张家口市",
        "code": "075000",
        "area": [
          {
            "cn": "万全县",
            "code": "076250"
          },
          {
            "cn": "下花园区",
            "code": "075300"
          },
          {
            "cn": "宣化区",
            "code": "075000"
          },
          {
            "cn": "宣化县",
            "code": "075100"
          },
          {
            "cn": "尚义县",
            "code": "076750"
          },
          {
            "cn": "崇礼县",
            "code": "076350"
          },
          {
            "cn": "康保县",
            "code": "076650"
          },
          {
            "cn": "张北县",
            "code": "076450"
          },
          {
            "cn": "怀安县",
            "code": "076150"
          },
          {
            "cn": "怀来县",
            "code": "075400"
          },
          {
            "cn": "桥东区",
            "code": "050000"
          },
          {
            "cn": "沽源县",
            "code": "076550"
          },
          {
            "cn": "涿鹿县",
            "code": "075600"
          },
          {
            "cn": "蔚县",
            "code": "075700"
          },
          {
            "cn": "赤城县",
            "code": "075500"
          },
          {
            "cn": "阳原县",
            "code": "075800"
          }
        ]
      },
      {
        "cn": "承德市",
        "code": "067000",
        "area": [
          {
            "cn": "丰宁满族自治县",
            "code": "068350"
          },
          {
            "cn": "兴隆县",
            "code": "067300"
          },
          {
            "cn": "双桥区",
            "code": "067000"
          },
          {
            "cn": "围场满族蒙古族自治县",
            "code": "068450"
          },
          {
            "cn": "宽城满族自治县",
            "code": "067600"
          },
          {
            "cn": "平泉县",
            "code": "067500"
          },
          {
            "cn": "承德县",
            "code": "067400"
          },
          {
            "cn": "滦平县",
            "code": "068250"
          },
          {
            "cn": "隆化县",
            "code": "068150"
          },
          {
            "cn": "鹰手营子矿区",
            "code": "067200"
          }
        ]
      },
      {
        "cn": "沧州市",
        "code": "061000",
        "area": [
          {
            "cn": "东光县",
            "code": "061600"
          },
          {
            "cn": "任丘市",
            "code": "062550"
          },
          {
            "cn": "南皮县",
            "code": "061500"
          },
          {
            "cn": "吴桥县",
            "code": "061800"
          },
          {
            "cn": "孟村回族自治县",
            "code": "061400"
          },
          {
            "cn": "新华区",
            "code": "061000"
          },
          {
            "cn": "河间市",
            "code": "062450"
          },
          {
            "cn": "泊头市",
            "code": "062150"
          },
          {
            "cn": "海兴县",
            "code": "061200"
          },
          {
            "cn": "献县",
            "code": "062250"
          },
          {
            "cn": "盐山县",
            "code": "061300"
          },
          {
            "cn": "肃宁县",
            "code": "062350"
          },
          {
            "cn": "青县",
            "code": "062650"
          },
          {
            "cn": "黄骅市",
            "code": "061100"
          }
        ]
      },
      {
        "cn": "石家庄市",
        "code": "050000",
        "area": [
          {
            "cn": "井陉县",
            "code": "050300"
          },
          {
            "cn": "井陉矿区",
            "code": "050100"
          },
          {
            "cn": "元氏县",
            "code": "051130"
          },
          {
            "cn": "平山县",
            "code": "050400"
          },
          {
            "cn": "新乐市",
            "code": "050700"
          },
          {
            "cn": "无极县",
            "code": "052400"
          },
          {
            "cn": "晋州市",
            "code": "052200"
          },
          {
            "cn": "栾城县",
            "code": "051430"
          },
          {
            "cn": "桥东区",
            "code": "054000"
          },
          {
            "cn": "正定县",
            "code": "050800"
          },
          {
            "cn": "深泽县",
            "code": "052500"
          },
          {
            "cn": "灵寿县",
            "code": "050500"
          },
          {
            "cn": "藁城市",
            "code": "052160"
          },
          {
            "cn": "行唐县",
            "code": "050600"
          },
          {
            "cn": "赞皇县",
            "code": "051230"
          },
          {
            "cn": "赵县",
            "code": "051530"
          },
          {
            "cn": "辛集市",
            "code": "052300"
          },
          {
            "cn": "高邑县",
            "code": "051330"
          },
          {
            "cn": "鹿泉市",
            "code": "050200"
          }
        ]
      },
      {
        "cn": "秦皇岛市",
        "code": "066000",
        "area": [
          {
            "cn": "北戴河区",
            "code": "066100"
          },
          {
            "cn": "卢龙县",
            "code": "066400"
          },
          {
            "cn": "山海关区",
            "code": "066200"
          },
          {
            "cn": "抚宁县",
            "code": "066300"
          },
          {
            "cn": "昌黎县",
            "code": "066600"
          },
          {
            "cn": "海港区",
            "code": "066000"
          },
          {
            "cn": "青龙满族自治县",
            "code": "066500"
          }
        ]
      },
      {
        "cn": "衡水市",
        "code": "053000",
        "area": [
          {
            "cn": "冀州市",
            "code": "053200"
          },
          {
            "cn": "安平县",
            "code": "053600"
          },
          {
            "cn": "故城县",
            "code": "253800"
          },
          {
            "cn": "景县",
            "code": "053500"
          },
          {
            "cn": "枣强县",
            "code": "053100"
          },
          {
            "cn": "桃城区",
            "code": "053000"
          },
          {
            "cn": "武强县",
            "code": "053300"
          },
          {
            "cn": "武邑县",
            "code": "053400"
          },
          {
            "cn": "深州市",
            "code": "052800"
          },
          {
            "cn": "阜城县",
            "code": "053700"
          },
          {
            "cn": "饶阳县",
            "code": "053900"
          }
        ]
      },
      {
        "cn": "邢台市",
        "code": "054000",
        "area": [
          {
            "cn": "临城县",
            "code": "054300"
          },
          {
            "cn": "临西县",
            "code": "054900"
          },
          {
            "cn": "任县",
            "code": "055150"
          },
          {
            "cn": "内丘县",
            "code": "054200"
          },
          {
            "cn": "南和县",
            "code": "054400"
          },
          {
            "cn": "南宫市",
            "code": "051800"
          },
          {
            "cn": "威县",
            "code": "054700"
          },
          {
            "cn": "宁晋县",
            "code": "055550"
          },
          {
            "cn": "巨鹿县",
            "code": "055250"
          },
          {
            "cn": "平乡县",
            "code": "054500"
          },
          {
            "cn": "广宗县",
            "code": "054600"
          },
          {
            "cn": "新河县",
            "code": "051730"
          },
          {
            "cn": "柏乡县",
            "code": "055450"
          },
          {
            "cn": "沙河市",
            "code": "054100"
          },
          {
            "cn": "清河县",
            "code": "054800"
          },
          {
            "cn": "隆尧县",
            "code": "055350"
          }
        ]
      },
      {
        "cn": "邯郸市",
        "code": "056000",
        "area": [
          {
            "cn": "丛台区",
            "code": "056000"
          },
          {
            "cn": "临漳县",
            "code": "056600"
          },
          {
            "cn": "大名县",
            "code": "056900"
          },
          {
            "cn": "峰峰矿区",
            "code": "056200"
          },
          {
            "cn": "广平县",
            "code": "057650"
          },
          {
            "cn": "成安县",
            "code": "056700"
          },
          {
            "cn": "曲周县",
            "code": "057250"
          },
          {
            "cn": "武安市",
            "code": "056300"
          },
          {
            "cn": "永年县",
            "code": "057150"
          },
          {
            "cn": "涉县",
            "code": "056400"
          },
          {
            "cn": "磁县",
            "code": "056500"
          },
          {
            "cn": "肥乡县",
            "code": "057550"
          },
          {
            "cn": "邱县",
            "code": "057450"
          },
          {
            "cn": "馆陶县",
            "code": "057750"
          },
          {
            "cn": "魏县",
            "code": "056800"
          },
          {
            "cn": "鸡泽县",
            "code": "057350"
          }
        ]
      }
    ]
  },
  {
    "cn": "内蒙古自治区",
    "code": "neimenggu",
    "citys": [
      {
        "cn": "乌兰察布市",
        "code": "012000",
        "area": [
          {
            "cn": "丰镇市",
            "code": "012100"
          },
          {
            "cn": "兴和县",
            "code": "013650"
          },
          {
            "cn": "凉城县",
            "code": "013750"
          },
          {
            "cn": "化德县",
            "code": "013350"
          },
          {
            "cn": "卓资县",
            "code": "012300"
          },
          {
            "cn": "商都县",
            "code": "013400"
          },
          {
            "cn": "四子王旗",
            "code": "011800"
          },
          {
            "cn": "察哈尔右翼中旗",
            "code": "013500"
          },
          {
            "cn": "察哈尔右翼前旗",
            "code": "012200"
          },
          {
            "cn": "察哈尔右翼后旗",
            "code": "012400"
          },
          {
            "cn": "集宁区",
            "code": "012000"
          }
        ]
      },
      {
        "cn": "乌海市",
        "code": "016000",
        "area": [
          {
            "cn": "乌达区",
            "code": "016000"
          }
        ]
      },
      {
        "cn": "兴安盟",
        "code": "137400",
        "area": [
          {
            "cn": "乌兰浩特市",
            "code": "137400"
          },
          {
            "cn": "扎赉特旗",
            "code": "137600"
          },
          {
            "cn": "科尔沁右翼中旗",
            "code": "029400"
          },
          {
            "cn": "突泉县",
            "code": "137500"
          }
        ]
      },
      {
        "cn": "包头市",
        "code": "014000",
        "area": [
          {
            "cn": "东河区",
            "code": "014000"
          },
          {
            "cn": "固阳县",
            "code": "014200"
          },
          {
            "cn": "土默特右旗",
            "code": "014100"
          },
          {
            "cn": "石拐区",
            "code": "014070"
          },
          {
            "cn": "达尔罕茂明安联合旗",
            "code": "014500"
          }
        ]
      },
      {
        "cn": "呼伦贝尔市",
        "code": "021000",
        "area": [
          {
            "cn": "扎兰屯市",
            "code": "162650"
          },
          {
            "cn": "新巴尔虎右旗",
            "code": "021300"
          },
          {
            "cn": "新巴尔虎左旗",
            "code": "021200"
          },
          {
            "cn": "根河市",
            "code": "022350"
          },
          {
            "cn": "海拉尔区",
            "code": "021000"
          },
          {
            "cn": "满洲里市",
            "code": "021400"
          },
          {
            "cn": "牙克石市",
            "code": "022150"
          },
          {
            "cn": "莫力达瓦达斡尔族自治旗",
            "code": "162850"
          },
          {
            "cn": "鄂伦春自治旗",
            "code": "022450"
          },
          {
            "cn": "鄂温克族自治旗",
            "code": "021100"
          },
          {
            "cn": "阿荣旗",
            "code": "162750"
          },
          {
            "cn": "陈巴尔虎旗",
            "code": "021500"
          },
          {
            "cn": "额尔古纳市",
            "code": "022250"
          }
        ]
      },
      {
        "cn": "呼和浩特市",
        "code": "010000",
        "area": [
          {
            "cn": "和林格尔县",
            "code": "011500"
          },
          {
            "cn": "回民区",
            "code": "010010"
          },
          {
            "cn": "土默特左旗",
            "code": "010100"
          },
          {
            "cn": "托克托县",
            "code": "010200"
          },
          {
            "cn": "新城区",
            "code": "010000"
          },
          {
            "cn": "武川县",
            "code": "011700"
          },
          {
            "cn": "清水河县",
            "code": "011600"
          }
        ]
      },
      {
        "cn": "巴彦淖尔市",
        "code": "015000",
        "area": [
          {
            "cn": "临河区",
            "code": "015000"
          },
          {
            "cn": "乌拉特中旗",
            "code": "015300"
          },
          {
            "cn": "乌拉特前旗",
            "code": "014400"
          },
          {
            "cn": "乌拉特后旗",
            "code": "015500"
          },
          {
            "cn": "五原县",
            "code": "015100"
          },
          {
            "cn": "杭锦后旗",
            "code": "015400"
          },
          {
            "cn": "磴口县",
            "code": "015200"
          }
        ]
      },
      {
        "cn": "赤峰市",
        "code": "024000",
        "area": [
          {
            "cn": "元宝山区",
            "code": "024000"
          },
          {
            "cn": "克什克腾旗",
            "code": "025350"
          },
          {
            "cn": "喀喇沁旗",
            "code": "024400"
          },
          {
            "cn": "宁城县",
            "code": "024200"
          },
          {
            "cn": "巴林右旗",
            "code": "025150"
          },
          {
            "cn": "巴林左旗",
            "code": "025450"
          },
          {
            "cn": "敖汉旗",
            "code": "024300"
          },
          {
            "cn": "林西县",
            "code": "025250"
          },
          {
            "cn": "翁牛特旗",
            "code": "024500"
          },
          {
            "cn": "阿鲁科尔沁旗",
            "code": "025500"
          }
        ]
      },
      {
        "cn": "通辽市",
        "code": "028000",
        "area": [
          {
            "cn": "奈曼旗",
            "code": "028300"
          },
          {
            "cn": "库伦旗",
            "code": "028200"
          },
          {
            "cn": "开鲁县",
            "code": "028400"
          },
          {
            "cn": "扎鲁特旗",
            "code": "029100"
          },
          {
            "cn": "科尔沁区",
            "code": "028000"
          },
          {
            "cn": "科尔沁左翼中旗",
            "code": "029300"
          },
          {
            "cn": "科尔沁左翼后旗",
            "code": "028100"
          },
          {
            "cn": "霍林郭勒市",
            "code": "029200"
          }
        ]
      },
      {
        "cn": "鄂尔多斯市",
        "code": "017000",
        "area": [
          {
            "cn": "东胜区",
            "code": "017000"
          },
          {
            "cn": "乌审旗",
            "code": "017300"
          },
          {
            "cn": "伊金霍洛旗",
            "code": "017200"
          },
          {
            "cn": "准格尔旗",
            "code": "017100"
          },
          {
            "cn": "杭锦旗",
            "code": "017400"
          },
          {
            "cn": "达拉特旗",
            "code": "014300"
          },
          {
            "cn": "鄂托克前旗",
            "code": "016200"
          },
          {
            "cn": "鄂托克旗",
            "code": "016100"
          }
        ]
      },
      {
        "cn": "锡林郭勒盟",
        "code": "026000",
        "area": [
          {
            "cn": "东乌珠穆沁旗",
            "code": "026300"
          },
          {
            "cn": "二连浩特市",
            "code": "012600"
          },
          {
            "cn": "多伦县",
            "code": "027300"
          },
          {
            "cn": "太仆寺旗",
            "code": "027000"
          },
          {
            "cn": "正蓝旗",
            "code": "027200"
          },
          {
            "cn": "正镶白旗",
            "code": "013800"
          },
          {
            "cn": "苏尼特右旗",
            "code": "011200"
          },
          {
            "cn": "苏尼特左旗",
            "code": "011300"
          },
          {
            "cn": "西乌珠穆沁旗",
            "code": "026200"
          },
          {
            "cn": "锡林浩特市",
            "code": "026000"
          },
          {
            "cn": "镶黄旗",
            "code": "013250"
          },
          {
            "cn": "阿巴嘎旗",
            "code": "011400"
          }
        ]
      },
      {
        "cn": "阿拉善盟",
        "code": "750300",
        "area": [
          {
            "cn": "阿拉善右旗",
            "code": "737300"
          },
          {
            "cn": "阿拉善左旗",
            "code": "750300"
          },
          {
            "cn": "额济纳旗",
            "code": "735400"
          }
        ]
      }
    ]
  },
  {
    "cn": "山西省",
    "code": "shanxi",
    "citys": [
      {
        "cn": "临汾市",
        "code": "041000",
        "area": [
          {
            "cn": "乡宁县",
            "code": "042100"
          },
          {
            "cn": "侯马市",
            "code": "043000"
          },
          {
            "cn": "古县",
            "code": "042400"
          },
          {
            "cn": "吉县",
            "code": "042200"
          },
          {
            "cn": "大宁县",
            "code": "042300"
          },
          {
            "cn": "安泽县",
            "code": "042500"
          },
          {
            "cn": "尧都区",
            "code": "041000"
          },
          {
            "cn": "曲沃县",
            "code": "043400"
          },
          {
            "cn": "永和县",
            "code": "041400"
          },
          {
            "cn": "汾西县",
            "code": "031500"
          },
          {
            "cn": "洪洞县",
            "code": "041600"
          },
          {
            "cn": "浮山县",
            "code": "042600"
          },
          {
            "cn": "翼城县",
            "code": "043500"
          },
          {
            "cn": "蒲县",
            "code": "041200"
          },
          {
            "cn": "襄汾县",
            "code": "041500"
          },
          {
            "cn": "隰县",
            "code": "041300"
          },
          {
            "cn": "霍州市",
            "code": "031400"
          }
        ]
      },
      {
        "cn": "吕梁市",
        "code": "033000",
        "area": [
          {
            "cn": "中阳县",
            "code": "033400"
          },
          {
            "cn": "临县",
            "code": "033200"
          },
          {
            "cn": "交口县",
            "code": "032400"
          },
          {
            "cn": "交城县",
            "code": "030500"
          },
          {
            "cn": "兴县",
            "code": "035300"
          },
          {
            "cn": "孝义市",
            "code": "032300"
          },
          {
            "cn": "岚县",
            "code": "035200"
          },
          {
            "cn": "文水县",
            "code": "032100"
          },
          {
            "cn": "方山县",
            "code": "033100"
          },
          {
            "cn": "柳林县",
            "code": "033300"
          },
          {
            "cn": "汾阳市",
            "code": "032200"
          },
          {
            "cn": "石楼县",
            "code": "032500"
          },
          {
            "cn": "离石区",
            "code": "033000"
          }
        ]
      },
      {
        "cn": "大同市",
        "code": "037000",
        "area": [
          {
            "cn": "南郊区",
            "code": "037000"
          },
          {
            "cn": "城区",
            "code": "045000"
          },
          {
            "cn": "大同县",
            "code": "037300"
          },
          {
            "cn": "天镇县",
            "code": "038200"
          },
          {
            "cn": "左云县",
            "code": "037100"
          },
          {
            "cn": "广灵县",
            "code": "037500"
          },
          {
            "cn": "浑源县",
            "code": "037400"
          },
          {
            "cn": "灵丘县",
            "code": "034400"
          },
          {
            "cn": "阳高县",
            "code": "038100"
          }
        ]
      },
      {
        "cn": "太原市",
        "code": "030000",
        "area": [
          {
            "cn": "万柏林区",
            "code": "030000"
          },
          {
            "cn": "古交市",
            "code": "030200"
          },
          {
            "cn": "娄烦县",
            "code": "030300"
          },
          {
            "cn": "清徐县",
            "code": "030400"
          },
          {
            "cn": "阳曲县",
            "code": "030100"
          }
        ]
      },
      {
        "cn": "忻州市",
        "code": "034000",
        "area": [
          {
            "cn": "五台县",
            "code": "035500"
          },
          {
            "cn": "五寨县",
            "code": "036200"
          },
          {
            "cn": "代县",
            "code": "034200"
          },
          {
            "cn": "保德县",
            "code": "036600"
          },
          {
            "cn": "偏关县",
            "code": "036400"
          },
          {
            "cn": "原平市",
            "code": "034100"
          },
          {
            "cn": "宁武县",
            "code": "036000"
          },
          {
            "cn": "定襄县",
            "code": "035400"
          },
          {
            "cn": "岢岚县",
            "code": "036300"
          },
          {
            "cn": "忻府区",
            "code": "034000"
          },
          {
            "cn": "河曲县",
            "code": "036500"
          },
          {
            "cn": "神池县",
            "code": "036100"
          },
          {
            "cn": "繁峙县",
            "code": "034300"
          },
          {
            "cn": "静乐县",
            "code": "035100"
          }
        ]
      },
      {
        "cn": "晋中市",
        "code": "030600",
        "area": [
          {
            "cn": "介休市",
            "code": "032000"
          },
          {
            "cn": "和顺县",
            "code": "032700"
          },
          {
            "cn": "太谷县",
            "code": "030800"
          },
          {
            "cn": "寿阳县",
            "code": "045400"
          },
          {
            "cn": "左权县",
            "code": "032600"
          },
          {
            "cn": "平遥县",
            "code": "031100"
          },
          {
            "cn": "昔阳县",
            "code": "045300"
          },
          {
            "cn": "榆次区",
            "code": "030600"
          },
          {
            "cn": "榆社县",
            "code": "031800"
          },
          {
            "cn": "灵石县",
            "code": "031300"
          },
          {
            "cn": "祁县",
            "code": "030900"
          }
        ]
      },
      {
        "cn": "晋城市",
        "code": "048000",
        "area": [
          {
            "cn": "城区",
            "code": "046000"
          },
          {
            "cn": "沁水县",
            "code": "048200"
          },
          {
            "cn": "泽州县",
            "code": "048000"
          },
          {
            "cn": "阳城县",
            "code": "048100"
          },
          {
            "cn": "陵川县",
            "code": "048300"
          },
          {
            "cn": "高平市",
            "code": "046700"
          }
        ]
      },
      {
        "cn": "朔州市",
        "code": "036000",
        "area": [
          {
            "cn": "右玉县",
            "code": "037200"
          },
          {
            "cn": "山阴县",
            "code": "036900"
          },
          {
            "cn": "平鲁区",
            "code": "036800"
          },
          {
            "cn": "应县",
            "code": "037600"
          },
          {
            "cn": "怀仁县",
            "code": "038300"
          },
          {
            "cn": "朔城区",
            "code": "036002"
          }
        ]
      },
      {
        "cn": "运城市",
        "code": "044000",
        "area": [
          {
            "cn": "万荣县",
            "code": "044200"
          },
          {
            "cn": "临猗县",
            "code": "044100"
          },
          {
            "cn": "垣曲县",
            "code": "043700"
          },
          {
            "cn": "夏县",
            "code": "044400"
          },
          {
            "cn": "平陆县",
            "code": "044300"
          },
          {
            "cn": "新绛县",
            "code": "043100"
          },
          {
            "cn": "永济市",
            "code": "044500"
          },
          {
            "cn": "河津市",
            "code": "043300"
          },
          {
            "cn": "盐湖区",
            "code": "044000"
          },
          {
            "cn": "稷山县",
            "code": "043200"
          },
          {
            "cn": "绛县",
            "code": "043600"
          },
          {
            "cn": "芮城县",
            "code": "044600"
          },
          {
            "cn": "闻喜县",
            "code": "043800"
          }
        ]
      },
      {
        "cn": "长治市",
        "code": "046000",
        "area": [
          {
            "cn": "壶关县",
            "code": "047300"
          },
          {
            "cn": "屯留县",
            "code": "046100"
          },
          {
            "cn": "平顺县",
            "code": "047400"
          },
          {
            "cn": "武乡县",
            "code": "046300"
          },
          {
            "cn": "沁县",
            "code": "046400"
          },
          {
            "cn": "沁源县",
            "code": "046500"
          },
          {
            "cn": "潞城市",
            "code": "047500"
          },
          {
            "cn": "襄垣县",
            "code": "046200"
          },
          {
            "cn": "长子县",
            "code": "046600"
          },
          {
            "cn": "长治县",
            "code": "047100"
          },
          {
            "cn": "黎城县",
            "code": "047600"
          }
        ]
      },
      {
        "cn": "阳泉市",
        "code": "045000",
        "area": [
          {
            "cn": "平定县",
            "code": "045200"
          },
          {
            "cn": "盂县",
            "code": "045100"
          }
        ]
      },
      {
        "cn": "咸阳市",
        "code": "712000",
        "area": [
          {
            "cn": "三原县",
            "code": "713800"
          },
          {
            "cn": "乾县",
            "code": "713300"
          },
          {
            "cn": "兴平市",
            "code": "713100"
          },
          {
            "cn": "彬县",
            "code": "713500"
          },
          {
            "cn": "旬邑县",
            "code": "711300"
          },
          {
            "cn": "杨凌区",
            "code": "712100"
          },
          {
            "cn": "武功县",
            "code": "712200"
          },
          {
            "cn": "永寿县",
            "code": "719000"
          },
          {
            "cn": "泾阳县",
            "code": "713700"
          },
          {
            "cn": "淳化县",
            "code": "711200"
          },
          {
            "cn": "渭城区",
            "code": "712000"
          },
          {
            "cn": "礼泉县",
            "code": "713200"
          },
          {
            "cn": "长武县",
            "code": "713600"
          }
        ]
      },
      {
        "cn": "商洛市",
        "code": "726000",
        "area": [
          {
            "cn": "丹凤县",
            "code": "726200"
          },
          {
            "cn": "商南县",
            "code": "726300"
          },
          {
            "cn": "商州区",
            "code": "726000"
          },
          {
            "cn": "山阳县",
            "code": "726400"
          },
          {
            "cn": "柞水县",
            "code": "711400"
          },
          {
            "cn": "洛南县",
            "code": "726100"
          },
          {
            "cn": "镇安县",
            "code": "711500"
          }
        ]
      },
      {
        "cn": "安康市",
        "code": "725000",
        "area": [
          {
            "cn": "宁陕县",
            "code": "711600"
          },
          {
            "cn": "岚皋县",
            "code": "725400"
          },
          {
            "cn": "平利县",
            "code": "725500"
          },
          {
            "cn": "旬阳县",
            "code": "725700"
          },
          {
            "cn": "汉滨区",
            "code": "725000"
          },
          {
            "cn": "汉阴县",
            "code": "725100"
          },
          {
            "cn": "白河县",
            "code": "725800"
          },
          {
            "cn": "石泉县",
            "code": "725200"
          },
          {
            "cn": "紫阳县",
            "code": "725300"
          },
          {
            "cn": "镇坪县",
            "code": "725600"
          }
        ]
      },
      {
        "cn": "宝鸡市",
        "code": "721000",
        "area": [
          {
            "cn": "凤县",
            "code": "721700"
          },
          {
            "cn": "凤翔县",
            "code": "721400"
          },
          {
            "cn": "千阳县",
            "code": "721100"
          },
          {
            "cn": "太白县",
            "code": "721600"
          },
          {
            "cn": "岐山县",
            "code": "722400"
          },
          {
            "cn": "扶风县",
            "code": "722200"
          },
          {
            "cn": "渭滨区",
            "code": "721000"
          },
          {
            "cn": "眉县",
            "code": "722300"
          },
          {
            "cn": "陇县",
            "code": "721200"
          },
          {
            "cn": "陈仓区",
            "code": "721300"
          },
          {
            "cn": "麟游县",
            "code": "721500"
          }
        ]
      },
      {
        "cn": "延安市",
        "code": "716000",
        "area": [
          {
            "cn": "子长县",
            "code": "717300"
          },
          {
            "cn": "安塞县",
            "code": "717400"
          },
          {
            "cn": "宜川县",
            "code": "716200"
          },
          {
            "cn": "宝塔区",
            "code": "716000"
          },
          {
            "cn": "富县",
            "code": "727500"
          },
          {
            "cn": "延川县",
            "code": "717200"
          },
          {
            "cn": "延长县",
            "code": "717100"
          },
          {
            "cn": "志丹县",
            "code": "717500"
          },
          {
            "cn": "洛川县",
            "code": "727400"
          },
          {
            "cn": "甘泉县",
            "code": "716100"
          },
          {
            "cn": "黄陵县",
            "code": "727300"
          },
          {
            "cn": "黄龙县",
            "code": "715700"
          }
        ]
      },
      {
        "cn": "榆林市",
        "code": "719000",
        "area": [
          {
            "cn": "佳县",
            "code": "719200"
          },
          {
            "cn": "吴堡县",
            "code": "718200"
          },
          {
            "cn": "子洲县",
            "code": "718400"
          },
          {
            "cn": "定边县",
            "code": "718600"
          },
          {
            "cn": "府谷县",
            "code": "719400"
          },
          {
            "cn": "清涧县",
            "code": "718300"
          },
          {
            "cn": "神木县",
            "code": "719300"
          },
          {
            "cn": "米脂县",
            "code": "718100"
          },
          {
            "cn": "绥德县",
            "code": "718000"
          },
          {
            "cn": "靖边县",
            "code": "718500"
          }
        ]
      },
      {
        "cn": "汉中市",
        "code": "723000",
        "area": [
          {
            "cn": "佛坪县",
            "code": "723400"
          },
          {
            "cn": "勉县",
            "code": "724200"
          },
          {
            "cn": "南郑县",
            "code": "723100"
          },
          {
            "cn": "城固县",
            "code": "723200"
          },
          {
            "cn": "宁强县",
            "code": "724400"
          },
          {
            "cn": "汉台区",
            "code": "723000"
          },
          {
            "cn": "洋县",
            "code": "723300"
          },
          {
            "cn": "留坝县",
            "code": "724100"
          },
          {
            "cn": "略阳县",
            "code": "724300"
          },
          {
            "cn": "西乡县",
            "code": "723500"
          },
          {
            "cn": "镇巴县",
            "code": "723600"
          }
        ]
      },
      {
        "cn": "渭南市",
        "code": "714000",
        "area": [
          {
            "cn": "临渭区",
            "code": "714000"
          },
          {
            "cn": "华县",
            "code": "714100"
          },
          {
            "cn": "华阴市",
            "code": "714200"
          },
          {
            "cn": "合阳县",
            "code": "715300"
          },
          {
            "cn": "大荔县",
            "code": "715100"
          },
          {
            "cn": "富平县",
            "code": "711700"
          },
          {
            "cn": "潼关县",
            "code": "727000"
          },
          {
            "cn": "澄城县",
            "code": "715200"
          },
          {
            "cn": "白水县",
            "code": "715600"
          },
          {
            "cn": "蒲城县",
            "code": "715500"
          },
          {
            "cn": "韩城市",
            "code": "715400"
          }
        ]
      },
      {
        "cn": "西安市",
        "code": "710000",
        "area": [
          {
            "cn": "临潼区",
            "code": "710600"
          },
          {
            "cn": "周至县",
            "code": "710400"
          },
          {
            "cn": "户县",
            "code": "710300"
          },
          {
            "cn": "新城区",
            "code": "710000"
          },
          {
            "cn": "蓝田县",
            "code": "710500"
          },
          {
            "cn": "长安区",
            "code": "710100"
          },
          {
            "cn": "高陵县",
            "code": "710200"
          }
        ]
      },
      {
        "cn": "铜川市",
        "code": "727000",
        "area": [
          {
            "cn": "印台区",
            "code": "713400"
          },
          {
            "cn": "宜君县",
            "code": "727200"
          },
          {
            "cn": "王益区",
            "code": "714300"
          },
          {
            "cn": "耀州区",
            "code": "727100"
          }
        ]
      }
    ]
  },
  {
    "cn": "上海市",
    "code": "shanghai",
    "citys": [
      {
        "cn": "上海市",
        "code": "200000",
        "area": [
          {
            "cn": "南汇区",
            "code": "201300"
          },
          {
            "cn": "卢湾区",
            "code": "200000"
          },
          {
            "cn": "嘉定区",
            "code": "201800"
          },
          {
            "cn": "奉贤区",
            "code": "201400"
          },
          {
            "cn": "宝山区",
            "code": "201900"
          },
          {
            "cn": "崇明县",
            "code": "202150"
          },
          {
            "cn": "松江区",
            "code": "201600"
          },
          {
            "cn": "浦东新区",
            "code": "200120"
          },
          {
            "cn": "金山区",
            "code": "201500"
          },
          {
            "cn": "闵行区",
            "code": "201100"
          },
          {
            "cn": "青浦区",
            "code": "201700"
          }
        ]
      }
    ]
  },
  {
    "cn": "安徽省",
    "code": "anhui",
    "citys": [
      {
        "cn": "亳州市",
        "code": "236000",
        "area": [
          {
            "cn": "利辛县",
            "code": "236700"
          },
          {
            "cn": "涡阳县",
            "code": "233600"
          },
          {
            "cn": "蒙城县",
            "code": "233500"
          },
          {
            "cn": "谯城区",
            "code": "236800"
          },
          {
            "cn": "临泉县",
            "code": "236400"
          },
          {
            "cn": "太和县",
            "code": "236600"
          },
          {
            "cn": "界首市",
            "code": "236500"
          },
          {
            "cn": "阜南县",
            "code": "236300"
          },
          {
            "cn": "颍上县",
            "code": "236200"
          },
          {
            "cn": "颍东区",
            "code": "236000"
          }
        ]
      },
      {
        "cn": "六安市",
        "code": "237000",
        "area": [
          {
            "cn": "寿县",
            "code": "232200"
          },
          {
            "cn": "舒城县",
            "code": "231300"
          },
          {
            "cn": "裕安区",
            "code": "237000"
          },
          {
            "cn": "金寨县",
            "code": "237300"
          },
          {
            "cn": "霍山县",
            "code": "237200"
          },
          {
            "cn": "霍邱县",
            "code": "237400"
          }
        ]
      },
      {
        "cn": "合肥市",
        "code": "230000",
        "area": [
          {
            "cn": "包河区",
            "code": "230000"
          },
          {
            "cn": "肥西县",
            "code": "231200"
          },
          {
            "cn": "长丰县",
            "code": "231100"
          }
        ]
      },
      {
        "cn": "安庆市",
        "code": "246000",
        "area": [
          {
            "cn": "大观区",
            "code": "246000"
          },
          {
            "cn": "太湖县",
            "code": "246400"
          },
          {
            "cn": "宿松县",
            "code": "246500"
          },
          {
            "cn": "岳西县",
            "code": "246600"
          },
          {
            "cn": "怀宁县",
            "code": "246100"
          },
          {
            "cn": "望江县",
            "code": "246200"
          },
          {
            "cn": "枞阳县",
            "code": "246700"
          },
          {
            "cn": "桐城市",
            "code": "231400"
          },
          {
            "cn": "潜山县",
            "code": "246300"
          }
        ]
      },
      {
        "cn": "宣城市",
        "code": "242000",
        "area": [
          {
            "cn": "宁国市",
            "code": "242300"
          },
          {
            "cn": "宣州区",
            "code": "242000"
          },
          {
            "cn": "广德县",
            "code": "242200"
          },
          {
            "cn": "旌德县",
            "code": "242600"
          },
          {
            "cn": "泾县",
            "code": "242500"
          },
          {
            "cn": "绩溪县",
            "code": "245300"
          },
          {
            "cn": "郎溪县",
            "code": "242100"
          }
        ]
      },
      {
        "cn": "宿州市",
        "code": "234000",
        "area": [
          {
            "cn": "墉桥区",
            "code": "234000"
          },
          {
            "cn": "泗县",
            "code": "234300"
          },
          {
            "cn": "灵璧县",
            "code": "234200"
          },
          {
            "cn": "砀山县",
            "code": "235300"
          },
          {
            "cn": "萧县",
            "code": "235200"
          }
        ]
      },
      {
        "cn": "巢湖市",
        "code": "238000",
        "area": [
          {
            "cn": "含山县",
            "code": "238100"
          },
          {
            "cn": "和县",
            "code": "238200"
          },
          {
            "cn": "居巢区",
            "code": "238000"
          },
          {
            "cn": "庐江县",
            "code": "231500"
          },
          {
            "cn": "无为县",
            "code": "238300"
          }
        ]
      },
      {
        "cn": "池州市",
        "code": "247100",
        "area": [
          {
            "cn": "东至县",
            "code": "247200"
          },
          {
            "cn": "石台县",
            "code": "245100"
          },
          {
            "cn": "贵池区",
            "code": "247100"
          },
          {
            "cn": "青阳县",
            "code": "242800"
          }
        ]
      },
      {
        "cn": "淮北市",
        "code": "235000",
        "area": [
          {
            "cn": "杜集区",
            "code": "235000"
          },
          {
            "cn": "濉溪县",
            "code": "235100"
          }
        ]
      },
      {
        "cn": "淮南市",
        "code": "232000",
        "area": [
          {
            "cn": "八公山区",
            "code": "232000"
          },
          {
            "cn": "凤台县",
            "code": "232100"
          }
        ]
      },
      {
        "cn": "滁州市",
        "code": "239000",
        "area": [
          {
            "cn": "全椒县",
            "code": "239500"
          },
          {
            "cn": "凤阳县",
            "code": "233100"
          },
          {
            "cn": "南谯区",
            "code": "239000"
          },
          {
            "cn": "天长市",
            "code": "239300"
          },
          {
            "cn": "定远县",
            "code": "233200"
          },
          {
            "cn": "明光市",
            "code": "239400"
          },
          {
            "cn": "来安县",
            "code": "239200"
          }
        ]
      },
      {
        "cn": "芜湖市",
        "code": "241000",
        "area": [
          {
            "cn": "三山区",
            "code": "241000"
          },
          {
            "cn": "南陵县",
            "code": "242400"
          },
          {
            "cn": "繁昌县",
            "code": "241200"
          },
          {
            "cn": "芜湖县",
            "code": "241100"
          }
        ]
      },
      {
        "cn": "蚌埠市",
        "code": "233000",
        "area": [
          {
            "cn": "五河县",
            "code": "233300"
          },
          {
            "cn": "固镇县",
            "code": "233700"
          },
          {
            "cn": "怀远县",
            "code": "233400"
          },
          {
            "cn": "淮上区",
            "code": "233000"
          }
        ]
      },
      {
        "cn": "铜陵市",
        "code": "244000",
        "area": [
          {
            "cn": "狮子山区",
            "code": "244000"
          },
          {
            "cn": "郊区",
            "code": "244011"
          },
          {
            "cn": "铜陵县",
            "code": "244100"
          }
        ]
      },
      {
        "cn": "阜阳市",
        "code": "236000",
        "area": [
          {
            "cn": "利辛县",
            "code": "236700"
          },
          {
            "cn": "涡阳县",
            "code": "233600"
          },
          {
            "cn": "蒙城县",
            "code": "233500"
          },
          {
            "cn": "谯城区",
            "code": "236800"
          },
          {
            "cn": "临泉县",
            "code": "236400"
          },
          {
            "cn": "太和县",
            "code": "236600"
          },
          {
            "cn": "界首市",
            "code": "236500"
          },
          {
            "cn": "阜南县",
            "code": "236300"
          },
          {
            "cn": "颍上县",
            "code": "236200"
          },
          {
            "cn": "颍东区",
            "code": "236000"
          }
        ]
      },
      {
        "cn": "马鞍山市",
        "code": "243000",
        "area": [
          {
            "cn": "当涂县",
            "code": "243100"
          },
          {
            "cn": "花山区",
            "code": "243000"
          }
        ]
      },
      {
        "cn": "黄山市",
        "code": "245000",
        "area": [
          {
            "cn": "休宁县",
            "code": "245400"
          },
          {
            "cn": "屯溪区",
            "code": "245000"
          },
          {
            "cn": "徽州区",
            "code": "245061"
          },
          {
            "cn": "歙县",
            "code": "245200"
          },
          {
            "cn": "祁门县",
            "code": "245600"
          },
          {
            "cn": "黟县",
            "code": "245500"
          }
        ]
      }
    ]
  },
  {
    "cn": "江苏省",
    "code": "jiangsu",
    "citys": [
      {
        "cn": "南京市",
        "code": "210000",
        "area": [
          {
            "cn": "下关区",
            "code": "210000"
          },
          {
            "cn": "六合区",
            "code": "211500"
          },
          {
            "cn": "江宁区",
            "code": "211100"
          },
          {
            "cn": "溧水县",
            "code": "211200"
          },
          {
            "cn": "高淳县",
            "code": "211300"
          }
        ]
      },
      {
        "cn": "南通市",
        "code": "226000",
        "area": [
          {
            "cn": "启东市",
            "code": "226200"
          },
          {
            "cn": "如东县",
            "code": "226400"
          },
          {
            "cn": "如皋市",
            "code": "226500"
          },
          {
            "cn": "崇川区",
            "code": "226000"
          },
          {
            "cn": "海安县",
            "code": "226600"
          },
          {
            "cn": "海门市",
            "code": "226100"
          },
          {
            "cn": "通州市",
            "code": "226300"
          }
        ]
      },
      {
        "cn": "宿迁市",
        "code": "223800",
        "area": [
          {
            "cn": "宿城区",
            "code": "223800"
          },
          {
            "cn": "沭阳县",
            "code": "223600"
          },
          {
            "cn": "泗洪县",
            "code": "223900"
          },
          {
            "cn": "泗阳县",
            "code": "223700"
          }
        ]
      },
      {
        "cn": "常州市",
        "code": "213000",
        "area": [
          {
            "cn": "天宁区",
            "code": "213000"
          },
          {
            "cn": "新北区",
            "code": "213002"
          },
          {
            "cn": "武进区",
            "code": "213100"
          },
          {
            "cn": "溧阳市",
            "code": "213300"
          },
          {
            "cn": "金坛市",
            "code": "213200"
          }
        ]
      },
      {
        "cn": "徐州市",
        "code": "221000",
        "area": [
          {
            "cn": "丰县",
            "code": "221700"
          },
          {
            "cn": "九里区",
            "code": "221000"
          },
          {
            "cn": "新沂市",
            "code": "221400"
          },
          {
            "cn": "沛县",
            "code": "221600"
          },
          {
            "cn": "睢宁县",
            "code": "221200"
          },
          {
            "cn": "邳州市",
            "code": "221300"
          },
          {
            "cn": "铜山县",
            "code": "221100"
          }
        ]
      },
      {
        "cn": "扬州市",
        "code": "225000",
        "area": [
          {
            "cn": "仪征市",
            "code": "211400"
          },
          {
            "cn": "宝应县",
            "code": "225800"
          },
          {
            "cn": "广陵区",
            "code": "225000"
          },
          {
            "cn": "江都市",
            "code": "225200"
          },
          {
            "cn": "维扬区",
            "code": "225002"
          },
          {
            "cn": "邗江区",
            "code": "225100"
          },
          {
            "cn": "高邮市",
            "code": "225600"
          }
        ]
      },
      {
        "cn": "无锡市",
        "code": "214000",
        "area": [
          {
            "cn": "北塘区",
            "code": "214000"
          },
          {
            "cn": "宜兴市",
            "code": "214200"
          },
          {
            "cn": "江阴市",
            "code": "214400"
          },
          {
            "cn": "滨湖区",
            "code": "214026"
          }
        ]
      },
      {
        "cn": "泰州市",
        "code": "215300",
        "area": [
          {
            "cn": "兴化市",
            "code": "225700"
          },
          {
            "cn": "姜堰市",
            "code": "225500"
          },
          {
            "cn": "泰兴市",
            "code": "225400"
          },
          {
            "cn": "海陵区",
            "code": "225300"
          },
          {
            "cn": "靖江市",
            "code": "214500"
          }
        ]
      },
      {
        "cn": "淮安市",
        "code": "223001",
        "area": [
          {
            "cn": "楚州区",
            "code": "223200"
          },
          {
            "cn": "洪泽县",
            "code": "223100"
          },
          {
            "cn": "涟水县",
            "code": "223400"
          },
          {
            "cn": "淮阴区",
            "code": "223300"
          },
          {
            "cn": "清河区",
            "code": "223001"
          },
          {
            "cn": "盱眙县",
            "code": "211700"
          },
          {
            "cn": "金湖县",
            "code": "211600"
          }
        ]
      },
      {
        "cn": "盐城市",
        "code": "224000",
        "area": [
          {
            "cn": "东台市",
            "code": "224200"
          },
          {
            "cn": "亭湖区",
            "code": "224001"
          },
          {
            "cn": "响水县",
            "code": "224600"
          },
          {
            "cn": "大丰市",
            "code": "224100"
          },
          {
            "cn": "射阳县",
            "code": "224300"
          },
          {
            "cn": "建湖县",
            "code": "224700"
          },
          {
            "cn": "滨海县",
            "code": "224000"
          },
          {
            "cn": "阜宁县",
            "code": "224400"
          }
        ]
      },
      {
        "cn": "苏州市",
        "code": "215000",
        "area": [
          {
            "cn": "吴中区",
            "code": "215100"
          },
          {
            "cn": "吴江市",
            "code": "215200"
          },
          {
            "cn": "太仓市",
            "code": "215400"
          },
          {
            "cn": "常熟市",
            "code": "215500"
          },
          {
            "cn": "平江区",
            "code": "215000"
          },
          {
            "cn": "张家港市",
            "code": "215600"
          },
          {
            "cn": "昆山市",
            "code": "215300"
          }
        ]
      },
      {
        "cn": "连云港市",
        "code": "222000",
        "area": [
          {
            "cn": "东海县",
            "code": "222300"
          },
          {
            "cn": "新浦区",
            "code": "222000"
          },
          {
            "cn": "灌云县",
            "code": "222200"
          },
          {
            "cn": "灌南县",
            "code": "223500"
          },
          {
            "cn": "赣榆县",
            "code": "222100"
          }
        ]
      },
      {
        "cn": "镇江市",
        "code": "212000",
        "area": [
          {
            "cn": "丹徒区",
            "code": "212100"
          },
          {
            "cn": "丹阳市",
            "code": "212300"
          },
          {
            "cn": "京口区",
            "code": "212000"
          },
          {
            "cn": "句容市",
            "code": "212400"
          },
          {
            "cn": "扬中市",
            "code": "212200"
          }
        ]
      }
    ]
  },
  {
    "cn": "浙江省",
    "code": "zhejiang",
    "citys": [
      {
        "cn": "丽水市",
        "code": "323000",
        "area": [
          {
            "cn": "云和县",
            "code": "323600"
          },
          {
            "cn": "庆元县",
            "code": "323800"
          },
          {
            "cn": "景宁畲族自治县",
            "code": "323500"
          },
          {
            "cn": "松阳县",
            "code": "323400"
          },
          {
            "cn": "缙云县",
            "code": "321400"
          },
          {
            "cn": "莲都区",
            "code": "323000"
          },
          {
            "cn": "遂昌县",
            "code": "323300"
          },
          {
            "cn": "青田县",
            "code": "323900"
          },
          {
            "cn": "龙泉市",
            "code": "323700"
          }
        ]
      },
      {
        "cn": "台州市",
        "code": "318000",
        "area": [
          {
            "cn": "三门县",
            "code": "317100"
          },
          {
            "cn": "临海市",
            "code": "317000"
          },
          {
            "cn": "仙居县",
            "code": "317300"
          },
          {
            "cn": "天台县",
            "code": "317200"
          },
          {
            "cn": "椒江区",
            "code": "317700"
          },
          {
            "cn": "温岭市",
            "code": "317500"
          },
          {
            "cn": "玉环县",
            "code": "317600"
          },
          {
            "cn": "路桥区",
            "code": "318000"
          },
          {
            "cn": "黄岩区",
            "code": "318020"
          }
        ]
      },
      {
        "cn": "嘉兴市",
        "code": "314000",
        "area": [
          {
            "cn": "南湖区",
            "code": "314000"
          },
          {
            "cn": "嘉善县",
            "code": "314100"
          },
          {
            "cn": "平湖市",
            "code": "314200"
          },
          {
            "cn": "桐乡市",
            "code": "314500"
          },
          {
            "cn": "海宁市",
            "code": "314400"
          },
          {
            "cn": "海盐县",
            "code": "314300"
          },
          {
            "cn": "秀洲区",
            "code": "314011"
          }
        ]
      },
      {
        "cn": "宁波市",
        "code": "315000",
        "area": [
          {
            "cn": "余姚市",
            "code": "315400"
          },
          {
            "cn": "北仑区",
            "code": "315800"
          },
          {
            "cn": "奉化市",
            "code": "315500"
          },
          {
            "cn": "宁海县",
            "code": "315600"
          },
          {
            "cn": "慈溪市",
            "code": "315300"
          },
          {
            "cn": "江东区",
            "code": "315000"
          },
          {
            "cn": "象山县",
            "code": "315700"
          },
          {
            "cn": "鄞州区",
            "code": "315100"
          },
          {
            "cn": "镇海区",
            "code": "315200"
          }
        ]
      },
      {
        "cn": "杭州市",
        "code": "310000",
        "area": [
          {
            "cn": "上城区",
            "code": "310000"
          },
          {
            "cn": "临安市",
            "code": "311300"
          },
          {
            "cn": "余杭区",
            "code": "311100"
          },
          {
            "cn": "富阳市",
            "code": "311400"
          },
          {
            "cn": "建德市",
            "code": "311600"
          },
          {
            "cn": "桐庐县",
            "code": "311500"
          },
          {
            "cn": "淳安县",
            "code": "311700"
          },
          {
            "cn": "萧山区",
            "code": "311200"
          }
        ]
      },
      {
        "cn": "温州市",
        "code": "325000",
        "area": [
          {
            "cn": "乐清市",
            "code": "325600"
          },
          {
            "cn": "平阳县",
            "code": "325400"
          },
          {
            "cn": "文成县",
            "code": "325300"
          },
          {
            "cn": "永嘉县",
            "code": "325100"
          },
          {
            "cn": "泰顺县",
            "code": "325500"
          },
          {
            "cn": "洞头县",
            "code": "325700"
          },
          {
            "cn": "瑞安市",
            "code": "325200"
          },
          {
            "cn": "瓯海区",
            "code": "325000"
          },
          {
            "cn": "苍南县",
            "code": "325800"
          }
        ]
      },
      {
        "cn": "湖州市",
        "code": "313000",
        "area": [
          {
            "cn": "南浔区",
            "code": "313000"
          },
          {
            "cn": "安吉县",
            "code": "313300"
          },
          {
            "cn": "德清县",
            "code": "313200"
          },
          {
            "cn": "长兴县",
            "code": "313100"
          }
        ]
      },
      {
        "cn": "绍兴市",
        "code": "312000",
        "area": [
          {
            "cn": "上虞市",
            "code": "312300"
          },
          {
            "cn": "嵊州市",
            "code": "312400"
          },
          {
            "cn": "新昌县",
            "code": "312500"
          },
          {
            "cn": "绍兴县",
            "code": "312000"
          },
          {
            "cn": "诸暨市",
            "code": "311800"
          }
        ]
      },
      {
        "cn": "舟山市",
        "code": "316000",
        "area": [
          {
            "cn": "定海区",
            "code": "316000"
          },
          {
            "cn": "岱山县",
            "code": "316200"
          },
          {
            "cn": "嵊泗县",
            "code": "202450"
          },
          {
            "cn": "普陀区",
            "code": "316100"
          }
        ]
      },
      {
        "cn": "衢州市",
        "code": "324000",
        "area": [
          {
            "cn": "常山县",
            "code": "324200"
          },
          {
            "cn": "开化县",
            "code": "324300"
          },
          {
            "cn": "柯城区",
            "code": "324000"
          },
          {
            "cn": "江山市",
            "code": "324100"
          },
          {
            "cn": "龙游县",
            "code": "324400"
          }
        ]
      },
      {
        "cn": "金华市",
        "code": "321000",
        "area": [
          {
            "cn": "东阳市",
            "code": "322100"
          },
          {
            "cn": "义乌市",
            "code": "322000"
          },
          {
            "cn": "兰溪市",
            "code": "321100"
          },
          {
            "cn": "婺城区",
            "code": "321000"
          },
          {
            "cn": "武义县",
            "code": "321200"
          },
          {
            "cn": "永康市",
            "code": "321300"
          },
          {
            "cn": "浦江县",
            "code": "322200"
          },
          {
            "cn": "磐安县",
            "code": "322300"
          }
        ]
      }
    ]
  },
  {
    "cn": "山东省",
    "code": "shandong",
    "citys": [
      {
        "cn": "东营市",
        "code": "257000",
        "area": [
          {
            "cn": "东营区",
            "code": "257100"
          },
          {
            "cn": "利津县",
            "code": "257400"
          },
          {
            "cn": "垦利县",
            "code": "257500"
          },
          {
            "cn": "广饶县",
            "code": "257300"
          },
          {
            "cn": "河口区",
            "code": "257200"
          }
        ]
      },
      {
        "cn": "临沂市",
        "code": "276000",
        "area": [
          {
            "cn": "临沭县",
            "code": "276700"
          },
          {
            "cn": "兰山区",
            "code": "276000"
          },
          {
            "cn": "平邑县",
            "code": "273300"
          },
          {
            "cn": "沂南县",
            "code": "276300"
          },
          {
            "cn": "沂水县",
            "code": "276400"
          },
          {
            "cn": "苍山县",
            "code": "277700"
          },
          {
            "cn": "莒南县",
            "code": "276600"
          },
          {
            "cn": "蒙阴县",
            "code": "276200"
          },
          {
            "cn": "费县",
            "code": "273400"
          },
          {
            "cn": "郯城县",
            "code": "276100"
          }
        ]
      },
      {
        "cn": "威海市",
        "code": "264200",
        "area": [
          {
            "cn": "乳山市",
            "code": "264500"
          },
          {
            "cn": "文登市",
            "code": "264400"
          },
          {
            "cn": "环翠区",
            "code": "264200"
          },
          {
            "cn": "荣成市",
            "code": "264300"
          }
        ]
      },
      {
        "cn": "德州市",
        "code": "253000",
        "area": [
          {
            "cn": "临邑县",
            "code": "251500"
          },
          {
            "cn": "乐陵市",
            "code": "253600"
          },
          {
            "cn": "夏津县",
            "code": "253200"
          },
          {
            "cn": "宁津县",
            "code": "253400"
          },
          {
            "cn": "平原县",
            "code": "253100"
          },
          {
            "cn": "庆云县",
            "code": "253700"
          },
          {
            "cn": "德城区",
            "code": "253000"
          },
          {
            "cn": "武城县",
            "code": "253300"
          },
          {
            "cn": "禹城市",
            "code": "251200"
          },
          {
            "cn": "陵县",
            "code": "253500"
          },
          {
            "cn": "齐河县",
            "code": "251100"
          }
        ]
      },
      {
        "cn": "日照市",
        "code": "276800",
        "area": [
          {
            "cn": "东港区",
            "code": "276800"
          },
          {
            "cn": "五莲县",
            "code": "262300"
          },
          {
            "cn": "莒县",
            "code": "276500"
          }
        ]
      },
      {
        "cn": "枣庄市",
        "code": "277000",
        "area": [
          {
            "cn": "台儿庄区",
            "code": "277400"
          },
          {
            "cn": "山亭区",
            "code": "277200"
          },
          {
            "cn": "峄城区",
            "code": "277300"
          },
          {
            "cn": "市中区",
            "code": "250000"
          },
          {
            "cn": "滕州市",
            "code": "277500"
          },
          {
            "cn": "薛城区",
            "code": "277000"
          }
        ]
      },
      {
        "cn": "泰安市",
        "code": "271000",
        "area": [
          {
            "cn": "东平县",
            "code": "271500"
          },
          {
            "cn": "宁阳县",
            "code": "271400"
          },
          {
            "cn": "岱岳区",
            "code": "271000"
          },
          {
            "cn": "新泰市",
            "code": "271200"
          },
          {
            "cn": "肥城市",
            "code": "271600"
          }
        ]
      },
      {
        "cn": "济南市",
        "code": "250000",
        "area": [
          {
            "cn": "历城区",
            "code": "250100"
          },
          {
            "cn": "商河县",
            "code": "251600"
          },
          {
            "cn": "平阴县",
            "code": "250400"
          },
          {
            "cn": "济阳县",
            "code": "251400"
          },
          {
            "cn": "章丘市",
            "code": "250200"
          },
          {
            "cn": "长清区",
            "code": "250300"
          }
        ]
      },
      {
        "cn": "济宁市",
        "code": "272000",
        "area": [
          {
            "cn": "任城区",
            "code": "272000"
          },
          {
            "cn": "嘉祥县",
            "code": "272400"
          },
          {
            "cn": "微山县",
            "code": "277600"
          },
          {
            "cn": "曲阜市",
            "code": "273100"
          },
          {
            "cn": "梁山县",
            "code": "272600"
          },
          {
            "cn": "汶上县",
            "code": "272500"
          },
          {
            "cn": "泗水县",
            "code": "273200"
          },
          {
            "cn": "邹城市",
            "code": "273500"
          },
          {
            "cn": "金乡县",
            "code": "272200"
          },
          {
            "cn": "鱼台县",
            "code": "272300"
          }
        ]
      },
      {
        "cn": "淄博市",
        "code": "255000",
        "area": [
          {
            "cn": "临淄区",
            "code": "255400"
          },
          {
            "cn": "博山区",
            "code": "255200"
          },
          {
            "cn": "周村区",
            "code": "255300"
          },
          {
            "cn": "张店区",
            "code": "255000"
          },
          {
            "cn": "桓台县",
            "code": "256400"
          },
          {
            "cn": "沂源县",
            "code": "256100"
          },
          {
            "cn": "淄川区",
            "code": "255100"
          },
          {
            "cn": "高青县",
            "code": "256300"
          }
        ]
      },
      {
        "cn": "滨州市",
        "code": "256600",
        "area": [
          {
            "cn": "博兴县",
            "code": "256500"
          },
          {
            "cn": "惠民县",
            "code": "251700"
          },
          {
            "cn": "无棣县",
            "code": "251900"
          },
          {
            "cn": "沾化县",
            "code": "256800"
          },
          {
            "cn": "滨城区",
            "code": "256600"
          },
          {
            "cn": "邹平县",
            "code": "256200"
          },
          {
            "cn": "阳信县",
            "code": "251800"
          }
        ]
      },
      {
        "cn": "潍坊市",
        "code": "261000",
        "area": [
          {
            "cn": "临朐县",
            "code": "262600"
          },
          {
            "cn": "坊子区",
            "code": "261200"
          },
          {
            "cn": "奎文区",
            "code": "261000"
          },
          {
            "cn": "安丘市",
            "code": "262100"
          },
          {
            "cn": "寒亭区",
            "code": "261100"
          },
          {
            "cn": "寿光市",
            "code": "262700"
          },
          {
            "cn": "昌乐县",
            "code": "262400"
          },
          {
            "cn": "昌邑市",
            "code": "261300"
          },
          {
            "cn": "诸城市",
            "code": "262200"
          },
          {
            "cn": "青州市",
            "code": "262500"
          },
          {
            "cn": "高密市",
            "code": "261500"
          }
        ]
      },
      {
        "cn": "烟台市",
        "code": "264000",
        "area": [
          {
            "cn": "开发区",
            "code": "264000"
          },
          {
            "cn": "招远市",
            "code": "265400"
          },
          {
            "cn": "栖霞市",
            "code": "265300"
          },
          {
            "cn": "海阳市",
            "code": "265100"
          },
          {
            "cn": "牟平区",
            "code": "264100"
          },
          {
            "cn": "福山区",
            "code": "265500"
          },
          {
            "cn": "莱州市",
            "code": "261400"
          },
          {
            "cn": "莱阳市",
            "code": "266600"
          },
          {
            "cn": "蓬莱市",
            "code": "265600"
          },
          {
            "cn": "长岛县",
            "code": "265800"
          },
          {
            "cn": "龙口市",
            "code": "265700"
          }
        ]
      },
      {
        "cn": "聊城市",
        "code": "252000",
        "area": [
          {
            "cn": "东昌府区",
            "code": "252000"
          },
          {
            "cn": "东阿县",
            "code": "252200"
          },
          {
            "cn": "临清市",
            "code": "252600"
          },
          {
            "cn": "冠县",
            "code": "252500"
          },
          {
            "cn": "茌平县",
            "code": "252100"
          },
          {
            "cn": "莘县",
            "code": "252400"
          },
          {
            "cn": "阳谷县",
            "code": "252300"
          },
          {
            "cn": "高唐县",
            "code": "252800"
          }
        ]
      },
      {
        "cn": "莱芜市",
        "code": "271100",
        "area": [
          {
            "cn": "莱城区",
            "code": "271100"
          }
        ]
      },
      {
        "cn": "菏泽市",
        "code": "274000",
        "area": [
          {
            "cn": "东明县",
            "code": "274500"
          },
          {
            "cn": "单县",
            "code": "274300"
          },
          {
            "cn": "定陶县",
            "code": "274100"
          },
          {
            "cn": "巨野县",
            "code": "274900"
          },
          {
            "cn": "成武县",
            "code": "274200"
          },
          {
            "cn": "曹县",
            "code": "274400"
          },
          {
            "cn": "牡丹区",
            "code": "274000"
          },
          {
            "cn": "郓城县",
            "code": "274700"
          },
          {
            "cn": "鄄城县",
            "code": "274600"
          }
        ]
      },
      {
        "cn": "青岛市",
        "code": "266000",
        "area": [
          {
            "cn": "即墨市",
            "code": "266200"
          },
          {
            "cn": "四方区",
            "code": "266000"
          },
          {
            "cn": "崂山区",
            "code": "266100"
          },
          {
            "cn": "平度市",
            "code": "266700"
          },
          {
            "cn": "胶南市",
            "code": "266400"
          },
          {
            "cn": "胶州市",
            "code": "266300"
          }
        ]
      }
    ]
  },
  {
    "cn": "江西省",
    "code": "jiangxi",
    "citys": [
      {
        "cn": "上饶市",
        "code": "334000",
        "area": [
          {
            "cn": "万年县",
            "code": "335500"
          },
          {
            "cn": "上饶县",
            "code": "334100"
          },
          {
            "cn": "余干县",
            "code": "335100"
          },
          {
            "cn": "信州区",
            "code": "334000"
          },
          {
            "cn": "婺源县",
            "code": "333200"
          },
          {
            "cn": "广丰县",
            "code": "334600"
          },
          {
            "cn": "弋阳县",
            "code": "334400"
          },
          {
            "cn": "德兴市",
            "code": "334200"
          },
          {
            "cn": "横峰县",
            "code": "334300"
          },
          {
            "cn": "玉山县",
            "code": "334700"
          },
          {
            "cn": "鄱阳县",
            "code": "333100"
          },
          {
            "cn": "铅山县",
            "code": "334500"
          }
        ]
      },
      {
        "cn": "九江市",
        "code": "332000",
        "area": [
          {
            "cn": "九江县",
            "code": "332100"
          },
          {
            "cn": "修水县",
            "code": "332400"
          },
          {
            "cn": "共青城",
            "code": "332000"
          },
          {
            "cn": "庐山区",
            "code": "332900"
          },
          {
            "cn": "彭泽县",
            "code": "332700"
          },
          {
            "cn": "德安县",
            "code": "330400"
          },
          {
            "cn": "星子县",
            "code": "332800"
          },
          {
            "cn": "武宁县",
            "code": "332300"
          },
          {
            "cn": "永修县",
            "code": "330300"
          },
          {
            "cn": "湖口县",
            "code": "332500"
          },
          {
            "cn": "瑞昌市",
            "code": "332200"
          },
          {
            "cn": "都昌县",
            "code": "332600"
          }
        ]
      },
      {
        "cn": "南昌市",
        "code": "330000",
        "area": [
          {
            "cn": "东湖区",
            "code": "330000"
          },
          {
            "cn": "南昌县",
            "code": "330200"
          },
          {
            "cn": "安义县",
            "code": "330500"
          },
          {
            "cn": "新建县",
            "code": "330100"
          },
          {
            "cn": "进贤县",
            "code": "331700"
          },
          {
            "cn": "青山湖区",
            "code": "330001"
          }
        ]
      },
      {
        "cn": "吉安市",
        "code": "343000",
        "area": [
          {
            "cn": "万安县",
            "code": "343800"
          },
          {
            "cn": "井冈山市",
            "code": "343600"
          },
          {
            "cn": "吉安县",
            "code": "343100"
          },
          {
            "cn": "吉州区",
            "code": "343000"
          },
          {
            "cn": "吉水县",
            "code": "331600"
          },
          {
            "cn": "安福县",
            "code": "343200"
          },
          {
            "cn": "峡江县",
            "code": "331400"
          },
          {
            "cn": "新干县",
            "code": "331300"
          },
          {
            "cn": "永丰县",
            "code": "331500"
          },
          {
            "cn": "永新县",
            "code": "343400"
          },
          {
            "cn": "泰和县",
            "code": "343700"
          },
          {
            "cn": "遂川县",
            "code": "343900"
          }
        ]
      },
      {
        "cn": "宜春市",
        "code": "336000",
        "area": [
          {
            "cn": "万载县",
            "code": "336100"
          },
          {
            "cn": "上高县",
            "code": "336400"
          },
          {
            "cn": "丰城市",
            "code": "331100"
          },
          {
            "cn": "奉新县",
            "code": "330700"
          },
          {
            "cn": "宜丰县",
            "code": "336300"
          },
          {
            "cn": "樟树市",
            "code": "331200"
          },
          {
            "cn": "袁州区",
            "code": "336000"
          },
          {
            "cn": "铜鼓县",
            "code": "336200"
          },
          {
            "cn": "靖安县",
            "code": "330600"
          },
          {
            "cn": "高安市",
            "code": "330800"
          }
        ]
      },
      {
        "cn": "抚州市",
        "code": "344000",
        "area": [
          {
            "cn": "东乡县",
            "code": "331800"
          },
          {
            "cn": "临川区",
            "code": "344100"
          },
          {
            "cn": "乐安县",
            "code": "344300"
          },
          {
            "cn": "南丰县",
            "code": "344500"
          },
          {
            "cn": "南城县",
            "code": "344700"
          },
          {
            "cn": "宜黄县",
            "code": "344400"
          },
          {
            "cn": "崇仁县",
            "code": "344200"
          },
          {
            "cn": "广昌县",
            "code": "344900"
          },
          {
            "cn": "资溪县",
            "code": "335300"
          },
          {
            "cn": "金溪县",
            "code": "344800"
          },
          {
            "cn": "黎川县",
            "code": "344600"
          }
        ]
      },
      {
        "cn": "新余市",
        "code": "338000",
        "area": [
          {
            "cn": "分宜县",
            "code": "336600"
          },
          {
            "cn": "渝水区",
            "code": "338000"
          }
        ]
      },
      {
        "cn": "景德镇市",
        "code": "333000",
        "area": [
          {
            "cn": "乐平市",
            "code": "333300"
          },
          {
            "cn": "昌江区",
            "code": "333000"
          },
          {
            "cn": "浮梁县",
            "code": "333400"
          }
        ]
      },
      {
        "cn": "萍乡市",
        "code": "337000",
        "area": [
          {
            "cn": "上栗县",
            "code": "337000"
          },
          {
            "cn": "莲花县",
            "code": "337100"
          }
        ]
      },
      {
        "cn": "赣州市",
        "code": "341000",
        "area": [
          {
            "cn": "上犹县",
            "code": "341200"
          },
          {
            "cn": "于都县",
            "code": "342300"
          },
          {
            "cn": "会昌县",
            "code": "342600"
          },
          {
            "cn": "信丰县",
            "code": "341600"
          },
          {
            "cn": "全南县",
            "code": "341800"
          },
          {
            "cn": "兴国县",
            "code": "342400"
          },
          {
            "cn": "南康市",
            "code": "341400"
          },
          {
            "cn": "大余县",
            "code": "341500"
          },
          {
            "cn": "宁都县",
            "code": "342800"
          },
          {
            "cn": "安远县",
            "code": "342100"
          },
          {
            "cn": "定南县",
            "code": "341900"
          },
          {
            "cn": "寻乌县",
            "code": "342200"
          },
          {
            "cn": "崇义县",
            "code": "341300"
          },
          {
            "cn": "瑞金市",
            "code": "342500"
          },
          {
            "cn": "石城县",
            "code": "342700"
          },
          {
            "cn": "章贡区",
            "code": "341000"
          },
          {
            "cn": "赣县",
            "code": "341100"
          },
          {
            "cn": "龙南县",
            "code": "341700"
          }
        ]
      },
      {
        "cn": "鹰潭市",
        "code": "335000",
        "area": [
          {
            "cn": "余江县",
            "code": "335200"
          },
          {
            "cn": "月湖区",
            "code": "335000"
          },
          {
            "cn": "贵溪市",
            "code": "335400"
          }
        ]
      }
    ]
  },
  {
    "cn": "福建省",
    "code": "fujian",
    "citys": [
      {
        "cn": "三明市",
        "code": "353000",
        "area": [
          {
            "cn": "三元区",
            "code": "365000"
          },
          {
            "cn": "大田县",
            "code": "366100"
          },
          {
            "cn": "宁化县",
            "code": "365400"
          },
          {
            "cn": "将乐县",
            "code": "353300"
          },
          {
            "cn": "尤溪县",
            "code": "365100"
          },
          {
            "cn": "建宁县",
            "code": "354500"
          },
          {
            "cn": "明溪县",
            "code": "365200"
          },
          {
            "cn": "永安市",
            "code": "366000"
          },
          {
            "cn": "沙县",
            "code": "365500"
          },
          {
            "cn": "泰宁县",
            "code": "354400"
          },
          {
            "cn": "清流县",
            "code": "365300"
          },
          {
            "cn": "光泽县",
            "code": "354100"
          },
          {
            "cn": "延平区",
            "code": "353000"
          },
          {
            "cn": "建瓯市",
            "code": "353100"
          },
          {
            "cn": "建阳市",
            "code": "354200"
          },
          {
            "cn": "政和县",
            "code": "353600"
          },
          {
            "cn": "松溪县",
            "code": "353500"
          },
          {
            "cn": "武夷山市",
            "code": "354300"
          },
          {
            "cn": "浦城县",
            "code": "353400"
          },
          {
            "cn": "邵武市",
            "code": "354000"
          },
          {
            "cn": "顺昌县",
            "code": "353200"
          }
        ]
      },
      {
        "cn": "南平市",
        "code": "353000",
        "area": [
          {
            "cn": "三元区",
            "code": "365000"
          },
          {
            "cn": "大田县",
            "code": "366100"
          },
          {
            "cn": "宁化县",
            "code": "365400"
          },
          {
            "cn": "将乐县",
            "code": "353300"
          },
          {
            "cn": "尤溪县",
            "code": "365100"
          },
          {
            "cn": "建宁县",
            "code": "354500"
          },
          {
            "cn": "明溪县",
            "code": "365200"
          },
          {
            "cn": "永安市",
            "code": "366000"
          },
          {
            "cn": "沙县",
            "code": "365500"
          },
          {
            "cn": "泰宁县",
            "code": "354400"
          },
          {
            "cn": "清流县",
            "code": "365300"
          },
          {
            "cn": "光泽县",
            "code": "354100"
          },
          {
            "cn": "延平区",
            "code": "353000"
          },
          {
            "cn": "建瓯市",
            "code": "353100"
          },
          {
            "cn": "建阳市",
            "code": "354200"
          },
          {
            "cn": "政和县",
            "code": "353600"
          },
          {
            "cn": "松溪县",
            "code": "353500"
          },
          {
            "cn": "武夷山市",
            "code": "354300"
          },
          {
            "cn": "浦城县",
            "code": "353400"
          },
          {
            "cn": "邵武市",
            "code": "354000"
          },
          {
            "cn": "顺昌县",
            "code": "353200"
          }
        ]
      },
      {
        "cn": "厦门市",
        "code": "361000",
        "area": [
          {
            "cn": "同安区",
            "code": "361100"
          },
          {
            "cn": "思明区",
            "code": "361000"
          },
          {
            "cn": "上杭县",
            "code": "364200"
          },
          {
            "cn": "新罗区",
            "code": "364000"
          },
          {
            "cn": "武平县",
            "code": "364300"
          },
          {
            "cn": "永定县",
            "code": "364100"
          },
          {
            "cn": "漳平市",
            "code": "364400"
          },
          {
            "cn": "连城县",
            "code": "366200"
          },
          {
            "cn": "长汀县",
            "code": "366300"
          }
        ]
      },
      {
        "cn": "宁德市",
        "code": "352000",
        "area": [
          {
            "cn": "古田县",
            "code": "352200"
          },
          {
            "cn": "周宁县",
            "code": "355400"
          },
          {
            "cn": "寿宁县",
            "code": "355500"
          },
          {
            "cn": "屏南县",
            "code": "352300"
          },
          {
            "cn": "柘荣县",
            "code": "355300"
          },
          {
            "cn": "福安市",
            "code": "355000"
          },
          {
            "cn": "福鼎市",
            "code": "355200"
          },
          {
            "cn": "蕉城区",
            "code": "352000"
          },
          {
            "cn": "霞浦县",
            "code": "355100"
          }
        ]
      },
      {
        "cn": "泉州市",
        "code": "362000",
        "area": [
          {
            "cn": "丰泽区",
            "code": "362000"
          },
          {
            "cn": "南安市",
            "code": "362300"
          },
          {
            "cn": "安溪县",
            "code": "362400"
          },
          {
            "cn": "德化县",
            "code": "362500"
          },
          {
            "cn": "惠安县",
            "code": "362100"
          },
          {
            "cn": "晋江市",
            "code": "362200"
          },
          {
            "cn": "永春县",
            "code": "362600"
          },
          {
            "cn": "石狮市",
            "code": "362700"
          }
        ]
      },
      {
        "cn": "漳州市",
        "code": "363000",
        "area": [
          {
            "cn": "东山县",
            "code": "363400"
          },
          {
            "cn": "云霄县",
            "code": "363300"
          },
          {
            "cn": "华安县",
            "code": "363800"
          },
          {
            "cn": "南靖县",
            "code": "363600"
          },
          {
            "cn": "平和县",
            "code": "363700"
          },
          {
            "cn": "漳浦县",
            "code": "363200"
          },
          {
            "cn": "芗城区",
            "code": "363000"
          },
          {
            "cn": "诏安县",
            "code": "363500"
          },
          {
            "cn": "长泰县",
            "code": "363900"
          },
          {
            "cn": "龙海市",
            "code": "363100"
          }
        ]
      },
      {
        "cn": "福州市",
        "code": "350000",
        "area": [
          {
            "cn": "仓山区",
            "code": "350000"
          },
          {
            "cn": "平潭县",
            "code": "350400"
          },
          {
            "cn": "永泰县",
            "code": "350700"
          },
          {
            "cn": "福清市",
            "code": "350300"
          },
          {
            "cn": "罗源县",
            "code": "350600"
          },
          {
            "cn": "连江县",
            "code": "350500"
          },
          {
            "cn": "长乐市",
            "code": "350200"
          },
          {
            "cn": "闽侯县",
            "code": "350100"
          },
          {
            "cn": "闽清县",
            "code": "350800"
          }
        ]
      },
      {
        "cn": "莆田市",
        "code": "351100",
        "area": [
          {
            "cn": "仙游县",
            "code": "351200"
          },
          {
            "cn": "城厢区",
            "code": "351100"
          }
        ]
      },
      {
        "cn": "龙岩市",
        "code": "361000",
        "area": [
          {
            "cn": "同安区",
            "code": "361100"
          },
          {
            "cn": "思明区",
            "code": "361000"
          },
          {
            "cn": "上杭县",
            "code": "364200"
          },
          {
            "cn": "新罗区",
            "code": "364000"
          },
          {
            "cn": "武平县",
            "code": "364300"
          },
          {
            "cn": "永定县",
            "code": "364100"
          },
          {
            "cn": "漳平市",
            "code": "364400"
          },
          {
            "cn": "连城县",
            "code": "366200"
          },
          {
            "cn": "长汀县",
            "code": "366300"
          }
        ]
      }
    ]
  },
  {
    "cn": "广东省",
    "code": "guangdong",
    "citys": [
      {
        "cn": "云浮市",
        "code": "527300",
        "area": [
          {
            "cn": "云城区",
            "code": "527300"
          },
          {
            "cn": "云安县",
            "code": "527500"
          },
          {
            "cn": "新兴县",
            "code": "527400"
          },
          {
            "cn": "罗定市",
            "code": "527200"
          },
          {
            "cn": "郁南县",
            "code": "527100"
          }
        ]
      },
      {
        "cn": "佛山市",
        "code": "528000",
        "area": [
          {
            "cn": "三水区",
            "code": "528100"
          },
          {
            "cn": "南海区",
            "code": "528200"
          },
          {
            "cn": "禅城区",
            "code": "528000"
          },
          {
            "cn": "高明区",
            "code": "528500"
          }
        ]
      },
      {
        "cn": "广州市",
        "code": "510000",
        "area": [
          {
            "cn": "东山区",
            "code": "522000"
          },
          {
            "cn": "从化市",
            "code": "510900"
          },
          {
            "cn": "增城市",
            "code": "511300"
          },
          {
            "cn": "天河区",
            "code": "510000"
          },
          {
            "cn": "番禺区",
            "code": "511400"
          },
          {
            "cn": "花都区",
            "code": "510800"
          },
          {
            "cn": "芳村区",
            "code": "401420"
          },
          {
            "cn": "黄埔区",
            "code": "510700"
          }
        ]
      },
      {
        "cn": "惠州市",
        "code": "516000",
        "area": [
          {
            "cn": "博罗县",
            "code": "516100"
          },
          {
            "cn": "惠东县",
            "code": "516300"
          },
          {
            "cn": "惠城区",
            "code": "516000"
          },
          {
            "cn": "惠阳区",
            "code": "516200"
          },
          {
            "cn": "龙门县",
            "code": "516800"
          }
        ]
      },
      {
        "cn": "揭阳市",
        "code": "522000",
        "area": [
          {
            "cn": "惠来县",
            "code": "515200"
          },
          {
            "cn": "揭东县",
            "code": "515500"
          },
          {
            "cn": "揭西县",
            "code": "515400"
          },
          {
            "cn": "普宁市",
            "code": "515300"
          }
        ]
      },
      {
        "cn": "梅州市",
        "code": "514000",
        "area": [
          {
            "cn": "丰顺县",
            "code": "514300"
          },
          {
            "cn": "五华县",
            "code": "514400"
          },
          {
            "cn": "兴宁市",
            "code": "514500"
          },
          {
            "cn": "大埔县",
            "code": "514200"
          },
          {
            "cn": "平远县",
            "code": "514600"
          },
          {
            "cn": "梅县",
            "code": "514700"
          },
          {
            "cn": "梅江区",
            "code": "514000"
          },
          {
            "cn": "蕉岭县",
            "code": "514100"
          }
        ]
      },
      {
        "cn": "汕头市",
        "code": "515000",
        "area": [
          {
            "cn": "南澳县",
            "code": "515900"
          },
          {
            "cn": "潮南区",
            "code": "515100"
          },
          {
            "cn": "澄海区",
            "code": "515800"
          },
          {
            "cn": "濠江区",
            "code": "515000"
          }
        ]
      },
      {
        "cn": "汕尾市",
        "code": "516600",
        "area": [
          {
            "cn": "城区",
            "code": "516600"
          },
          {
            "cn": "海丰县",
            "code": "516400"
          },
          {
            "cn": "陆丰市",
            "code": "516500"
          },
          {
            "cn": "陆河县",
            "code": "516700"
          }
        ]
      },
      {
        "cn": "江门市",
        "code": "529000",
        "area": [
          {
            "cn": "台山市",
            "code": "529200"
          },
          {
            "cn": "开平市",
            "code": "529300"
          },
          {
            "cn": "恩平市",
            "code": "529400"
          },
          {
            "cn": "新会区",
            "code": "529100"
          },
          {
            "cn": "江海区",
            "code": "529000"
          },
          {
            "cn": "鹤山市",
            "code": "529700"
          }
        ]
      },
      {
        "cn": "河源市",
        "code": "517000",
        "area": [
          {
            "cn": "东源县",
            "code": "517500"
          },
          {
            "cn": "和平县",
            "code": "517200"
          },
          {
            "cn": "源城区",
            "code": "517000"
          },
          {
            "cn": "紫金县",
            "code": "517400"
          },
          {
            "cn": "连平县",
            "code": "517100"
          },
          {
            "cn": "龙川县",
            "code": "517300"
          }
        ]
      },
      {
        "cn": "深圳市",
        "code": "518000",
        "area": [
          {
            "cn": "南山区",
            "code": "518000"
          },
          {
            "cn": "宝安区",
            "code": "518100"
          }
        ]
      },
      {
        "cn": "清远市",
        "code": "511500",
        "area": [
          {
            "cn": "佛冈县",
            "code": "511600"
          },
          {
            "cn": "清城区",
            "code": "511500"
          },
          {
            "cn": "清新县",
            "code": "511800"
          },
          {
            "cn": "英德市",
            "code": "513000"
          },
          {
            "cn": "连南瑶族自治县",
            "code": "513300"
          },
          {
            "cn": "连山壮族瑶族自治县",
            "code": "513200"
          },
          {
            "cn": "连州市",
            "code": "513400"
          },
          {
            "cn": "阳山县",
            "code": "513100"
          }
        ]
      },
      {
        "cn": "湛江市",
        "code": "524000",
        "area": [
          {
            "cn": "东海岛",
            "code": "524000"
          },
          {
            "cn": "吴川市",
            "code": "524500"
          },
          {
            "cn": "廉江市",
            "code": "524400"
          },
          {
            "cn": "徐闻县",
            "code": "524100"
          },
          {
            "cn": "遂溪县",
            "code": "524300"
          },
          {
            "cn": "雷州市",
            "code": "524200"
          }
        ]
      },
      {
        "cn": "潮州市",
        "code": "521000",
        "area": [
          {
            "cn": "枫溪区",
            "code": "521000"
          },
          {
            "cn": "潮安县",
            "code": "515600"
          },
          {
            "cn": "饶平县",
            "code": "515700"
          }
        ]
      },
      {
        "cn": "珠海市",
        "code": "519000",
        "area": [
          {
            "cn": "斗门区",
            "code": "519100"
          },
          {
            "cn": "金湾区",
            "code": "519090"
          },
          {
            "cn": "香洲区",
            "code": "519000"
          }
        ]
      },
      {
        "cn": "肇庆市",
        "code": "526000",
        "area": [
          {
            "cn": "四会市",
            "code": "526200"
          },
          {
            "cn": "封开县",
            "code": "526500"
          },
          {
            "cn": "广宁县",
            "code": "526300"
          },
          {
            "cn": "德庆县",
            "code": "526600"
          },
          {
            "cn": "怀集县",
            "code": "526400"
          },
          {
            "cn": "端州区",
            "code": "526000"
          },
          {
            "cn": "高要市",
            "code": "526100"
          }
        ]
      },
      {
        "cn": "茂名市",
        "code": "525000",
        "area": [
          {
            "cn": "信宜市",
            "code": "525300"
          },
          {
            "cn": "化州市",
            "code": "525100"
          },
          {
            "cn": "电白县",
            "code": "525400"
          },
          {
            "cn": "茂南区",
            "code": "525000"
          },
          {
            "cn": "高州市",
            "code": "525200"
          }
        ]
      },
      {
        "cn": "阳江市",
        "code": "529500",
        "area": [
          {
            "cn": "江城区",
            "code": "529500"
          },
          {
            "cn": "阳东县",
            "code": "529900"
          },
          {
            "cn": "阳春市",
            "code": "529600"
          },
          {
            "cn": "阳西县",
            "code": "529800"
          }
        ]
      },
      {
        "cn": "韶关市",
        "code": "512000",
        "area": [
          {
            "cn": "乐昌市",
            "code": "512200"
          },
          {
            "cn": "乳源瑶族自治县",
            "code": "512600"
          },
          {
            "cn": "仁化县",
            "code": "512300"
          },
          {
            "cn": "南雄市",
            "code": "512400"
          },
          {
            "cn": "始兴县",
            "code": "512500"
          },
          {
            "cn": "新丰县",
            "code": "511100"
          },
          {
            "cn": "曲江区",
            "code": "512100"
          },
          {
            "cn": "武江区",
            "code": "512000"
          }
        ]
      }
    ]
  },
  {
    "cn": "广西壮族自治区",
    "code": "guangxi",
    "citys": [
      {
        "cn": "北海市",
        "code": "536000",
        "area": [
          {
            "cn": "合浦县",
            "code": "536100"
          },
          {
            "cn": "海城区",
            "code": "536000"
          }
        ]
      },
      {
        "cn": "南宁市",
        "code": "530000",
        "area": [
          {
            "cn": "上林县",
            "code": "530500"
          },
          {
            "cn": "兴宁区",
            "code": "530000"
          },
          {
            "cn": "宾阳县",
            "code": "530400"
          },
          {
            "cn": "横县",
            "code": "530300"
          },
          {
            "cn": "武鸣县",
            "code": "530100"
          },
          {
            "cn": "良庆区",
            "code": "530200"
          },
          {
            "cn": "隆安县",
            "code": "532700"
          },
          {
            "cn": "马山县",
            "code": "530600"
          }
        ]
      },
      {
        "cn": "崇左市",
        "code": "532200",
        "area": [
          {
            "cn": "凭祥市",
            "code": "532600"
          },
          {
            "cn": "大新县",
            "code": "532300"
          },
          {
            "cn": "天等县",
            "code": "532800"
          },
          {
            "cn": "宁明县",
            "code": "532500"
          },
          {
            "cn": "扶绥县",
            "code": "532100"
          },
          {
            "cn": "江洲区",
            "code": "532200"
          },
          {
            "cn": "龙州县",
            "code": "532400"
          }
        ]
      },
      {
        "cn": "来宾市",
        "code": "546100",
        "area": [
          {
            "cn": "兴宾区",
            "code": "546100"
          },
          {
            "cn": "合山市",
            "code": "546500"
          },
          {
            "cn": "忻城县",
            "code": "546200"
          },
          {
            "cn": "武宣县",
            "code": "545900"
          },
          {
            "cn": "象州县",
            "code": "545800"
          },
          {
            "cn": "金秀瑶族自治县",
            "code": "545700"
          }
        ]
      },
      {
        "cn": "柳州市",
        "code": "545000",
        "area": [
          {
            "cn": "三江侗族自治县",
            "code": "545500"
          },
          {
            "cn": "城中区",
            "code": "545000"
          },
          {
            "cn": "柳城县",
            "code": "545200"
          },
          {
            "cn": "柳江县",
            "code": "545100"
          },
          {
            "cn": "融安县",
            "code": "545400"
          },
          {
            "cn": "融水苗族自治县",
            "code": "545300"
          },
          {
            "cn": "鹿寨县",
            "code": "545600"
          }
        ]
      },
      {
        "cn": "桂林市",
        "code": "541000",
        "area": [
          {
            "cn": "七星区",
            "code": "541000"
          },
          {
            "cn": "临桂县",
            "code": "541100"
          },
          {
            "cn": "全州县",
            "code": "541500"
          },
          {
            "cn": "兴安县",
            "code": "541300"
          },
          {
            "cn": "平乐县",
            "code": "542400"
          },
          {
            "cn": "恭城瑶族自治县",
            "code": "542500"
          },
          {
            "cn": "永福县",
            "code": "541800"
          },
          {
            "cn": "灌阳县",
            "code": "541600"
          },
          {
            "cn": "灵川县",
            "code": "541200"
          },
          {
            "cn": "荔蒲县",
            "code": "546600"
          },
          {
            "cn": "资源县",
            "code": "541400"
          },
          {
            "cn": "阳朔县",
            "code": "541900"
          },
          {
            "cn": "龙胜各族自治县",
            "code": "541700"
          }
        ]
      },
      {
        "cn": "梧州市",
        "code": "543000",
        "area": [
          {
            "cn": "万秀区",
            "code": "543000"
          },
          {
            "cn": "岑溪市",
            "code": "543200"
          },
          {
            "cn": "苍梧县",
            "code": "543100"
          },
          {
            "cn": "蒙山县",
            "code": "546700"
          },
          {
            "cn": "藤县",
            "code": "543300"
          }
        ]
      },
      {
        "cn": "河池市",
        "code": "547000",
        "area": [
          {
            "cn": "东兰县",
            "code": "547400"
          },
          {
            "cn": "凤山县",
            "code": "547600"
          },
          {
            "cn": "南丹县",
            "code": "547200"
          },
          {
            "cn": "大化瑶族自治县",
            "code": "530800"
          },
          {
            "cn": "天峨县",
            "code": "547300"
          },
          {
            "cn": "宜州市",
            "code": "546300"
          },
          {
            "cn": "巴马瑶族自治县",
            "code": "547500"
          },
          {
            "cn": "环江毛南族自治县",
            "code": "547100"
          },
          {
            "cn": "罗城仫佬族自治县",
            "code": "546400"
          },
          {
            "cn": "都安瑶族自治县",
            "code": "530700"
          },
          {
            "cn": "金城江区",
            "code": "547000"
          }
        ]
      },
      {
        "cn": "玉林市",
        "code": "537000",
        "area": [
          {
            "cn": "兴业县",
            "code": "537800"
          },
          {
            "cn": "北流市",
            "code": "537400"
          },
          {
            "cn": "博白县",
            "code": "537600"
          },
          {
            "cn": "容县",
            "code": "537500"
          },
          {
            "cn": "玉州区",
            "code": "537000"
          },
          {
            "cn": "陆川县",
            "code": "537700"
          },
          {
            "cn": "平南县",
            "code": "537300"
          },
          {
            "cn": "桂平市",
            "code": "537200"
          },
          {
            "cn": "港北区",
            "code": "537100"
          }
        ]
      },
      {
        "cn": "百色市",
        "code": "533000",
        "area": [
          {
            "cn": "乐业县",
            "code": "533200"
          },
          {
            "cn": "凌云县",
            "code": "533100"
          },
          {
            "cn": "右江区",
            "code": "533000"
          },
          {
            "cn": "平果县",
            "code": "531400"
          },
          {
            "cn": "德保县",
            "code": "533700"
          },
          {
            "cn": "田东县",
            "code": "531500"
          },
          {
            "cn": "田林县",
            "code": "533300"
          },
          {
            "cn": "田阳县",
            "code": "533600"
          },
          {
            "cn": "西林县",
            "code": "533500"
          },
          {
            "cn": "那坡县",
            "code": "533900"
          },
          {
            "cn": "隆林各族自治县",
            "code": "533400"
          },
          {
            "cn": "靖西县",
            "code": "533800"
          }
        ]
      },
      {
        "cn": "贵港市",
        "code": "537000",
        "area": [
          {
            "cn": "兴业县",
            "code": "537800"
          },
          {
            "cn": "北流市",
            "code": "537400"
          },
          {
            "cn": "博白县",
            "code": "537600"
          },
          {
            "cn": "容县",
            "code": "537500"
          },
          {
            "cn": "玉州区",
            "code": "537000"
          },
          {
            "cn": "陆川县",
            "code": "537700"
          },
          {
            "cn": "平南县",
            "code": "537300"
          },
          {
            "cn": "桂平市",
            "code": "537200"
          },
          {
            "cn": "港北区",
            "code": "537100"
          }
        ]
      },
      {
        "cn": "贺州市",
        "code": "542800",
        "area": [
          {
            "cn": "八步区",
            "code": "542800"
          },
          {
            "cn": "富川瑶族自治县",
            "code": "542700"
          },
          {
            "cn": "昭平县",
            "code": "546800"
          },
          {
            "cn": "钟山县",
            "code": "542600"
          }
        ]
      },
      {
        "cn": "钦州市",
        "code": "535000",
        "area": [
          {
            "cn": "浦北县",
            "code": "535300"
          },
          {
            "cn": "灵山县",
            "code": "535400"
          },
          {
            "cn": "钦北区",
            "code": "535000"
          }
        ]
      },
      {
        "cn": "防城港市",
        "code": "538000",
        "area": [
          {
            "cn": "上思县",
            "code": "535500"
          },
          {
            "cn": "东兴市",
            "code": "538100"
          },
          {
            "cn": "港口区",
            "code": "538000"
          }
        ]
      }
    ]
  },
  {
    "cn": "海南省",
    "code": "hainan",
    "citys": [
      {
        "cn": "海口市",
        "code": "570100",
        "area": [
          {
            "cn": "琼山区",
            "code": "571100"
          },
          {
            "cn": "秀英区",
            "code": "570100"
          }
        ]
      }
    ]
  },
  {
    "cn": "河南省",
    "code": "henan",
    "citys": [
      {
        "cn": "三门峡市",
        "code": "472000",
        "area": [
          {
            "cn": "义马市",
            "code": "472300"
          },
          {
            "cn": "卢氏县",
            "code": "472200"
          },
          {
            "cn": "渑池县",
            "code": "472400"
          },
          {
            "cn": "湖滨区",
            "code": "453000"
          },
          {
            "cn": "灵宝市",
            "code": "472500"
          },
          {
            "cn": "陕县",
            "code": "472100"
          }
        ]
      },
      {
        "cn": "信阳市",
        "code": "464000",
        "area": [
          {
            "cn": "光山县",
            "code": "465450"
          },
          {
            "cn": "商城县",
            "code": "465350"
          },
          {
            "cn": "固始县",
            "code": "465200"
          },
          {
            "cn": "平桥区",
            "code": "467000"
          },
          {
            "cn": "息县",
            "code": "464300"
          },
          {
            "cn": "新县",
            "code": "465500"
          },
          {
            "cn": "浉河区",
            "code": "464000"
          },
          {
            "cn": "淮滨县",
            "code": "464400"
          },
          {
            "cn": "潢川县",
            "code": "465150"
          },
          {
            "cn": "罗山县",
            "code": "464200"
          }
        ]
      },
      {
        "cn": "南阳市",
        "code": "473000",
        "area": [
          {
            "cn": "内乡县",
            "code": "474350"
          },
          {
            "cn": "南召县",
            "code": "473000"
          },
          {
            "cn": "唐河县",
            "code": "473400"
          },
          {
            "cn": "新野县",
            "code": "473500"
          },
          {
            "cn": "方城县",
            "code": "473200"
          },
          {
            "cn": "桐柏县",
            "code": "474750"
          },
          {
            "cn": "淅川县",
            "code": "474450"
          },
          {
            "cn": "社旗县",
            "code": "473300"
          },
          {
            "cn": "西峡县",
            "code": "474550"
          },
          {
            "cn": "邓州市",
            "code": "474150"
          },
          {
            "cn": "镇平县",
            "code": "474250"
          }
        ]
      },
      {
        "cn": "周口市",
        "code": "466000",
        "area": [
          {
            "cn": "商水县",
            "code": "476000"
          },
          {
            "cn": "太康县",
            "code": "475400"
          },
          {
            "cn": "川汇区",
            "code": "466000"
          },
          {
            "cn": "扶沟县",
            "code": "461300"
          },
          {
            "cn": "沈丘县",
            "code": "466300"
          },
          {
            "cn": "淮阳县",
            "code": "466700"
          },
          {
            "cn": "西华县",
            "code": "466600"
          },
          {
            "cn": "郸城县",
            "code": "477150"
          },
          {
            "cn": "项城市",
            "code": "466200"
          },
          {
            "cn": "鹿邑县",
            "code": "477200"
          }
        ]
      },
      {
        "cn": "商丘市",
        "code": "476000",
        "area": [
          {
            "cn": "夏邑县",
            "code": "476400"
          },
          {
            "cn": "宁陵县",
            "code": "476700"
          },
          {
            "cn": "柘城县",
            "code": "476200"
          },
          {
            "cn": "民权县",
            "code": "476800"
          },
          {
            "cn": "永城市",
            "code": "476600"
          },
          {
            "cn": "睢县",
            "code": "476900"
          },
          {
            "cn": "虞城县",
            "code": "476300"
          }
        ]
      },
      {
        "cn": "安阳市",
        "code": "455000",
        "area": [
          {
            "cn": "内黄县",
            "code": "456300"
          },
          {
            "cn": "北关区",
            "code": "455000"
          },
          {
            "cn": "安阳县",
            "code": "455100"
          },
          {
            "cn": "林州市",
            "code": "456500"
          },
          {
            "cn": "汤阴县",
            "code": "456150"
          },
          {
            "cn": "滑县",
            "code": "456400"
          }
        ]
      },
      {
        "cn": "平顶山市",
        "code": "467000",
        "area": [
          {
            "cn": "叶县",
            "code": "462300"
          },
          {
            "cn": "宝丰县",
            "code": "467400"
          },
          {
            "cn": "汝州市",
            "code": "467500"
          },
          {
            "cn": "舞钢市",
            "code": "462500"
          },
          {
            "cn": "郏县",
            "code": "467100"
          },
          {
            "cn": "鲁山县",
            "code": "467300"
          }
        ]
      },
      {
        "cn": "开封市",
        "code": "475000",
        "area": [
          {
            "cn": "兰考县",
            "code": "475300"
          },
          {
            "cn": "尉氏县",
            "code": "475500"
          },
          {
            "cn": "开封县",
            "code": "475000"
          },
          {
            "cn": "杞县",
            "code": "475200"
          }
        ]
      },
      {
        "cn": "新乡市",
        "code": "453000",
        "area": [
          {
            "cn": "凤泉区",
            "code": "453003"
          },
          {
            "cn": "卫滨区",
            "code": "410703"
          },
          {
            "cn": "卫辉市",
            "code": "453100"
          },
          {
            "cn": "原阳县",
            "code": "453500"
          },
          {
            "cn": "封丘县",
            "code": "453300"
          },
          {
            "cn": "延津县",
            "code": "453200"
          },
          {
            "cn": "红旗区",
            "code": "458000"
          },
          {
            "cn": "获嘉县",
            "code": "450000"
          },
          {
            "cn": "辉县市",
            "code": "453600"
          },
          {
            "cn": "长垣县",
            "code": "453400"
          }
        ]
      },
      {
        "cn": "洛阳市",
        "code": "471000",
        "area": [
          {
            "cn": "伊川县",
            "code": "471300"
          },
          {
            "cn": "偃师市",
            "code": "471900"
          },
          {
            "cn": "吉利区",
            "code": "471000"
          },
          {
            "cn": "孟津县",
            "code": "471100"
          },
          {
            "cn": "宜阳县",
            "code": "471600"
          },
          {
            "cn": "嵩县",
            "code": "471400"
          },
          {
            "cn": "新安县",
            "code": "471800"
          },
          {
            "cn": "栾川县",
            "code": "471500"
          },
          {
            "cn": "汝阳县",
            "code": "471200"
          },
          {
            "cn": "洛宁县",
            "code": "471700"
          }
        ]
      },
      {
        "cn": "漯河市",
        "code": "462000",
        "area": [
          {
            "cn": "临颍县",
            "code": "462600"
          },
          {
            "cn": "召陵区",
            "code": "462000"
          },
          {
            "cn": "舞阳县",
            "code": "462400"
          }
        ]
      },
      {
        "cn": "濮阳市",
        "code": "457000",
        "area": [
          {
            "cn": "华龙区",
            "code": "472000"
          },
          {
            "cn": "南乐县",
            "code": "457400"
          },
          {
            "cn": "台前县",
            "code": "457600"
          },
          {
            "cn": "清丰县",
            "code": "457300"
          },
          {
            "cn": "濮阳县",
            "code": "457000"
          },
          {
            "cn": "范县",
            "code": "457500"
          }
        ]
      },
      {
        "cn": "焦作市",
        "code": "454150",
        "area": [
          {
            "cn": "中站区",
            "code": "454150"
          },
          {
            "cn": "博爱县",
            "code": "454450"
          },
          {
            "cn": "孟州市",
            "code": "454750"
          },
          {
            "cn": "武陟县",
            "code": "454950"
          },
          {
            "cn": "沁阳市",
            "code": "454550"
          },
          {
            "cn": "温县",
            "code": "454850"
          }
        ]
      },
      {
        "cn": "许昌市",
        "code": "461000",
        "area": [
          {
            "cn": "禹州市",
            "code": "452570"
          },
          {
            "cn": "襄城县",
            "code": "452670"
          },
          {
            "cn": "许昌县",
            "code": "461000"
          },
          {
            "cn": "鄢陵县",
            "code": "461200"
          },
          {
            "cn": "长葛市",
            "code": "461500"
          }
        ]
      },
      {
        "cn": "郑州市",
        "code": "450000",
        "area": [
          {
            "cn": "上街区",
            "code": "450041"
          },
          {
            "cn": "中牟县",
            "code": "451450"
          },
          {
            "cn": "巩义市",
            "code": "451200"
          },
          {
            "cn": "新密市",
            "code": "452370"
          },
          {
            "cn": "新郑市",
            "code": "451100"
          },
          {
            "cn": "登封市",
            "code": "452470"
          },
          {
            "cn": "荥阳市",
            "code": "450100"
          }
        ]
      },
      {
        "cn": "驻马店市",
        "code": "463000",
        "area": [
          {
            "cn": "上蔡县",
            "code": "463800"
          },
          {
            "cn": "平舆县",
            "code": "463400"
          },
          {
            "cn": "新蔡县",
            "code": "463500"
          },
          {
            "cn": "正阳县",
            "code": "463600"
          },
          {
            "cn": "汝南县",
            "code": "463300"
          },
          {
            "cn": "泌阳县",
            "code": "463700"
          },
          {
            "cn": "确山县",
            "code": "463200"
          },
          {
            "cn": "西平县",
            "code": "463900"
          },
          {
            "cn": "遂平县",
            "code": "463100"
          },
          {
            "cn": "驿城区",
            "code": "463000"
          }
        ]
      },
      {
        "cn": "鹤壁市",
        "code": "458000",
        "area": [
          {
            "cn": "浚县",
            "code": "456250"
          },
          {
            "cn": "淇县",
            "code": "456750"
          }
        ]
      }
    ]
  },
  {
    "cn": "湖北省",
    "code": "hubei",
    "citys": [
      {
        "cn": "十堰市",
        "code": "442000",
        "area": [
          {
            "cn": "丹江口市",
            "code": "442700"
          },
          {
            "cn": "张湾区",
            "code": "442000"
          },
          {
            "cn": "房县",
            "code": "442100"
          },
          {
            "cn": "竹山县",
            "code": "442200"
          },
          {
            "cn": "竹溪县",
            "code": "442300"
          },
          {
            "cn": "郧县",
            "code": "442500"
          },
          {
            "cn": "郧西县",
            "code": "442600"
          }
        ]
      },
      {
        "cn": "咸宁市",
        "code": "437000",
        "area": [
          {
            "cn": "咸安区",
            "code": "437000"
          },
          {
            "cn": "嘉鱼县",
            "code": "437200"
          },
          {
            "cn": "崇阳县",
            "code": "437500"
          },
          {
            "cn": "赤壁市",
            "code": "437300"
          },
          {
            "cn": "通城县",
            "code": "437400"
          },
          {
            "cn": "通山县",
            "code": "437600"
          }
        ]
      },
      {
        "cn": "孝感市",
        "code": "432000",
        "area": [
          {
            "cn": "云梦县",
            "code": "432500"
          },
          {
            "cn": "大悟县",
            "code": "432800"
          },
          {
            "cn": "孝南区",
            "code": "432100"
          },
          {
            "cn": "孝昌县",
            "code": "432900"
          },
          {
            "cn": "安陆市",
            "code": "432600"
          },
          {
            "cn": "应城市",
            "code": "432400"
          },
          {
            "cn": "汉川市",
            "code": "432300"
          }
        ]
      },
      {
        "cn": "宜昌市",
        "code": "443000",
        "area": [
          {
            "cn": "五峰土家族自治县",
            "code": "443400"
          },
          {
            "cn": "伍家岗区",
            "code": "443000"
          },
          {
            "cn": "兴山县",
            "code": "443700"
          },
          {
            "cn": "夷陵区",
            "code": "443100"
          },
          {
            "cn": "当阳市",
            "code": "444100"
          },
          {
            "cn": "枝江市",
            "code": "443200"
          },
          {
            "cn": "秭归县",
            "code": "443600"
          },
          {
            "cn": "远安县",
            "code": "444200"
          },
          {
            "cn": "长阳土家族自治县",
            "code": "443500"
          }
        ]
      },
      {
        "cn": "恩施土家族苗族自治州",
        "code": "445000",
        "area": [
          {
            "cn": "利川市",
            "code": "445400"
          },
          {
            "cn": "咸丰县",
            "code": "445600"
          },
          {
            "cn": "宣恩县",
            "code": "445500"
          },
          {
            "cn": "巴东县",
            "code": "444300"
          },
          {
            "cn": "建始县",
            "code": "445300"
          },
          {
            "cn": "恩施市",
            "code": "445000"
          },
          {
            "cn": "来凤县",
            "code": "445700"
          },
          {
            "cn": "鹤峰县",
            "code": "445800"
          }
        ]
      },
      {
        "cn": "武汉市",
        "code": "430000",
        "area": [
          {
            "cn": "东西湖区",
            "code": "430040"
          },
          {
            "cn": "新洲区",
            "code": "431400"
          },
          {
            "cn": "武昌区",
            "code": "430000"
          },
          {
            "cn": "汉南区",
            "code": "430090"
          },
          {
            "cn": "汉阳区",
            "code": "430050"
          },
          {
            "cn": "江夏区",
            "code": "430200"
          },
          {
            "cn": "江岸区",
            "code": "430014"
          },
          {
            "cn": "洪山区",
            "code": "430070"
          },
          {
            "cn": "蔡甸区",
            "code": "430100"
          },
          {
            "cn": "青山区",
            "code": "430080"
          },
          {
            "cn": "黄陂区",
            "code": "438000"
          }
        ]
      },
      {
        "cn": "荆州市",
        "code": "434000",
        "area": [
          {
            "cn": "公安县",
            "code": "434300"
          },
          {
            "cn": "松滋市",
            "code": "434200"
          },
          {
            "cn": "江陵县",
            "code": "434100"
          },
          {
            "cn": "沙市区",
            "code": "434000"
          },
          {
            "cn": "洪湖市",
            "code": "433200"
          },
          {
            "cn": "监利县",
            "code": "433300"
          },
          {
            "cn": "石首市",
            "code": "434400"
          },
          {
            "cn": "荆州区",
            "code": "434020"
          }
        ]
      },
      {
        "cn": "荆门市",
        "code": "448000",
        "area": [
          {
            "cn": "东宝区",
            "code": "448000"
          },
          {
            "cn": "京山县",
            "code": "431800"
          },
          {
            "cn": "沙洋县",
            "code": "448200"
          },
          {
            "cn": "钟祥市",
            "code": "431900"
          }
        ]
      },
      {
        "cn": "襄樊市",
        "code": "441000",
        "area": [
          {
            "cn": "保康县",
            "code": "441600"
          },
          {
            "cn": "南漳县",
            "code": "441500"
          },
          {
            "cn": "宜城市",
            "code": "441400"
          },
          {
            "cn": "枣阳市",
            "code": "441200"
          },
          {
            "cn": "樊城区",
            "code": "441000"
          },
          {
            "cn": "老河口市",
            "code": "441800"
          },
          {
            "cn": "襄阳区",
            "code": "441100"
          },
          {
            "cn": "谷城县",
            "code": "441700"
          }
        ]
      },
      {
        "cn": "鄂州市",
        "code": "436000",
        "area": [
          {
            "cn": "华容区",
            "code": "432200"
          },
          {
            "cn": "梁子湖区",
            "code": "436000"
          }
        ]
      },
      {
        "cn": "随州市",
        "code": "441300",
        "area": [
          {
            "cn": "广水市",
            "code": "432700"
          },
          {
            "cn": "曾都区",
            "code": "441300"
          }
        ]
      },
      {
        "cn": "黄冈市",
        "code": "438000",
        "area": [
          {
            "cn": "武穴市",
            "code": "435400"
          },
          {
            "cn": "浠水县",
            "code": "438200"
          },
          {
            "cn": "红安县",
            "code": "438400"
          },
          {
            "cn": "罗田县",
            "code": "438600"
          },
          {
            "cn": "英山县",
            "code": "438700"
          },
          {
            "cn": "蕲春县",
            "code": "435300"
          },
          {
            "cn": "麻城市",
            "code": "438300"
          },
          {
            "cn": "黄梅县",
            "code": "435500"
          }
        ]
      },
      {
        "cn": "黄石市",
        "code": "435000",
        "area": [
          {
            "cn": "下陆区",
            "code": "435000"
          },
          {
            "cn": "大冶市",
            "code": "435100"
          },
          {
            "cn": "阳新县",
            "code": "435200"
          }
        ]
      }
    ]
  },
  {
    "cn": "湖南省",
    "code": "hunan",
    "citys": [
      {
        "cn": "娄底市",
        "code": "417000",
        "area": [
          {
            "cn": "冷水江市",
            "code": "417500"
          },
          {
            "cn": "双峰县",
            "code": "417700"
          },
          {
            "cn": "娄星区",
            "code": "417000"
          },
          {
            "cn": "新化县",
            "code": "417600"
          },
          {
            "cn": "涟源市",
            "code": "417100"
          }
        ]
      },
      {
        "cn": "岳阳市",
        "code": "414000",
        "area": [
          {
            "cn": "临湘市",
            "code": "414300"
          },
          {
            "cn": "云溪区",
            "code": "414000"
          },
          {
            "cn": "华容县",
            "code": "414200"
          },
          {
            "cn": "岳阳县",
            "code": "414100"
          },
          {
            "cn": "平江县",
            "code": "410400"
          },
          {
            "cn": "汨罗市",
            "code": "414400"
          },
          {
            "cn": "湘阴县",
            "code": "410500"
          }
        ]
      },
      {
        "cn": "常德市",
        "code": "415000",
        "area": [
          {
            "cn": "临澧县",
            "code": "415200"
          },
          {
            "cn": "安乡县",
            "code": "415600"
          },
          {
            "cn": "桃源县",
            "code": "415700"
          },
          {
            "cn": "武陵区",
            "code": "415000"
          },
          {
            "cn": "汉寿县",
            "code": "415900"
          },
          {
            "cn": "津市市",
            "code": "415400"
          },
          {
            "cn": "澧县",
            "code": "415500"
          },
          {
            "cn": "石门县",
            "code": "415300"
          },
          {
            "cn": "鼎城区",
            "code": "415100"
          }
        ]
      },
      {
        "cn": "张家界市",
        "code": "427000",
        "area": [
          {
            "cn": "慈利县",
            "code": "427200"
          },
          {
            "cn": "桑植县",
            "code": "427100"
          },
          {
            "cn": "武陵源区",
            "code": "427400"
          },
          {
            "cn": "永定区",
            "code": "427000"
          }
        ]
      },
      {
        "cn": "怀化市",
        "code": "418000",
        "area": [
          {
            "cn": "中方县",
            "code": "418000"
          },
          {
            "cn": "会同县",
            "code": "418300"
          },
          {
            "cn": "新晃侗族自治县",
            "code": "419200"
          },
          {
            "cn": "沅陵县",
            "code": "419600"
          },
          {
            "cn": "洪江市",
            "code": "418200"
          },
          {
            "cn": "溆浦县",
            "code": "419300"
          },
          {
            "cn": "芷江侗族自治县",
            "code": "419100"
          },
          {
            "cn": "辰溪县",
            "code": "419500"
          },
          {
            "cn": "通道侗族自治县",
            "code": "418500"
          },
          {
            "cn": "靖州苗族侗族自治县",
            "code": "418400"
          },
          {
            "cn": "麻阳苗族自治县",
            "code": "419400"
          }
        ]
      },
      {
        "cn": "株洲市",
        "code": "412000",
        "area": [
          {
            "cn": "天元区",
            "code": "412000"
          },
          {
            "cn": "攸县",
            "code": "412300"
          },
          {
            "cn": "炎陵县",
            "code": "412500"
          },
          {
            "cn": "茶陵县",
            "code": "412400"
          },
          {
            "cn": "醴陵市",
            "code": "412200"
          }
        ]
      },
      {
        "cn": "永州市",
        "code": "425000",
        "area": [
          {
            "cn": "东安县",
            "code": "425900"
          },
          {
            "cn": "冷水滩区",
            "code": "425000"
          },
          {
            "cn": "双牌县",
            "code": "425200"
          },
          {
            "cn": "宁远县",
            "code": "425600"
          },
          {
            "cn": "新田县",
            "code": "425700"
          },
          {
            "cn": "江华瑶族自治县",
            "code": "425500"
          },
          {
            "cn": "江永县",
            "code": "425400"
          },
          {
            "cn": "祁阳县",
            "code": "426100"
          },
          {
            "cn": "蓝山县",
            "code": "425800"
          },
          {
            "cn": "道县",
            "code": "425300"
          }
        ]
      },
      {
        "cn": "湘潭市",
        "code": "411100",
        "area": [
          {
            "cn": "岳塘区",
            "code": "411100"
          },
          {
            "cn": "湘乡市",
            "code": "411400"
          },
          {
            "cn": "湘潭县",
            "code": "411200"
          },
          {
            "cn": "韶山市",
            "code": "411300"
          }
        ]
      },
      {
        "cn": "湘西土家族苗族自治州",
        "code": "416000",
        "area": [
          {
            "cn": "保靖县",
            "code": "416500"
          },
          {
            "cn": "凤凰县",
            "code": "416200"
          },
          {
            "cn": "古丈县",
            "code": "416300"
          },
          {
            "cn": "吉首市",
            "code": "416000"
          },
          {
            "cn": "永顺县",
            "code": "416700"
          },
          {
            "cn": "泸溪县",
            "code": "416100"
          },
          {
            "cn": "花垣县",
            "code": "416400"
          },
          {
            "cn": "龙山县",
            "code": "416800"
          }
        ]
      },
      {
        "cn": "益阳市",
        "code": "413000",
        "area": [
          {
            "cn": "南县",
            "code": "413200"
          },
          {
            "cn": "安化县",
            "code": "413500"
          },
          {
            "cn": "桃江县",
            "code": "413400"
          },
          {
            "cn": "沅江市",
            "code": "413100"
          },
          {
            "cn": "资阳区",
            "code": "413000"
          }
        ]
      },
      {
        "cn": "衡阳市",
        "code": "421200",
        "area": [
          {
            "cn": "南岳区",
            "code": "421000"
          },
          {
            "cn": "常宁市",
            "code": "421500"
          },
          {
            "cn": "祁东县",
            "code": "421600"
          },
          {
            "cn": "耒阳市",
            "code": "421800"
          },
          {
            "cn": "衡东县",
            "code": "421400"
          },
          {
            "cn": "衡南县",
            "code": "421100"
          },
          {
            "cn": "衡山县",
            "code": "421300"
          },
          {
            "cn": "衡阳县",
            "code": "421200"
          }
        ]
      },
      {
        "cn": "邵阳市",
        "code": "422000",
        "area": [
          {
            "cn": "北塔区",
            "code": "422000"
          },
          {
            "cn": "城步苗族自治县",
            "code": "422500"
          },
          {
            "cn": "新宁县",
            "code": "422700"
          },
          {
            "cn": "新邵县",
            "code": "422900"
          },
          {
            "cn": "武冈市",
            "code": "422400"
          },
          {
            "cn": "洞口县",
            "code": "422300"
          },
          {
            "cn": "绥宁县",
            "code": "422600"
          },
          {
            "cn": "邵东县",
            "code": "422800"
          },
          {
            "cn": "邵阳县",
            "code": "422100"
          },
          {
            "cn": "隆回县",
            "code": "422200"
          }
        ]
      },
      {
        "cn": "郴州市",
        "code": "423000",
        "area": [
          {
            "cn": "临武县",
            "code": "424300"
          },
          {
            "cn": "北湖区",
            "code": "423000"
          },
          {
            "cn": "嘉禾县",
            "code": "424500"
          },
          {
            "cn": "安仁县",
            "code": "423600"
          },
          {
            "cn": "宜章县",
            "code": "424200"
          },
          {
            "cn": "桂东县",
            "code": "423500"
          },
          {
            "cn": "桂阳县",
            "code": "424400"
          },
          {
            "cn": "永兴县",
            "code": "423300"
          },
          {
            "cn": "汝城县",
            "code": "424100"
          },
          {
            "cn": "资兴市",
            "code": "423400"
          }
        ]
      },
      {
        "cn": "长沙市",
        "code": "410000",
        "area": [
          {
            "cn": "天心区",
            "code": "410000"
          },
          {
            "cn": "宁乡县",
            "code": "410600"
          },
          {
            "cn": "望城县",
            "code": "410200"
          },
          {
            "cn": "浏阳市",
            "code": "410300"
          },
          {
            "cn": "长沙县",
            "code": "410100"
          }
        ]
      }
    ]
  },
  {
    "cn": "黑龙江省",
    "code": "heilongjiang",
    "citys": [
      {
        "cn": "七台河市",
        "code": "154600",
        "area": [
          {
            "cn": "勃利县",
            "code": "154500"
          },
          {
            "cn": "新兴区",
            "code": "154100"
          },
          {
            "cn": "桃山区",
            "code": "154600"
          }
        ]
      },
      {
        "cn": "伊春市",
        "code": "153000",
        "area": [
          {
            "cn": "上甘岭区",
            "code": "153000"
          },
          {
            "cn": "嘉荫县",
            "code": "154000"
          },
          {
            "cn": "铁力市",
            "code": "152500"
          }
        ]
      },
      {
        "cn": "佳木斯市",
        "code": "154000",
        "area": [
          {
            "cn": "同江市",
            "code": "156400"
          },
          {
            "cn": "富锦市",
            "code": "156100"
          },
          {
            "cn": "抚远县",
            "code": "156500"
          },
          {
            "cn": "桦南县",
            "code": "158200"
          },
          {
            "cn": "桦川县",
            "code": "154400"
          },
          {
            "cn": "汤原县",
            "code": "154700"
          },
          {
            "cn": "郊区",
            "code": "161000"
          }
        ]
      },
      {
        "cn": "双鸭山市",
        "code": "155100",
        "area": [
          {
            "cn": "友谊县",
            "code": "155800"
          },
          {
            "cn": "四方台区",
            "code": "155100"
          },
          {
            "cn": "宝清县",
            "code": "155600"
          },
          {
            "cn": "尖山区",
            "code": "153200"
          },
          {
            "cn": "集贤县",
            "code": "155900"
          },
          {
            "cn": "饶河县",
            "code": "155700"
          }
        ]
      },
      {
        "cn": "哈尔滨市",
        "code": "150000",
        "area": [
          {
            "cn": "五常市",
            "code": "150200"
          },
          {
            "cn": "依兰县",
            "code": "154800"
          },
          {
            "cn": "南岗区",
            "code": "150000"
          },
          {
            "cn": "双城市",
            "code": "150100"
          },
          {
            "cn": "呼兰区",
            "code": "150500"
          },
          {
            "cn": "宾县",
            "code": "150400"
          },
          {
            "cn": "尚志市",
            "code": "150600"
          },
          {
            "cn": "巴彦县",
            "code": "151800"
          },
          {
            "cn": "延寿县",
            "code": "157000"
          },
          {
            "cn": "方正县",
            "code": "150800"
          },
          {
            "cn": "木兰县",
            "code": "151900"
          },
          {
            "cn": "通河县",
            "code": "150900"
          },
          {
            "cn": "阿城区",
            "code": "150300"
          }
        ]
      },
      {
        "cn": "大兴安岭地区",
        "code": "165000",
        "area": [
          {
            "cn": "加格达奇区",
            "code": "165000"
          },
          {
            "cn": "呼中区",
            "code": "158400"
          },
          {
            "cn": "呼玛县",
            "code": "165100"
          },
          {
            "cn": "塔河县",
            "code": "165200"
          },
          {
            "cn": "漠河县",
            "code": "165300"
          }
        ]
      },
      {
        "cn": "大庆市",
        "code": "163000",
        "area": [
          {
            "cn": "大同区",
            "code": "163000"
          },
          {
            "cn": "杜尔伯特蒙古族自治县",
            "code": "166200"
          },
          {
            "cn": "林甸县",
            "code": "166300"
          },
          {
            "cn": "肇州县",
            "code": "166400"
          },
          {
            "cn": "肇源县",
            "code": "166500"
          }
        ]
      },
      {
        "cn": "牡丹江市",
        "code": "157000",
        "area": [
          {
            "cn": "东宁县",
            "code": "157200"
          },
          {
            "cn": "宁安市",
            "code": "157400"
          },
          {
            "cn": "林口县",
            "code": "157600"
          },
          {
            "cn": "海林市",
            "code": "157100"
          },
          {
            "cn": "穆棱市",
            "code": "157500"
          },
          {
            "cn": "绥芬河市",
            "code": "157300"
          }
        ]
      },
      {
        "cn": "绥化市",
        "code": "152000",
        "area": [
          {
            "cn": "兰西县",
            "code": "151500"
          },
          {
            "cn": "北林区",
            "code": "152000"
          },
          {
            "cn": "安达市",
            "code": "151400"
          },
          {
            "cn": "庆安县",
            "code": "152400"
          },
          {
            "cn": "明水县",
            "code": "151700"
          },
          {
            "cn": "望奎县",
            "code": "152100"
          },
          {
            "cn": "海伦市",
            "code": "152300"
          },
          {
            "cn": "绥棱县",
            "code": "152200"
          },
          {
            "cn": "肇东市",
            "code": "151100"
          },
          {
            "cn": "青冈县",
            "code": "151600"
          }
        ]
      },
      {
        "cn": "鸡西市",
        "code": "158100",
        "area": [
          {
            "cn": "城子河区",
            "code": "158100"
          },
          {
            "cn": "密山市",
            "code": "158300"
          },
          {
            "cn": "虎林市",
            "code": "154300"
          }
        ]
      },
      {
        "cn": "鹤岗市",
        "code": "154100",
        "area": [
          {
            "cn": "兴山区",
            "code": "164400"
          },
          {
            "cn": "绥滨县",
            "code": "156200"
          },
          {
            "cn": "萝北县",
            "code": "154200"
          }
        ]
      },
      {
        "cn": "黑河市",
        "code": "164300",
        "area": [
          {
            "cn": "五大连池市",
            "code": "164100"
          },
          {
            "cn": "北安市",
            "code": "164000"
          },
          {
            "cn": "嫩江县",
            "code": "161400"
          },
          {
            "cn": "孙吴县",
            "code": "164200"
          },
          {
            "cn": "爱辉区",
            "code": "164300"
          },
          {
            "cn": "逊克县",
            "code": "150700"
          }
        ]
      },
      {
        "cn": "齐齐哈尔市",
        "code": "161000",
        "area": [
          {
            "cn": "依安县",
            "code": "161500"
          },
          {
            "cn": "克东县",
            "code": "164800"
          },
          {
            "cn": "克山县",
            "code": "161600"
          },
          {
            "cn": "富裕县",
            "code": "161200"
          },
          {
            "cn": "拜泉县",
            "code": "164700"
          },
          {
            "cn": "泰来县",
            "code": "162400"
          },
          {
            "cn": "甘南县",
            "code": "162100"
          },
          {
            "cn": "讷河市",
            "code": "161300"
          },
          {
            "cn": "龙江县",
            "code": "161100"
          }
        ]
      }
    ]
  },
  {
    "cn": "吉林省",
    "code": "jilin",
    "citys": [
      {
        "cn": "吉林市",
        "code": "132000",
        "area": [
          {
            "cn": "丰满区",
            "code": "132000"
          },
          {
            "cn": "桦甸市",
            "code": "132400"
          },
          {
            "cn": "永吉县",
            "code": "132100"
          },
          {
            "cn": "磐石市",
            "code": "132300"
          },
          {
            "cn": "舒兰市",
            "code": "132600"
          },
          {
            "cn": "蛟河市",
            "code": "132500"
          }
        ]
      },
      {
        "cn": "四平市",
        "code": "136000",
        "area": [
          {
            "cn": "伊通满族自治县",
            "code": "133000"
          },
          {
            "cn": "公主岭市",
            "code": "136100"
          },
          {
            "cn": "双辽市",
            "code": "136400"
          },
          {
            "cn": "梨树县",
            "code": "136500"
          },
          {
            "cn": "铁东区",
            "code": "136000"
          }
        ]
      },
      {
        "cn": "延边朝鲜族自治州",
        "code": "133000",
        "area": [
          {
            "cn": "和龙市",
            "code": "133500"
          },
          {
            "cn": "图们市",
            "code": "137200"
          },
          {
            "cn": "安图县",
            "code": "133600"
          },
          {
            "cn": "延吉市",
            "code": "136200"
          },
          {
            "cn": "敦化市",
            "code": "133700"
          },
          {
            "cn": "汪清县",
            "code": "133100"
          },
          {
            "cn": "珲春市",
            "code": "133300"
          },
          {
            "cn": "龙井市",
            "code": "133400"
          }
        ]
      },
      {
        "cn": "松原市",
        "code": "138000",
        "area": [
          {
            "cn": "乾安县",
            "code": "131400"
          },
          {
            "cn": "前郭尔罗斯蒙古族自治县",
            "code": "131100"
          },
          {
            "cn": "宁江区",
            "code": "138000"
          },
          {
            "cn": "扶余县",
            "code": "131200"
          },
          {
            "cn": "长岭县",
            "code": "131500"
          }
        ]
      },
      {
        "cn": "白城市",
        "code": "137000",
        "area": [
          {
            "cn": "大安市",
            "code": "131300"
          },
          {
            "cn": "洮北区",
            "code": "137000"
          },
          {
            "cn": "洮南市",
            "code": "137100"
          },
          {
            "cn": "通榆县",
            "code": "134100"
          },
          {
            "cn": "镇赉县",
            "code": "137300"
          }
        ]
      },
      {
        "cn": "白山市",
        "code": "134300",
        "area": [
          {
            "cn": "临江市",
            "code": "134600"
          },
          {
            "cn": "八道江区",
            "code": "134300"
          },
          {
            "cn": "抚松县",
            "code": "134500"
          },
          {
            "cn": "江源区",
            "code": "134700"
          },
          {
            "cn": "长白朝鲜族自治县",
            "code": "134400"
          },
          {
            "cn": "靖宇县",
            "code": "135200"
          }
        ]
      },
      {
        "cn": "辽源市",
        "code": "136200",
        "area": [
          {
            "cn": "东丰县",
            "code": "136300"
          },
          {
            "cn": "东辽县",
            "code": "136600"
          },
          {
            "cn": "西安区",
            "code": "133200"
          }
        ]
      },
      {
        "cn": "通化市",
        "code": "134000",
        "area": [
          {
            "cn": "东昌区",
            "code": "134000"
          },
          {
            "cn": "柳河县",
            "code": "135300"
          },
          {
            "cn": "梅河口市",
            "code": "135000"
          },
          {
            "cn": "辉南县",
            "code": "135100"
          },
          {
            "cn": "集安市",
            "code": "134200"
          }
        ]
      },
      {
        "cn": "长春市",
        "code": "130000",
        "area": [
          {
            "cn": "九台市",
            "code": "130500"
          },
          {
            "cn": "二道区",
            "code": "130000"
          },
          {
            "cn": "农安县",
            "code": "130200"
          },
          {
            "cn": "双阳区",
            "code": "130600"
          },
          {
            "cn": "德惠市",
            "code": "130300"
          },
          {
            "cn": "榆树市",
            "code": "130400"
          }
        ]
      }
    ]
  },
  {
    "cn": "辽宁省",
    "code": "liaoning",
    "citys": [
      {
        "cn": "丹东市",
        "code": "118000",
        "area": [
          {
            "cn": "东港市",
            "code": "118300"
          },
          {
            "cn": "元宝区",
            "code": "118000"
          },
          {
            "cn": "凤城市",
            "code": "118100"
          },
          {
            "cn": "宽甸满族自治县",
            "code": "118200"
          }
        ]
      },
      {
        "cn": "大连市",
        "code": "116000",
        "area": [
          {
            "cn": "中山区",
            "code": "116000"
          },
          {
            "cn": "庄河市",
            "code": "116400"
          },
          {
            "cn": "普兰店市",
            "code": "116200"
          },
          {
            "cn": "瓦房店市",
            "code": "116300"
          },
          {
            "cn": "长海县",
            "code": "116500"
          }
        ]
      },
      {
        "cn": "抚顺市",
        "code": "113000",
        "area": [
          {
            "cn": "东洲区",
            "code": "113000"
          },
          {
            "cn": "抚顺县",
            "code": "113100"
          },
          {
            "cn": "新宾满族自治县",
            "code": "113200"
          },
          {
            "cn": "新抚区",
            "code": "110300"
          },
          {
            "cn": "清原满族自治县",
            "code": "113300"
          }
        ]
      },
      {
        "cn": "朝阳市",
        "code": "122000",
        "area": [
          {
            "cn": "凌源市",
            "code": "122500"
          },
          {
            "cn": "北票市",
            "code": "121300"
          },
          {
            "cn": "双塔区",
            "code": "122000"
          },
          {
            "cn": "喀喇沁左翼蒙古族自治县",
            "code": "122300"
          },
          {
            "cn": "建平县",
            "code": "122400"
          }
        ]
      },
      {
        "cn": "本溪市",
        "code": "117000",
        "area": [
          {
            "cn": "南芬区",
            "code": "117000"
          },
          {
            "cn": "本溪满族自治县",
            "code": "117100"
          },
          {
            "cn": "桓仁满族自治县",
            "code": "117200"
          }
        ]
      },
      {
        "cn": "沈阳市",
        "code": "110000",
        "area": [
          {
            "cn": "东陵区",
            "code": "110000"
          },
          {
            "cn": "康平县",
            "code": "110500"
          },
          {
            "cn": "新民市",
            "code": "123000"
          },
          {
            "cn": "沈北新区",
            "code": "110100"
          },
          {
            "cn": "法库县",
            "code": "110400"
          },
          {
            "cn": "辽中县",
            "code": "110200"
          },
          {
            "cn": "铁西区",
            "code": "114000"
          }
        ]
      },
      {
        "cn": "盘锦市",
        "code": "124000",
        "area": [
          {
            "cn": "兴隆台区",
            "code": "124000"
          },
          {
            "cn": "大洼县",
            "code": "124200"
          },
          {
            "cn": "盘山县",
            "code": "124100"
          }
        ]
      },
      {
        "cn": "营口市",
        "code": "115000",
        "area": [
          {
            "cn": "大石桥市",
            "code": "115100"
          },
          {
            "cn": "盖州市",
            "code": "115200"
          },
          {
            "cn": "站前区",
            "code": "115000"
          },
          {
            "cn": "鲅鱼圈区",
            "code": "115007"
          }
        ]
      },
      {
        "cn": "葫芦岛市",
        "code": "125000",
        "area": [
          {
            "cn": "兴城市",
            "code": "125100"
          },
          {
            "cn": "南票区",
            "code": "125000"
          },
          {
            "cn": "建昌县",
            "code": "125300"
          },
          {
            "cn": "绥中县",
            "code": "125200"
          }
        ]
      },
      {
        "cn": "辽阳市",
        "code": "111000",
        "area": [
          {
            "cn": "太子河区",
            "code": "111000"
          },
          {
            "cn": "灯塔市",
            "code": "111300"
          },
          {
            "cn": "辽阳县",
            "code": "111200"
          }
        ]
      },
      {
        "cn": "铁岭市",
        "code": "112000",
        "area": [
          {
            "cn": "开原市",
            "code": "112300"
          },
          {
            "cn": "昌图县",
            "code": "112500"
          },
          {
            "cn": "清河区",
            "code": "112000"
          },
          {
            "cn": "西丰县",
            "code": "112400"
          },
          {
            "cn": "调兵山市",
            "code": "112700"
          },
          {
            "cn": "铁岭县",
            "code": "112600"
          }
        ]
      },
      {
        "cn": "锦州市",
        "code": "121000",
        "area": [
          {
            "cn": "义县",
            "code": "121100"
          },
          {
            "cn": "凌河区",
            "code": "121000"
          },
          {
            "cn": "凌海市",
            "code": "121200"
          },
          {
            "cn": "黑山县",
            "code": "121400"
          }
        ]
      },
      {
        "cn": "阜新市",
        "code": "123000",
        "area": [
          {
            "cn": "彰武县",
            "code": "123200"
          },
          {
            "cn": "阜新蒙古族自治县",
            "code": "123100"
          }
        ]
      },
      {
        "cn": "鞍山市",
        "code": "114000",
        "area": [
          {
            "cn": "台安县",
            "code": "114100"
          },
          {
            "cn": "岫岩满族自治县",
            "code": "114300"
          },
          {
            "cn": "海城市",
            "code": "114200"
          },
          {
            "cn": "铁西区",
            "code": "110020"
          }
        ]
      }
    ]
  },
  {
    "cn": "陕西省",
    "code": "shanxi",
    "citys": [
      {
        "cn": "临汾市",
        "code": "041000",
        "area": [
          {
            "cn": "乡宁县",
            "code": "042100"
          },
          {
            "cn": "侯马市",
            "code": "043000"
          },
          {
            "cn": "古县",
            "code": "042400"
          },
          {
            "cn": "吉县",
            "code": "042200"
          },
          {
            "cn": "大宁县",
            "code": "042300"
          },
          {
            "cn": "安泽县",
            "code": "042500"
          },
          {
            "cn": "尧都区",
            "code": "041000"
          },
          {
            "cn": "曲沃县",
            "code": "043400"
          },
          {
            "cn": "永和县",
            "code": "041400"
          },
          {
            "cn": "汾西县",
            "code": "031500"
          },
          {
            "cn": "洪洞县",
            "code": "041600"
          },
          {
            "cn": "浮山县",
            "code": "042600"
          },
          {
            "cn": "翼城县",
            "code": "043500"
          },
          {
            "cn": "蒲县",
            "code": "041200"
          },
          {
            "cn": "襄汾县",
            "code": "041500"
          },
          {
            "cn": "隰县",
            "code": "041300"
          },
          {
            "cn": "霍州市",
            "code": "031400"
          }
        ]
      },
      {
        "cn": "吕梁市",
        "code": "033000",
        "area": [
          {
            "cn": "中阳县",
            "code": "033400"
          },
          {
            "cn": "临县",
            "code": "033200"
          },
          {
            "cn": "交口县",
            "code": "032400"
          },
          {
            "cn": "交城县",
            "code": "030500"
          },
          {
            "cn": "兴县",
            "code": "035300"
          },
          {
            "cn": "孝义市",
            "code": "032300"
          },
          {
            "cn": "岚县",
            "code": "035200"
          },
          {
            "cn": "文水县",
            "code": "032100"
          },
          {
            "cn": "方山县",
            "code": "033100"
          },
          {
            "cn": "柳林县",
            "code": "033300"
          },
          {
            "cn": "汾阳市",
            "code": "032200"
          },
          {
            "cn": "石楼县",
            "code": "032500"
          },
          {
            "cn": "离石区",
            "code": "033000"
          }
        ]
      },
      {
        "cn": "大同市",
        "code": "037000",
        "area": [
          {
            "cn": "南郊区",
            "code": "037000"
          },
          {
            "cn": "城区",
            "code": "045000"
          },
          {
            "cn": "大同县",
            "code": "037300"
          },
          {
            "cn": "天镇县",
            "code": "038200"
          },
          {
            "cn": "左云县",
            "code": "037100"
          },
          {
            "cn": "广灵县",
            "code": "037500"
          },
          {
            "cn": "浑源县",
            "code": "037400"
          },
          {
            "cn": "灵丘县",
            "code": "034400"
          },
          {
            "cn": "阳高县",
            "code": "038100"
          }
        ]
      },
      {
        "cn": "太原市",
        "code": "030000",
        "area": [
          {
            "cn": "万柏林区",
            "code": "030000"
          },
          {
            "cn": "古交市",
            "code": "030200"
          },
          {
            "cn": "娄烦县",
            "code": "030300"
          },
          {
            "cn": "清徐县",
            "code": "030400"
          },
          {
            "cn": "阳曲县",
            "code": "030100"
          }
        ]
      },
      {
        "cn": "忻州市",
        "code": "034000",
        "area": [
          {
            "cn": "五台县",
            "code": "035500"
          },
          {
            "cn": "五寨县",
            "code": "036200"
          },
          {
            "cn": "代县",
            "code": "034200"
          },
          {
            "cn": "保德县",
            "code": "036600"
          },
          {
            "cn": "偏关县",
            "code": "036400"
          },
          {
            "cn": "原平市",
            "code": "034100"
          },
          {
            "cn": "宁武县",
            "code": "036000"
          },
          {
            "cn": "定襄县",
            "code": "035400"
          },
          {
            "cn": "岢岚县",
            "code": "036300"
          },
          {
            "cn": "忻府区",
            "code": "034000"
          },
          {
            "cn": "河曲县",
            "code": "036500"
          },
          {
            "cn": "神池县",
            "code": "036100"
          },
          {
            "cn": "繁峙县",
            "code": "034300"
          },
          {
            "cn": "静乐县",
            "code": "035100"
          }
        ]
      },
      {
        "cn": "晋中市",
        "code": "030600",
        "area": [
          {
            "cn": "介休市",
            "code": "032000"
          },
          {
            "cn": "和顺县",
            "code": "032700"
          },
          {
            "cn": "太谷县",
            "code": "030800"
          },
          {
            "cn": "寿阳县",
            "code": "045400"
          },
          {
            "cn": "左权县",
            "code": "032600"
          },
          {
            "cn": "平遥县",
            "code": "031100"
          },
          {
            "cn": "昔阳县",
            "code": "045300"
          },
          {
            "cn": "榆次区",
            "code": "030600"
          },
          {
            "cn": "榆社县",
            "code": "031800"
          },
          {
            "cn": "灵石县",
            "code": "031300"
          },
          {
            "cn": "祁县",
            "code": "030900"
          }
        ]
      },
      {
        "cn": "晋城市",
        "code": "048000",
        "area": [
          {
            "cn": "城区",
            "code": "046000"
          },
          {
            "cn": "沁水县",
            "code": "048200"
          },
          {
            "cn": "泽州县",
            "code": "048000"
          },
          {
            "cn": "阳城县",
            "code": "048100"
          },
          {
            "cn": "陵川县",
            "code": "048300"
          },
          {
            "cn": "高平市",
            "code": "046700"
          }
        ]
      },
      {
        "cn": "朔州市",
        "code": "036000",
        "area": [
          {
            "cn": "右玉县",
            "code": "037200"
          },
          {
            "cn": "山阴县",
            "code": "036900"
          },
          {
            "cn": "平鲁区",
            "code": "036800"
          },
          {
            "cn": "应县",
            "code": "037600"
          },
          {
            "cn": "怀仁县",
            "code": "038300"
          },
          {
            "cn": "朔城区",
            "code": "036002"
          }
        ]
      },
      {
        "cn": "运城市",
        "code": "044000",
        "area": [
          {
            "cn": "万荣县",
            "code": "044200"
          },
          {
            "cn": "临猗县",
            "code": "044100"
          },
          {
            "cn": "垣曲县",
            "code": "043700"
          },
          {
            "cn": "夏县",
            "code": "044400"
          },
          {
            "cn": "平陆县",
            "code": "044300"
          },
          {
            "cn": "新绛县",
            "code": "043100"
          },
          {
            "cn": "永济市",
            "code": "044500"
          },
          {
            "cn": "河津市",
            "code": "043300"
          },
          {
            "cn": "盐湖区",
            "code": "044000"
          },
          {
            "cn": "稷山县",
            "code": "043200"
          },
          {
            "cn": "绛县",
            "code": "043600"
          },
          {
            "cn": "芮城县",
            "code": "044600"
          },
          {
            "cn": "闻喜县",
            "code": "043800"
          }
        ]
      },
      {
        "cn": "长治市",
        "code": "046000",
        "area": [
          {
            "cn": "壶关县",
            "code": "047300"
          },
          {
            "cn": "屯留县",
            "code": "046100"
          },
          {
            "cn": "平顺县",
            "code": "047400"
          },
          {
            "cn": "武乡县",
            "code": "046300"
          },
          {
            "cn": "沁县",
            "code": "046400"
          },
          {
            "cn": "沁源县",
            "code": "046500"
          },
          {
            "cn": "潞城市",
            "code": "047500"
          },
          {
            "cn": "襄垣县",
            "code": "046200"
          },
          {
            "cn": "长子县",
            "code": "046600"
          },
          {
            "cn": "长治县",
            "code": "047100"
          },
          {
            "cn": "黎城县",
            "code": "047600"
          }
        ]
      },
      {
        "cn": "阳泉市",
        "code": "045000",
        "area": [
          {
            "cn": "平定县",
            "code": "045200"
          },
          {
            "cn": "盂县",
            "code": "045100"
          }
        ]
      },
      {
        "cn": "咸阳市",
        "code": "712000",
        "area": [
          {
            "cn": "三原县",
            "code": "713800"
          },
          {
            "cn": "乾县",
            "code": "713300"
          },
          {
            "cn": "兴平市",
            "code": "713100"
          },
          {
            "cn": "彬县",
            "code": "713500"
          },
          {
            "cn": "旬邑县",
            "code": "711300"
          },
          {
            "cn": "杨凌区",
            "code": "712100"
          },
          {
            "cn": "武功县",
            "code": "712200"
          },
          {
            "cn": "永寿县",
            "code": "719000"
          },
          {
            "cn": "泾阳县",
            "code": "713700"
          },
          {
            "cn": "淳化县",
            "code": "711200"
          },
          {
            "cn": "渭城区",
            "code": "712000"
          },
          {
            "cn": "礼泉县",
            "code": "713200"
          },
          {
            "cn": "长武县",
            "code": "713600"
          }
        ]
      },
      {
        "cn": "商洛市",
        "code": "726000",
        "area": [
          {
            "cn": "丹凤县",
            "code": "726200"
          },
          {
            "cn": "商南县",
            "code": "726300"
          },
          {
            "cn": "商州区",
            "code": "726000"
          },
          {
            "cn": "山阳县",
            "code": "726400"
          },
          {
            "cn": "柞水县",
            "code": "711400"
          },
          {
            "cn": "洛南县",
            "code": "726100"
          },
          {
            "cn": "镇安县",
            "code": "711500"
          }
        ]
      },
      {
        "cn": "安康市",
        "code": "725000",
        "area": [
          {
            "cn": "宁陕县",
            "code": "711600"
          },
          {
            "cn": "岚皋县",
            "code": "725400"
          },
          {
            "cn": "平利县",
            "code": "725500"
          },
          {
            "cn": "旬阳县",
            "code": "725700"
          },
          {
            "cn": "汉滨区",
            "code": "725000"
          },
          {
            "cn": "汉阴县",
            "code": "725100"
          },
          {
            "cn": "白河县",
            "code": "725800"
          },
          {
            "cn": "石泉县",
            "code": "725200"
          },
          {
            "cn": "紫阳县",
            "code": "725300"
          },
          {
            "cn": "镇坪县",
            "code": "725600"
          }
        ]
      },
      {
        "cn": "宝鸡市",
        "code": "721000",
        "area": [
          {
            "cn": "凤县",
            "code": "721700"
          },
          {
            "cn": "凤翔县",
            "code": "721400"
          },
          {
            "cn": "千阳县",
            "code": "721100"
          },
          {
            "cn": "太白县",
            "code": "721600"
          },
          {
            "cn": "岐山县",
            "code": "722400"
          },
          {
            "cn": "扶风县",
            "code": "722200"
          },
          {
            "cn": "渭滨区",
            "code": "721000"
          },
          {
            "cn": "眉县",
            "code": "722300"
          },
          {
            "cn": "陇县",
            "code": "721200"
          },
          {
            "cn": "陈仓区",
            "code": "721300"
          },
          {
            "cn": "麟游县",
            "code": "721500"
          }
        ]
      },
      {
        "cn": "延安市",
        "code": "716000",
        "area": [
          {
            "cn": "子长县",
            "code": "717300"
          },
          {
            "cn": "安塞县",
            "code": "717400"
          },
          {
            "cn": "宜川县",
            "code": "716200"
          },
          {
            "cn": "宝塔区",
            "code": "716000"
          },
          {
            "cn": "富县",
            "code": "727500"
          },
          {
            "cn": "延川县",
            "code": "717200"
          },
          {
            "cn": "延长县",
            "code": "717100"
          },
          {
            "cn": "志丹县",
            "code": "717500"
          },
          {
            "cn": "洛川县",
            "code": "727400"
          },
          {
            "cn": "甘泉县",
            "code": "716100"
          },
          {
            "cn": "黄陵县",
            "code": "727300"
          },
          {
            "cn": "黄龙县",
            "code": "715700"
          }
        ]
      },
      {
        "cn": "榆林市",
        "code": "719000",
        "area": [
          {
            "cn": "佳县",
            "code": "719200"
          },
          {
            "cn": "吴堡县",
            "code": "718200"
          },
          {
            "cn": "子洲县",
            "code": "718400"
          },
          {
            "cn": "定边县",
            "code": "718600"
          },
          {
            "cn": "府谷县",
            "code": "719400"
          },
          {
            "cn": "清涧县",
            "code": "718300"
          },
          {
            "cn": "神木县",
            "code": "719300"
          },
          {
            "cn": "米脂县",
            "code": "718100"
          },
          {
            "cn": "绥德县",
            "code": "718000"
          },
          {
            "cn": "靖边县",
            "code": "718500"
          }
        ]
      },
      {
        "cn": "汉中市",
        "code": "723000",
        "area": [
          {
            "cn": "佛坪县",
            "code": "723400"
          },
          {
            "cn": "勉县",
            "code": "724200"
          },
          {
            "cn": "南郑县",
            "code": "723100"
          },
          {
            "cn": "城固县",
            "code": "723200"
          },
          {
            "cn": "宁强县",
            "code": "724400"
          },
          {
            "cn": "汉台区",
            "code": "723000"
          },
          {
            "cn": "洋县",
            "code": "723300"
          },
          {
            "cn": "留坝县",
            "code": "724100"
          },
          {
            "cn": "略阳县",
            "code": "724300"
          },
          {
            "cn": "西乡县",
            "code": "723500"
          },
          {
            "cn": "镇巴县",
            "code": "723600"
          }
        ]
      },
      {
        "cn": "渭南市",
        "code": "714000",
        "area": [
          {
            "cn": "临渭区",
            "code": "714000"
          },
          {
            "cn": "华县",
            "code": "714100"
          },
          {
            "cn": "华阴市",
            "code": "714200"
          },
          {
            "cn": "合阳县",
            "code": "715300"
          },
          {
            "cn": "大荔县",
            "code": "715100"
          },
          {
            "cn": "富平县",
            "code": "711700"
          },
          {
            "cn": "潼关县",
            "code": "727000"
          },
          {
            "cn": "澄城县",
            "code": "715200"
          },
          {
            "cn": "白水县",
            "code": "715600"
          },
          {
            "cn": "蒲城县",
            "code": "715500"
          },
          {
            "cn": "韩城市",
            "code": "715400"
          }
        ]
      },
      {
        "cn": "西安市",
        "code": "710000",
        "area": [
          {
            "cn": "临潼区",
            "code": "710600"
          },
          {
            "cn": "周至县",
            "code": "710400"
          },
          {
            "cn": "户县",
            "code": "710300"
          },
          {
            "cn": "新城区",
            "code": "710000"
          },
          {
            "cn": "蓝田县",
            "code": "710500"
          },
          {
            "cn": "长安区",
            "code": "710100"
          },
          {
            "cn": "高陵县",
            "code": "710200"
          }
        ]
      },
      {
        "cn": "铜川市",
        "code": "727000",
        "area": [
          {
            "cn": "印台区",
            "code": "713400"
          },
          {
            "cn": "宜君县",
            "code": "727200"
          },
          {
            "cn": "王益区",
            "code": "714300"
          },
          {
            "cn": "耀州区",
            "code": "727100"
          }
        ]
      }
    ]
  },
  {
    "cn": "甘肃省",
    "code": "gansu",
    "citys": [
      {
        "cn": "临夏回族自治州",
        "code": "731100",
        "area": [
          {
            "cn": "东乡族自治县",
            "code": "731400"
          },
          {
            "cn": "临夏县",
            "code": "731800"
          },
          {
            "cn": "临夏市",
            "code": "731100"
          },
          {
            "cn": "和政县",
            "code": "731200"
          },
          {
            "cn": "广河县",
            "code": "731300"
          },
          {
            "cn": "康乐县",
            "code": "731500"
          },
          {
            "cn": "永靖县",
            "code": "731600"
          },
          {
            "cn": "积石山保安族东乡族撒拉族自治县",
            "code": "731700"
          }
        ]
      },
      {
        "cn": "兰州市",
        "code": "730000",
        "area": [
          {
            "cn": "七里河区",
            "code": "730050"
          },
          {
            "cn": "城关区",
            "code": "730030"
          },
          {
            "cn": "安宁区",
            "code": "730070"
          },
          {
            "cn": "榆中县",
            "code": "730100"
          },
          {
            "cn": "永登县",
            "code": "730300"
          },
          {
            "cn": "皋兰县",
            "code": "730200"
          },
          {
            "cn": "红古区",
            "code": "730080"
          },
          {
            "cn": "西固区",
            "code": "730060"
          }
        ]
      },
      {
        "cn": "天水市",
        "code": "741000",
        "area": [
          {
            "cn": "张家川回族自治县",
            "code": "741500"
          },
          {
            "cn": "武山县",
            "code": "741300"
          },
          {
            "cn": "清水县",
            "code": "741400"
          },
          {
            "cn": "甘谷县",
            "code": "741200"
          },
          {
            "cn": "秦安县",
            "code": "741600"
          },
          {
            "cn": "秦州区",
            "code": "741000"
          }
        ]
      },
      {
        "cn": "定西市",
        "code": "743000",
        "area": [
          {
            "cn": "临洮县",
            "code": "730500"
          },
          {
            "cn": "安定区",
            "code": "744300"
          },
          {
            "cn": "渭源县",
            "code": "748200"
          },
          {
            "cn": "漳县",
            "code": "748300"
          },
          {
            "cn": "通渭县",
            "code": "743300"
          },
          {
            "cn": "陇西县",
            "code": "748100"
          }
        ]
      },
      {
        "cn": "平凉市",
        "code": "744000",
        "area": [
          {
            "cn": "华亭县",
            "code": "744100"
          },
          {
            "cn": "崆峒区",
            "code": "744000"
          },
          {
            "cn": "崇信县",
            "code": "744200"
          },
          {
            "cn": "庄浪县",
            "code": "744600"
          },
          {
            "cn": "灵台县",
            "code": "744400"
          },
          {
            "cn": "静宁县",
            "code": "743400"
          }
        ]
      },
      {
        "cn": "庆阳市",
        "code": "745000",
        "area": [
          {
            "cn": "华池县",
            "code": "745600"
          },
          {
            "cn": "合水县",
            "code": "745400"
          },
          {
            "cn": "宁县",
            "code": "745200"
          },
          {
            "cn": "庆城县",
            "code": "745100"
          },
          {
            "cn": "正宁县",
            "code": "745300"
          },
          {
            "cn": "环县",
            "code": "745700"
          },
          {
            "cn": "西峰区",
            "code": "745000"
          },
          {
            "cn": "镇原县",
            "code": "744500"
          }
        ]
      },
      {
        "cn": "张掖市",
        "code": "734000",
        "area": [
          {
            "cn": "临泽县",
            "code": "734200"
          },
          {
            "cn": "山丹县",
            "code": "734100"
          },
          {
            "cn": "民乐县",
            "code": "734500"
          },
          {
            "cn": "甘州区",
            "code": "734000"
          },
          {
            "cn": "肃南裕固族自治县",
            "code": "734400"
          },
          {
            "cn": "高台县",
            "code": "734300"
          }
        ]
      },
      {
        "cn": "武威市",
        "code": "733000",
        "area": [
          {
            "cn": "凉州区",
            "code": "733000"
          },
          {
            "cn": "古浪县",
            "code": "733100"
          },
          {
            "cn": "天祝藏族自治县",
            "code": "733200"
          },
          {
            "cn": "民勤县",
            "code": "733300"
          }
        ]
      },
      {
        "cn": "甘南藏族自治州",
        "code": "747000",
        "area": [
          {
            "cn": "临潭县",
            "code": "747500"
          },
          {
            "cn": "卓尼县",
            "code": "747600"
          },
          {
            "cn": "合作市",
            "code": "747000"
          },
          {
            "cn": "夏河县",
            "code": "747100"
          },
          {
            "cn": "玛曲县",
            "code": "747300"
          },
          {
            "cn": "碌曲县",
            "code": "747200"
          },
          {
            "cn": "舟曲县",
            "code": "746300"
          },
          {
            "cn": "迭部县",
            "code": "747400"
          }
        ]
      },
      {
        "cn": "白银市",
        "code": "730900",
        "area": [
          {
            "cn": "会宁县",
            "code": "730700"
          },
          {
            "cn": "平川区",
            "code": "730900"
          },
          {
            "cn": "景泰县",
            "code": "730400"
          },
          {
            "cn": "靖远县",
            "code": "730600"
          }
        ]
      },
      {
        "cn": "酒泉市",
        "code": "735000",
        "area": [
          {
            "cn": "敦煌市",
            "code": "736200"
          },
          {
            "cn": "玉门市",
            "code": "735200"
          },
          {
            "cn": "瓜州县",
            "code": "736100"
          },
          {
            "cn": "肃北蒙古族自治县",
            "code": "736300"
          },
          {
            "cn": "肃州区",
            "code": "735000"
          },
          {
            "cn": "金塔县",
            "code": "735300"
          },
          {
            "cn": "阿克塞哈萨克族自治县",
            "code": "736400"
          }
        ]
      },
      {
        "cn": "金昌市",
        "code": "737100",
        "area": [
          {
            "cn": "永昌县",
            "code": "737200"
          },
          {
            "cn": "金川区",
            "code": "737100"
          }
        ]
      },
      {
        "cn": "陇南市",
        "code": "742500",
        "area": [
          {
            "cn": "两当县",
            "code": "742400"
          },
          {
            "cn": "宕昌县",
            "code": "748500"
          },
          {
            "cn": "康县",
            "code": "746500"
          },
          {
            "cn": "徽县",
            "code": "742300"
          },
          {
            "cn": "成县",
            "code": "742500"
          },
          {
            "cn": "文县",
            "code": "746400"
          },
          {
            "cn": "武都区",
            "code": "746000"
          },
          {
            "cn": "礼县",
            "code": "742200"
          },
          {
            "cn": "西和县",
            "code": "742100"
          }
        ]
      }
    ]
  },
  {
    "cn": "宁夏回族自治区",
    "code": "ningxia",
    "citys": [
      {
        "cn": "中卫市",
        "code": "755000",
        "area": [
          {
            "cn": "中宁县",
            "code": "755100"
          },
          {
            "cn": "沙坡头区",
            "code": "755000"
          },
          {
            "cn": "海原县",
            "code": "755200"
          }
        ]
      },
      {
        "cn": "吴忠市",
        "code": "751100",
        "area": [
          {
            "cn": "利通区",
            "code": "751100"
          },
          {
            "cn": "同心县",
            "code": "751300"
          },
          {
            "cn": "盐池县",
            "code": "751500"
          },
          {
            "cn": "青铜峡市",
            "code": "751600"
          }
        ]
      },
      {
        "cn": "固原市",
        "code": "756000",
        "area": [
          {
            "cn": "原州区",
            "code": "756000"
          },
          {
            "cn": "彭阳县",
            "code": "756500"
          },
          {
            "cn": "泾源县",
            "code": "756400"
          },
          {
            "cn": "西吉县",
            "code": "756200"
          },
          {
            "cn": "隆德县",
            "code": "756300"
          }
        ]
      },
      {
        "cn": "石嘴山市",
        "code": "753000",
        "area": [
          {
            "cn": "大武口区",
            "code": "753000"
          },
          {
            "cn": "平罗县",
            "code": "753400"
          },
          {
            "cn": "惠农区",
            "code": "753600"
          }
        ]
      },
      {
        "cn": "银川市",
        "code": "750000",
        "area": [
          {
            "cn": "兴庆区",
            "code": "750000"
          },
          {
            "cn": "永宁县",
            "code": "750100"
          },
          {
            "cn": "灵武市",
            "code": "751400"
          },
          {
            "cn": "贺兰县",
            "code": "750200"
          }
        ]
      }
    ]
  },
  {
    "cn": "青海省",
    "code": "qinghai",
    "citys": [
      {
        "cn": "果洛藏族自治州",
        "code": "814000",
        "area": [
          {
            "cn": "久治县",
            "code": "624700"
          },
          {
            "cn": "玛多县",
            "code": "813500"
          },
          {
            "cn": "玛沁县",
            "code": "814000"
          },
          {
            "cn": "班玛县",
            "code": "814300"
          },
          {
            "cn": "甘德县",
            "code": "814100"
          },
          {
            "cn": "达日县",
            "code": "814200"
          }
        ]
      },
      {
        "cn": "海东地区",
        "code": "810600",
        "area": [
          {
            "cn": "乐都县",
            "code": "810700"
          },
          {
            "cn": "互助土族自治县",
            "code": "810500"
          },
          {
            "cn": "化隆回族自治县",
            "code": "810900"
          },
          {
            "cn": "平安县",
            "code": "810600"
          },
          {
            "cn": "循化撒拉族自治县",
            "code": "811100"
          },
          {
            "cn": "民和回族土族自治县",
            "code": "810800"
          }
        ]
      },
      {
        "cn": "海北藏族自治州",
        "code": "812200",
        "area": [
          {
            "cn": "刚察县",
            "code": "812300"
          },
          {
            "cn": "海晏县",
            "code": "812200"
          },
          {
            "cn": "祁连县",
            "code": "810400"
          },
          {
            "cn": "门源回族自治县",
            "code": "810300"
          }
        ]
      },
      {
        "cn": "海南藏族自治州",
        "code": "813000",
        "area": [
          {
            "cn": "共和县",
            "code": "811800"
          },
          {
            "cn": "兴海县",
            "code": "813300"
          },
          {
            "cn": "同德县",
            "code": "813200"
          },
          {
            "cn": "贵南县",
            "code": "813100"
          },
          {
            "cn": "贵德县",
            "code": "811700"
          }
        ]
      },
      {
        "cn": "海西蒙古族藏族自治州",
        "code": "817000",
        "area": [
          {
            "cn": "乌兰县",
            "code": "817100"
          },
          {
            "cn": "冷湖",
            "code": "816300"
          },
          {
            "cn": "大柴旦",
            "code": "817300"
          },
          {
            "cn": "天峻县",
            "code": "817200"
          },
          {
            "cn": "德令哈市",
            "code": "817000"
          },
          {
            "cn": "格尔木市",
            "code": "816000"
          },
          {
            "cn": "茫崖",
            "code": "817500"
          },
          {
            "cn": "都兰县",
            "code": "816100"
          }
        ]
      },
      {
        "cn": "玉树藏族自治州",
        "code": "815000",
        "area": [
          {
            "cn": "囊谦县",
            "code": "815200"
          },
          {
            "cn": "曲麻莱县",
            "code": "815500"
          },
          {
            "cn": "杂多县",
            "code": "815300"
          },
          {
            "cn": "治多县",
            "code": "815400"
          },
          {
            "cn": "玉树县",
            "code": "815000"
          },
          {
            "cn": "称多县",
            "code": "815100"
          }
        ]
      },
      {
        "cn": "西宁市",
        "code": "810000",
        "area": [
          {
            "cn": "城东区",
            "code": "810000"
          },
          {
            "cn": "大通回族土族自治县",
            "code": "810100"
          },
          {
            "cn": "湟中县",
            "code": "811600"
          },
          {
            "cn": "湟源县",
            "code": "812100"
          }
        ]
      },
      {
        "cn": "黄南藏族自治州",
        "code": "811300",
        "area": [
          {
            "cn": "同仁县",
            "code": "811300"
          },
          {
            "cn": "尖扎县",
            "code": "811200"
          },
          {
            "cn": "河南蒙古族自治县",
            "code": "811500"
          },
          {
            "cn": "泽库县",
            "code": "811400"
          }
        ]
      }
    ]
  },
  {
    "cn": "新疆维吾尔自治区",
    "code": "xinjiang",
    "citys": [
      {
        "cn": "乌鲁木齐市",
        "code": "830000",
        "area": [
          {
            "cn": "乌鲁木齐县",
            "code": "830000"
          },
          {
            "cn": "新市区",
            "code": "841100"
          },
          {
            "cn": "米东区",
            "code": "831400"
          }
        ]
      },
      {
        "cn": "伊犁哈萨克自治州",
        "code": "835100",
        "area": [
          {
            "cn": "伊宁县",
            "code": "844500"
          },
          {
            "cn": "伊宁市",
            "code": "839300"
          },
          {
            "cn": "奎屯市",
            "code": "833200"
          },
          {
            "cn": "察布查尔锡伯自治县",
            "code": "835300"
          },
          {
            "cn": "尼勒克县",
            "code": "835700"
          },
          {
            "cn": "巩留县",
            "code": "835400"
          },
          {
            "cn": "新源县",
            "code": "844900"
          },
          {
            "cn": "昭苏县",
            "code": "835500"
          },
          {
            "cn": "霍城县",
            "code": "835200"
          }
        ]
      },
      {
        "cn": "克孜勒苏柯尔克孜自治州",
        "code": "845350",
        "area": [
          {
            "cn": "乌恰县",
            "code": "845450"
          },
          {
            "cn": "阿克陶县",
            "code": "845550"
          },
          {
            "cn": "阿合奇县",
            "code": "843500"
          },
          {
            "cn": "阿图什市",
            "code": "845350"
          }
        ]
      },
      {
        "cn": "克拉玛依市",
        "code": "834000",
        "area": [
          {
            "cn": "乌尔禾区",
            "code": "834000"
          },
          {
            "cn": "独山子区",
            "code": "833600"
          }
        ]
      },
      {
        "cn": "博尔塔拉蒙古自治州",
        "code": "833400",
        "area": [
          {
            "cn": "博乐市",
            "code": "833400"
          },
          {
            "cn": "温泉县",
            "code": "833500"
          },
          {
            "cn": "精河县",
            "code": "833300"
          }
        ]
      },
      {
        "cn": "吐鲁番地区",
        "code": "838000",
        "area": [
          {
            "cn": "吐鲁番市",
            "code": "838000"
          },
          {
            "cn": "托克逊县",
            "code": "838100"
          },
          {
            "cn": "鄯善县",
            "code": "838200"
          }
        ]
      },
      {
        "cn": "和田地区",
        "code": "848000",
        "area": [
          {
            "cn": "于田县",
            "code": "844400"
          },
          {
            "cn": "和田县",
            "code": "848000"
          },
          {
            "cn": "墨玉县",
            "code": "848100"
          },
          {
            "cn": "民丰县",
            "code": "848500"
          },
          {
            "cn": "洛浦县",
            "code": "848200"
          },
          {
            "cn": "皮山县",
            "code": "845150"
          },
          {
            "cn": "策勒县",
            "code": "848300"
          }
        ]
      },
      {
        "cn": "哈密地区",
        "code": "839000",
        "area": [
          {
            "cn": "伊吾县",
            "code": "848400"
          },
          {
            "cn": "哈密市",
            "code": "839000"
          },
          {
            "cn": "巴里坤哈萨克自治县",
            "code": "839200"
          }
        ]
      },
      {
        "cn": "喀什地区",
        "code": "844000",
        "area": [
          {
            "cn": "伽师县",
            "code": "844300"
          },
          {
            "cn": "叶城县",
            "code": "835000"
          },
          {
            "cn": "喀什市",
            "code": "844000"
          },
          {
            "cn": "塔什库尔干塔吉克自治县",
            "code": "845250"
          },
          {
            "cn": "岳普湖县",
            "code": "835600"
          },
          {
            "cn": "巴楚县",
            "code": "843800"
          },
          {
            "cn": "泽普县",
            "code": "844800"
          },
          {
            "cn": "疏勒县",
            "code": "844200"
          },
          {
            "cn": "疏附县",
            "code": "844100"
          },
          {
            "cn": "英吉沙县",
            "code": "834800"
          },
          {
            "cn": "莎车县",
            "code": "844700"
          },
          {
            "cn": "麦盖提县",
            "code": "844600"
          }
        ]
      },
      {
        "cn": "塔城地区",
        "code": "834700",
        "area": [
          {
            "cn": "和布克赛尔蒙古自治县",
            "code": "834400"
          },
          {
            "cn": "塔城市",
            "code": "834300"
          },
          {
            "cn": "托里县",
            "code": "834500"
          },
          {
            "cn": "沙湾县",
            "code": "832100"
          },
          {
            "cn": "额敏县",
            "code": "834600"
          }
        ]
      },
      {
        "cn": "巴音郭楞蒙古自治州",
        "code": "841000",
        "area": [
          {
            "cn": "且末县",
            "code": "841900"
          },
          {
            "cn": "博湖县",
            "code": "841400"
          },
          {
            "cn": "和硕县",
            "code": "841200"
          },
          {
            "cn": "和静县",
            "code": "841300"
          },
          {
            "cn": "尉犁县",
            "code": "841500"
          },
          {
            "cn": "库尔勒市",
            "code": "841000"
          },
          {
            "cn": "若羌县",
            "code": "841800"
          },
          {
            "cn": "轮台县",
            "code": "841600"
          }
        ]
      },
      {
        "cn": "昌吉回族自治州",
        "code": "831100",
        "area": [
          {
            "cn": "五家渠市",
            "code": "831300"
          },
          {
            "cn": "吉木萨尔县",
            "code": "831700"
          },
          {
            "cn": "呼图壁县",
            "code": "831200"
          },
          {
            "cn": "奇台县",
            "code": "831800"
          },
          {
            "cn": "昌吉市",
            "code": "831100"
          },
          {
            "cn": "木垒哈萨克自治县",
            "code": "831900"
          },
          {
            "cn": "玛纳斯县",
            "code": "832200"
          },
          {
            "cn": "阜康市",
            "code": "831500"
          }
        ]
      },
      {
        "cn": "阿克苏地区",
        "code": "843000",
        "area": [
          {
            "cn": "乌什县",
            "code": "843400"
          },
          {
            "cn": "库车县",
            "code": "842000"
          },
          {
            "cn": "拜城县",
            "code": "842300"
          },
          {
            "cn": "新和县",
            "code": "842100"
          },
          {
            "cn": "柯坪县",
            "code": "843600"
          },
          {
            "cn": "沙雅县",
            "code": "842200"
          },
          {
            "cn": "温宿县",
            "code": "843100"
          },
          {
            "cn": "阿克苏市",
            "code": "843000"
          },
          {
            "cn": "阿瓦提县",
            "code": "843200"
          }
        ]
      },
      {
        "cn": "阿勒泰地区",
        "code": "836500",
        "area": [
          {
            "cn": "北屯镇",
            "code": "836000"
          },
          {
            "cn": "吉木乃县",
            "code": "836800"
          },
          {
            "cn": "哈巴河县",
            "code": "836700"
          },
          {
            "cn": "富蕴县",
            "code": "836100"
          },
          {
            "cn": "布尔津县",
            "code": "836600"
          },
          {
            "cn": "福海县",
            "code": "836400"
          },
          {
            "cn": "阿勒泰市",
            "code": "836500"
          },
          {
            "cn": "青河县",
            "code": "836200"
          }
        ]
      }
    ]
  },
  {
    "cn": "重庆市",
    "code": "chongqing",
    "citys": [
      {
        "cn": "重庆市",
        "code": "400000",
        "area": [
          {
            "cn": "万州区",
            "code": "404100"
          },
          {
            "cn": "万盛区",
            "code": "400800"
          },
          {
            "cn": "丰都县",
            "code": "408200"
          },
          {
            "cn": "九龙坡区",
            "code": "400000"
          },
          {
            "cn": "云阳县",
            "code": "404500"
          },
          {
            "cn": "北碚区",
            "code": "400700"
          },
          {
            "cn": "南川区",
            "code": "408400"
          },
          {
            "cn": "双桥区",
            "code": "400900"
          },
          {
            "cn": "合川区",
            "code": "401520"
          },
          {
            "cn": "垫江县",
            "code": "408300"
          },
          {
            "cn": "城口县",
            "code": "405900"
          },
          {
            "cn": "大足县",
            "code": "402360"
          },
          {
            "cn": "奉节县",
            "code": "404600"
          },
          {
            "cn": "巫山县",
            "code": "404700"
          },
          {
            "cn": "巫溪县",
            "code": "405800"
          },
          {
            "cn": "巴南区",
            "code": "401320"
          },
          {
            "cn": "开县",
            "code": "405400"
          },
          {
            "cn": "彭水苗族土家族自治县",
            "code": "409600"
          },
          {
            "cn": "忠县",
            "code": "404300"
          },
          {
            "cn": "梁平县",
            "code": "405200"
          },
          {
            "cn": "武隆县",
            "code": "408500"
          },
          {
            "cn": "永川区",
            "code": "402160"
          },
          {
            "cn": "江津区",
            "code": "402260"
          },
          {
            "cn": "涪陵区",
            "code": "408000"
          },
          {
            "cn": "渝北区",
            "code": "401120"
          },
          {
            "cn": "潼南县",
            "code": "402660"
          },
          {
            "cn": "璧山县",
            "code": "402760"
          },
          {
            "cn": "石柱土家族自治县",
            "code": "409100"
          },
          {
            "cn": "秀山土家族苗族自治县",
            "code": "409900"
          },
          {
            "cn": "荣昌县",
            "code": "402460"
          },
          {
            "cn": "酉阳土家族苗族自治县",
            "code": "409800"
          },
          {
            "cn": "铜梁县",
            "code": "402560"
          },
          {
            "cn": "长寿区",
            "code": "401220"
          },
          {
            "cn": "黔江区",
            "code": "409000"
          }
        ]
      }
    ]
  },
  {
    "cn": "四川省",
    "code": "sichuan",
    "citys": [
      {
        "cn": "乐山市",
        "code": "614000",
        "area": [
          {
            "cn": "五通桥区",
            "code": "614800"
          },
          {
            "cn": "井研县",
            "code": "613100"
          },
          {
            "cn": "夹江县",
            "code": "614100"
          },
          {
            "cn": "峨眉山市",
            "code": "614200"
          },
          {
            "cn": "峨边彝族自治县",
            "code": "614300"
          },
          {
            "cn": "市中区",
            "code": "614000"
          },
          {
            "cn": "沐川县",
            "code": "614500"
          },
          {
            "cn": "沙湾区",
            "code": "614900"
          },
          {
            "cn": "犍为县",
            "code": "614400"
          },
          {
            "cn": "金口河区",
            "code": "614700"
          },
          {
            "cn": "马边彝族自治县",
            "code": "614600"
          }
        ]
      },
      {
        "cn": "内江市",
        "code": "641000",
        "area": [
          {
            "cn": "东兴区",
            "code": "641100"
          },
          {
            "cn": "威远县",
            "code": "642450"
          },
          {
            "cn": "市中区",
            "code": "610200"
          },
          {
            "cn": "资中县",
            "code": "641200"
          },
          {
            "cn": "隆昌县",
            "code": "642150"
          }
        ]
      },
      {
        "cn": "凉山彝族自治州",
        "code": "615000",
        "area": [
          {
            "cn": "会东县",
            "code": "615200"
          },
          {
            "cn": "会理县",
            "code": "615100"
          },
          {
            "cn": "冕宁县",
            "code": "615600"
          },
          {
            "cn": "喜德县",
            "code": "616750"
          },
          {
            "cn": "宁南县",
            "code": "615400"
          },
          {
            "cn": "布拖县",
            "code": "615350"
          },
          {
            "cn": "德昌县",
            "code": "615500"
          },
          {
            "cn": "昭觉县",
            "code": "616150"
          },
          {
            "cn": "普格县",
            "code": "615300"
          },
          {
            "cn": "木里藏族自治县",
            "code": "615800"
          },
          {
            "cn": "甘洛县",
            "code": "616850"
          },
          {
            "cn": "盐源县",
            "code": "615700"
          },
          {
            "cn": "美姑县",
            "code": "616450"
          },
          {
            "cn": "西昌市",
            "code": "615000"
          },
          {
            "cn": "越西县",
            "code": "616650"
          },
          {
            "cn": "金阳县",
            "code": "616250"
          },
          {
            "cn": "雷波县",
            "code": "616550"
          }
        ]
      },
      {
        "cn": "南充市",
        "code": "637000",
        "area": [
          {
            "cn": "仪陇县",
            "code": "637600"
          },
          {
            "cn": "南部县",
            "code": "637300"
          },
          {
            "cn": "嘉陵区",
            "code": "637500"
          },
          {
            "cn": "营山县",
            "code": "637700"
          },
          {
            "cn": "蓬安县",
            "code": "637800"
          },
          {
            "cn": "西充县",
            "code": "637200"
          },
          {
            "cn": "阆中市",
            "code": "637400"
          },
          {
            "cn": "顺庆区",
            "code": "623300"
          },
          {
            "cn": "高坪区",
            "code": "637100"
          }
        ]
      },
      {
        "cn": "宜宾市",
        "code": "644000",
        "area": [
          {
            "cn": "兴文县",
            "code": "644400"
          },
          {
            "cn": "南溪县",
            "code": "644100"
          },
          {
            "cn": "宜宾县",
            "code": "644600"
          },
          {
            "cn": "屏山县",
            "code": "645350"
          },
          {
            "cn": "江安县",
            "code": "644200"
          },
          {
            "cn": "珙县",
            "code": "644500"
          },
          {
            "cn": "筠连县",
            "code": "645250"
          },
          {
            "cn": "翠屏区",
            "code": "644000"
          },
          {
            "cn": "长宁县",
            "code": "644300"
          },
          {
            "cn": "高县",
            "code": "645150"
          }
        ]
      },
      {
        "cn": "巴中市",
        "code": "636600",
        "area": [
          {
            "cn": "南江县",
            "code": "635600"
          },
          {
            "cn": "巴州区",
            "code": "636600"
          },
          {
            "cn": "平昌县",
            "code": "636400"
          },
          {
            "cn": "通江县",
            "code": "636700"
          }
        ]
      },
      {
        "cn": "广元市",
        "code": "628000",
        "area": [
          {
            "cn": "元坝区",
            "code": "628000"
          },
          {
            "cn": "剑阁县",
            "code": "628300"
          },
          {
            "cn": "旺苍县",
            "code": "628200"
          },
          {
            "cn": "苍溪县",
            "code": "628400"
          },
          {
            "cn": "青川县",
            "code": "628100"
          }
        ]
      },
      {
        "cn": "广安市",
        "code": "638500",
        "area": [
          {
            "cn": "华蓥市",
            "code": "638600"
          },
          {
            "cn": "岳池县",
            "code": "638300"
          },
          {
            "cn": "广安区",
            "code": "638550"
          },
          {
            "cn": "武胜县",
            "code": "638400"
          },
          {
            "cn": "邻水县",
            "code": "638500"
          }
        ]
      },
      {
        "cn": "德阳市",
        "code": "618000",
        "area": [
          {
            "cn": "中江县",
            "code": "618100"
          },
          {
            "cn": "什邡市",
            "code": "618400"
          },
          {
            "cn": "广汉市",
            "code": "618300"
          },
          {
            "cn": "旌阳区",
            "code": "618000"
          },
          {
            "cn": "绵竹市",
            "code": "618200"
          },
          {
            "cn": "罗江县",
            "code": "618500"
          }
        ]
      },
      {
        "cn": "成都市",
        "code": "610000",
        "area": [
          {
            "cn": "双流县",
            "code": "637000"
          },
          {
            "cn": "大邑县",
            "code": "611300"
          },
          {
            "cn": "崇州市",
            "code": "611200"
          },
          {
            "cn": "彭州市",
            "code": "611900"
          },
          {
            "cn": "成华区",
            "code": "610000"
          },
          {
            "cn": "新津县",
            "code": "611400"
          },
          {
            "cn": "新都区",
            "code": "610500"
          },
          {
            "cn": "温江区",
            "code": "611100"
          },
          {
            "cn": "蒲江县",
            "code": "611600"
          },
          {
            "cn": "邛崃市",
            "code": "611500"
          },
          {
            "cn": "郫县",
            "code": "611700"
          },
          {
            "cn": "都江堰市",
            "code": "611800"
          },
          {
            "cn": "金堂县",
            "code": "610400"
          },
          {
            "cn": "青白江区",
            "code": "610300"
          },
          {
            "cn": "龙泉驿区",
            "code": "610100"
          }
        ]
      },
      {
        "cn": "攀枝花市",
        "code": "617000",
        "area": [
          {
            "cn": "东区",
            "code": "617000"
          },
          {
            "cn": "盐边县",
            "code": "617100"
          },
          {
            "cn": "米易县",
            "code": "617200"
          }
        ]
      },
      {
        "cn": "泸州市",
        "code": "646000",
        "area": [
          {
            "cn": "叙永县",
            "code": "646400"
          },
          {
            "cn": "古蔺县",
            "code": "646500"
          },
          {
            "cn": "合江县",
            "code": "646200"
          },
          {
            "cn": "江阳区",
            "code": "646000"
          },
          {
            "cn": "泸县",
            "code": "646100"
          },
          {
            "cn": "纳溪区",
            "code": "646300"
          }
        ]
      },
      {
        "cn": "甘孜藏族自治州",
        "code": "626700",
        "area": [
          {
            "cn": "丹巴县",
            "code": "626300"
          },
          {
            "cn": "九龙县",
            "code": "616200"
          },
          {
            "cn": "乡城县",
            "code": "627850"
          },
          {
            "cn": "巴塘县",
            "code": "627650"
          },
          {
            "cn": "康定县",
            "code": "626000"
          },
          {
            "cn": "得荣县",
            "code": "627950"
          },
          {
            "cn": "德格县",
            "code": "627250"
          },
          {
            "cn": "新龙县",
            "code": "626800"
          },
          {
            "cn": "泸定县",
            "code": "626100"
          },
          {
            "cn": "炉霍县",
            "code": "626500"
          },
          {
            "cn": "理塘县",
            "code": "624300"
          },
          {
            "cn": "甘孜县",
            "code": "626700"
          },
          {
            "cn": "白玉县",
            "code": "627150"
          },
          {
            "cn": "石渠县",
            "code": "627350"
          },
          {
            "cn": "稻城县",
            "code": "627750"
          },
          {
            "cn": "色达县",
            "code": "626600"
          },
          {
            "cn": "道孚县",
            "code": "626400"
          },
          {
            "cn": "雅江县",
            "code": "627450"
          }
        ]
      },
      {
        "cn": "眉山市",
        "code": "620000",
        "area": [
          {
            "cn": "东坡区",
            "code": "620000"
          },
          {
            "cn": "丹棱县",
            "code": "620200"
          },
          {
            "cn": "仁寿县",
            "code": "620500"
          },
          {
            "cn": "彭山县",
            "code": "620800"
          },
          {
            "cn": "洪雅县",
            "code": "620300"
          },
          {
            "cn": "青神县",
            "code": "620400"
          }
        ]
      },
      {
        "cn": "绵阳市",
        "code": "621000",
        "area": [
          {
            "cn": "三台县",
            "code": "621100"
          },
          {
            "cn": "北川羌族自治县",
            "code": "622750"
          },
          {
            "cn": "安县",
            "code": "622650"
          },
          {
            "cn": "平武县",
            "code": "622550"
          },
          {
            "cn": "梓潼县",
            "code": "622150"
          },
          {
            "cn": "江油市",
            "code": "621700"
          },
          {
            "cn": "涪城区",
            "code": "621000"
          },
          {
            "cn": "盐亭县",
            "code": "621600"
          }
        ]
      },
      {
        "cn": "自贡市",
        "code": "643000",
        "area": [
          {
            "cn": "大安区",
            "code": "643010"
          },
          {
            "cn": "富顺县",
            "code": "643200"
          },
          {
            "cn": "沿滩区",
            "code": "643030"
          },
          {
            "cn": "自流井区",
            "code": "643000"
          },
          {
            "cn": "荣县",
            "code": "643100"
          },
          {
            "cn": "贡井区",
            "code": "643020"
          }
        ]
      },
      {
        "cn": "资阳市",
        "code": "641300",
        "area": [
          {
            "cn": "乐至县",
            "code": "641500"
          },
          {
            "cn": "安岳县",
            "code": "642350"
          },
          {
            "cn": "简阳市",
            "code": "641400"
          },
          {
            "cn": "雁江区",
            "code": "641300"
          }
        ]
      },
      {
        "cn": "达州市",
        "code": "635000",
        "area": [
          {
            "cn": "万源市",
            "code": "636350"
          },
          {
            "cn": "大竹县",
            "code": "635100"
          },
          {
            "cn": "宣汉县",
            "code": "636150"
          },
          {
            "cn": "开江县",
            "code": "636250"
          },
          {
            "cn": "渠县",
            "code": "635200"
          },
          {
            "cn": "达县",
            "code": "635000"
          }
        ]
      },
      {
        "cn": "遂宁市",
        "code": "629000",
        "area": [
          {
            "cn": "大英县",
            "code": "629300"
          },
          {
            "cn": "安居区",
            "code": "629000"
          },
          {
            "cn": "射洪县",
            "code": "629200"
          },
          {
            "cn": "蓬溪县",
            "code": "629100"
          }
        ]
      },
      {
        "cn": "阿坝藏族羌族自治州",
        "code": "624000",
        "area": [
          {
            "cn": "九寨沟县",
            "code": "623400"
          },
          {
            "cn": "小金县",
            "code": "624200"
          },
          {
            "cn": "汶川县",
            "code": "623000"
          },
          {
            "cn": "理县",
            "code": "623100"
          },
          {
            "cn": "红原县",
            "code": "624400"
          },
          {
            "cn": "若尔盖县",
            "code": "624500"
          },
          {
            "cn": "茂县",
            "code": "623200"
          },
          {
            "cn": "金川县",
            "code": "624100"
          },
          {
            "cn": "阿坝县",
            "code": "624600"
          },
          {
            "cn": "马尔康县",
            "code": "624000"
          },
          {
            "cn": "黑水县",
            "code": "623500"
          }
        ]
      },
      {
        "cn": "雅安市",
        "code": "625000",
        "area": [
          {
            "cn": "名山县",
            "code": "625100"
          },
          {
            "cn": "天全县",
            "code": "625500"
          },
          {
            "cn": "宝兴县",
            "code": "625700"
          },
          {
            "cn": "汉源县",
            "code": "625300"
          },
          {
            "cn": "石棉县",
            "code": "625400"
          },
          {
            "cn": "芦山县",
            "code": "625600"
          },
          {
            "cn": "荥经县",
            "code": "625200"
          },
          {
            "cn": "雨城区",
            "code": "625000"
          }
        ]
      }
    ]
  },
  {
    "cn": "云南省",
    "code": "yunnan",
    "citys": [
      {
        "cn": "临沧市",
        "code": "677000",
        "area": [
          {
            "cn": "临翔区",
            "code": "677000"
          },
          {
            "cn": "云县",
            "code": "675800"
          },
          {
            "cn": "凤庆县",
            "code": "675900"
          },
          {
            "cn": "双江拉祜族佤族布朗族傣族自治县",
            "code": "677300"
          },
          {
            "cn": "永德县",
            "code": "677600"
          },
          {
            "cn": "沧源佤族自治县",
            "code": "677400"
          },
          {
            "cn": "耿马傣族佤族自治县",
            "code": "677500"
          },
          {
            "cn": "镇康县",
            "code": "677700"
          }
        ]
      },
      {
        "cn": "丽江市",
        "code": "674100",
        "area": [
          {
            "cn": "华坪县",
            "code": "674800"
          },
          {
            "cn": "古城区",
            "code": "674100"
          },
          {
            "cn": "宁蒗彝族自治县",
            "code": "674300"
          },
          {
            "cn": "永胜县",
            "code": "674200"
          }
        ]
      },
      {
        "cn": "保山市",
        "code": "678000",
        "area": [
          {
            "cn": "施甸县",
            "code": "678200"
          },
          {
            "cn": "昌宁县",
            "code": "678100"
          },
          {
            "cn": "腾冲县",
            "code": "679100"
          },
          {
            "cn": "隆阳区",
            "code": "678000"
          },
          {
            "cn": "龙陵县",
            "code": "678300"
          }
        ]
      },
      {
        "cn": "大理白族自治州",
        "code": "671000",
        "area": [
          {
            "cn": "云龙县",
            "code": "672700"
          },
          {
            "cn": "剑川县",
            "code": "671300"
          },
          {
            "cn": "南涧彝族自治县",
            "code": "675700"
          },
          {
            "cn": "大理市",
            "code": "671000"
          },
          {
            "cn": "宾川县",
            "code": "671600"
          },
          {
            "cn": "巍山彝族回族自治县",
            "code": "672400"
          },
          {
            "cn": "弥渡县",
            "code": "675600"
          },
          {
            "cn": "永平县",
            "code": "672600"
          },
          {
            "cn": "洱源县",
            "code": "671200"
          },
          {
            "cn": "漾濞彝族自治县",
            "code": "672500"
          },
          {
            "cn": "祥云县",
            "code": "672100"
          },
          {
            "cn": "鹤庆县",
            "code": "671500"
          }
        ]
      },
      {
        "cn": "德宏傣族景颇族自治州",
        "code": "678400",
        "area": [
          {
            "cn": "梁河县",
            "code": "679200"
          },
          {
            "cn": "潞西市",
            "code": "678400"
          },
          {
            "cn": "瑞丽市",
            "code": "678600"
          },
          {
            "cn": "盈江县",
            "code": "679300"
          },
          {
            "cn": "陇川县",
            "code": "678700"
          }
        ]
      },
      {
        "cn": "怒江傈僳族自治州",
        "code": "673100",
        "area": [
          {
            "cn": "兰坪白族普米族自治县",
            "code": "671400"
          },
          {
            "cn": "泸水县",
            "code": "673200"
          },
          {
            "cn": "福贡县",
            "code": "673400"
          },
          {
            "cn": "贡山独龙族怒族自治县",
            "code": "673500"
          }
        ]
      },
      {
        "cn": "文山壮族苗族自治州",
        "code": "663000",
        "area": [
          {
            "cn": "丘北县",
            "code": "663200"
          },
          {
            "cn": "富宁县",
            "code": "663400"
          },
          {
            "cn": "广南县",
            "code": "663300"
          },
          {
            "cn": "文山县",
            "code": "663000"
          },
          {
            "cn": "砚山县",
            "code": "663100"
          },
          {
            "cn": "西畴县",
            "code": "663500"
          },
          {
            "cn": "马关县",
            "code": "663700"
          },
          {
            "cn": "麻栗坡县",
            "code": "663600"
          }
        ]
      },
      {
        "cn": "昆明市",
        "code": "650000",
        "area": [
          {
            "cn": "东川区",
            "code": "654100"
          },
          {
            "cn": "五华区",
            "code": "650000"
          },
          {
            "cn": "呈贡县",
            "code": "650500"
          },
          {
            "cn": "安宁市",
            "code": "650300"
          },
          {
            "cn": "官渡区",
            "code": "650200"
          },
          {
            "cn": "宜良县",
            "code": "652100"
          },
          {
            "cn": "富民县",
            "code": "650400"
          },
          {
            "cn": "寻甸回族彝族自治县",
            "code": "655200"
          },
          {
            "cn": "嵩明县",
            "code": "651700"
          },
          {
            "cn": "晋宁县",
            "code": "650600"
          },
          {
            "cn": "石林彝族自治县",
            "code": "652200"
          },
          {
            "cn": "禄劝彝族苗族自治县",
            "code": "651500"
          },
          {
            "cn": "西山区",
            "code": "650100"
          }
        ]
      },
      {
        "cn": "昭通市",
        "code": "657000",
        "area": [
          {
            "cn": "大关县",
            "code": "657400"
          },
          {
            "cn": "威信县",
            "code": "657900"
          },
          {
            "cn": "巧家县",
            "code": "654600"
          },
          {
            "cn": "彝良县",
            "code": "657600"
          },
          {
            "cn": "昭阳区",
            "code": "657000"
          },
          {
            "cn": "水富县",
            "code": "657800"
          },
          {
            "cn": "永善县",
            "code": "657300"
          },
          {
            "cn": "盐津县",
            "code": "657500"
          },
          {
            "cn": "绥江县",
            "code": "657700"
          },
          {
            "cn": "镇雄县",
            "code": "657200"
          },
          {
            "cn": "鲁甸县",
            "code": "657100"
          }
        ]
      },
      {
        "cn": "普洱市",
        "code": "665000",
        "area": [
          {
            "cn": "墨江哈尼族自治县",
            "code": "654800"
          },
          {
            "cn": "孟连傣族拉祜族佤族自治县",
            "code": "665800"
          },
          {
            "cn": "宁洱哈尼族彝族自治县",
            "code": "665000"
          },
          {
            "cn": "景东彝族自治县",
            "code": "676200"
          },
          {
            "cn": "景谷傣族彝族自治县",
            "code": "666400"
          },
          {
            "cn": "江城哈尼族彝族自治县",
            "code": "665900"
          },
          {
            "cn": "澜沧拉祜族自治县",
            "code": "665600"
          },
          {
            "cn": "西盟佤族自治县",
            "code": "665700"
          },
          {
            "cn": "镇沅彝族哈尼族拉祜族自治县",
            "code": "666500"
          }
        ]
      },
      {
        "cn": "曲靖市",
        "code": "655000",
        "area": [
          {
            "cn": "会泽县",
            "code": "654200"
          },
          {
            "cn": "宣威市",
            "code": "655400"
          },
          {
            "cn": "富源县",
            "code": "655500"
          },
          {
            "cn": "师宗县",
            "code": "655700"
          },
          {
            "cn": "罗平县",
            "code": "655800"
          },
          {
            "cn": "陆良县",
            "code": "655600"
          },
          {
            "cn": "马龙县",
            "code": "655100"
          },
          {
            "cn": "麒麟区",
            "code": "655000"
          }
        ]
      },
      {
        "cn": "楚雄彝族自治州",
        "code": "675000",
        "area": [
          {
            "cn": "元谋县",
            "code": "651300"
          },
          {
            "cn": "南华县",
            "code": "675200"
          },
          {
            "cn": "双柏县",
            "code": "675100"
          },
          {
            "cn": "大姚县",
            "code": "675400"
          },
          {
            "cn": "姚安县",
            "code": "675300"
          },
          {
            "cn": "楚雄市",
            "code": "675000"
          },
          {
            "cn": "武定县",
            "code": "651600"
          },
          {
            "cn": "永仁县",
            "code": "651400"
          },
          {
            "cn": "牟定县",
            "code": "675500"
          },
          {
            "cn": "禄丰县",
            "code": "651200"
          }
        ]
      },
      {
        "cn": "玉溪市",
        "code": "653100",
        "area": [
          {
            "cn": "元江哈尼族彝族傣族自治县",
            "code": "653300"
          },
          {
            "cn": "华宁县",
            "code": "652800"
          },
          {
            "cn": "峨山彝族自治县",
            "code": "653200"
          },
          {
            "cn": "新平彝族傣族自治县",
            "code": "653400"
          },
          {
            "cn": "易门县",
            "code": "651100"
          },
          {
            "cn": "江川县",
            "code": "652600"
          },
          {
            "cn": "澄江县",
            "code": "652500"
          },
          {
            "cn": "红塔区",
            "code": "653100"
          },
          {
            "cn": "通海县",
            "code": "652700"
          }
        ]
      },
      {
        "cn": "红河哈尼族彝族自治州",
        "code": "651400",
        "area": [
          {
            "cn": "个旧市",
            "code": "661000"
          },
          {
            "cn": "元阳县",
            "code": "662400"
          },
          {
            "cn": "屏边苗族自治县",
            "code": "661200"
          },
          {
            "cn": "建水县",
            "code": "654300"
          },
          {
            "cn": "开远市",
            "code": "661600"
          },
          {
            "cn": "弥勒县",
            "code": "652300"
          },
          {
            "cn": "河口瑶族自治县",
            "code": "661300"
          },
          {
            "cn": "泸西县",
            "code": "652400"
          },
          {
            "cn": "石屏县",
            "code": "662200"
          },
          {
            "cn": "红河县",
            "code": "654400"
          },
          {
            "cn": "绿春县",
            "code": "662500"
          },
          {
            "cn": "蒙自县",
            "code": "661100"
          },
          {
            "cn": "金平苗族瑶族傣族自治县",
            "code": "661500"
          }
        ]
      },
      {
        "cn": "西双版纳傣族自治州",
        "code": "666100",
        "area": [
          {
            "cn": "勐海县",
            "code": "666200"
          },
          {
            "cn": "勐腊县",
            "code": "666300"
          },
          {
            "cn": "景洪市",
            "code": "666100"
          }
        ]
      },
      {
        "cn": "迪庆藏族自治州",
        "code": "674400",
        "area": [
          {
            "cn": "德钦县",
            "code": "674500"
          },
          {
            "cn": "维西傈僳族自治县",
            "code": "674600"
          },
          {
            "cn": "香格里拉县",
            "code": "674400"
          }
        ]
      }
    ]
  },
  {
    "cn": "贵州省",
    "code": "guizhou",
    "citys": [
      {
        "cn": "六盘水市",
        "code": "553000",
        "area": [
          {
            "cn": "六枝特区",
            "code": "553400"
          },
          {
            "cn": "水城县",
            "code": "553600"
          },
          {
            "cn": "盘县",
            "code": "553500"
          },
          {
            "cn": "钟山区",
            "code": "553000"
          }
        ]
      },
      {
        "cn": "安顺市",
        "code": "561000",
        "area": [
          {
            "cn": "关岭布依族苗族自治县",
            "code": "561300"
          },
          {
            "cn": "平坝县",
            "code": "561100"
          },
          {
            "cn": "普定县",
            "code": "562100"
          },
          {
            "cn": "紫云苗族布依族自治县",
            "code": "550800"
          },
          {
            "cn": "西秀区",
            "code": "561000"
          },
          {
            "cn": "镇宁布依族苗族自治县",
            "code": "561200"
          }
        ]
      },
      {
        "cn": "毕节地区",
        "code": "551700",
        "area": [
          {
            "cn": "大方县",
            "code": "551600"
          },
          {
            "cn": "威宁彝族回族苗族自治县",
            "code": "553100"
          },
          {
            "cn": "毕节市",
            "code": "551700"
          },
          {
            "cn": "纳雍县",
            "code": "553300"
          },
          {
            "cn": "织金县",
            "code": "552100"
          },
          {
            "cn": "赫章县",
            "code": "553200"
          },
          {
            "cn": "金沙县",
            "code": "551800"
          },
          {
            "cn": "黔西县",
            "code": "551500"
          }
        ]
      },
      {
        "cn": "贵阳市",
        "code": "550000",
        "area": [
          {
            "cn": "乌当区",
            "code": "550000"
          },
          {
            "cn": "修文县",
            "code": "550200"
          },
          {
            "cn": "开阳县",
            "code": "550300"
          },
          {
            "cn": "息烽县",
            "code": "551100"
          },
          {
            "cn": "清镇市",
            "code": "551400"
          }
        ]
      },
      {
        "cn": "遵义市",
        "code": "563000",
        "area": [
          {
            "cn": "习水县",
            "code": "564600"
          },
          {
            "cn": "仁怀市",
            "code": "564500"
          },
          {
            "cn": "余庆县",
            "code": "564400"
          },
          {
            "cn": "凤冈县",
            "code": "564200"
          },
          {
            "cn": "务川仡佬族苗族自治县",
            "code": "564300"
          },
          {
            "cn": "桐梓县",
            "code": "563200"
          },
          {
            "cn": "正安县",
            "code": "563400"
          },
          {
            "cn": "汇川区",
            "code": "563000"
          },
          {
            "cn": "湄潭县",
            "code": "564100"
          },
          {
            "cn": "绥阳县",
            "code": "563300"
          },
          {
            "cn": "赤水市",
            "code": "564700"
          },
          {
            "cn": "道真仡佬族苗族自治县",
            "code": "563500"
          },
          {
            "cn": "遵义县",
            "code": "563100"
          }
        ]
      },
      {
        "cn": "铜仁地区",
        "code": "554300",
        "area": [
          {
            "cn": "万山特区",
            "code": "554200"
          },
          {
            "cn": "印江土家族苗族自治县",
            "code": "555200"
          },
          {
            "cn": "德江县",
            "code": "565200"
          },
          {
            "cn": "思南县",
            "code": "565100"
          },
          {
            "cn": "松桃苗族自治县",
            "code": "554100"
          },
          {
            "cn": "江口县",
            "code": "554400"
          },
          {
            "cn": "沿河土家族自治县",
            "code": "565300"
          },
          {
            "cn": "玉屏侗族自治县",
            "code": "554000"
          },
          {
            "cn": "石阡县",
            "code": "555100"
          },
          {
            "cn": "铜仁市",
            "code": "554300"
          }
        ]
      },
      {
        "cn": "黔东南苗族侗族自治州",
        "code": "556000",
        "area": [
          {
            "cn": "三穗县",
            "code": "556500"
          },
          {
            "cn": "丹寨县",
            "code": "557500"
          },
          {
            "cn": "从江县",
            "code": "557400"
          },
          {
            "cn": "凯里市",
            "code": "556000"
          },
          {
            "cn": "剑河县",
            "code": "556400"
          },
          {
            "cn": "台江县",
            "code": "556300"
          },
          {
            "cn": "天柱县",
            "code": "556600"
          },
          {
            "cn": "岑巩县",
            "code": "557800"
          },
          {
            "cn": "施秉县",
            "code": "556200"
          },
          {
            "cn": "榕江县",
            "code": "557200"
          },
          {
            "cn": "锦屏县",
            "code": "556700"
          },
          {
            "cn": "镇远县",
            "code": "557700"
          },
          {
            "cn": "雷山县",
            "code": "557100"
          },
          {
            "cn": "麻江县",
            "code": "557600"
          },
          {
            "cn": "黄平县",
            "code": "556100"
          },
          {
            "cn": "黎平县",
            "code": "557300"
          }
        ]
      },
      {
        "cn": "黔南布依族苗族自治州",
        "code": "558000",
        "area": [
          {
            "cn": "三都水族自治县",
            "code": "558100"
          },
          {
            "cn": "平塘县",
            "code": "558300"
          },
          {
            "cn": "惠水县",
            "code": "550600"
          },
          {
            "cn": "独山县",
            "code": "558200"
          },
          {
            "cn": "瓮安县",
            "code": "550400"
          },
          {
            "cn": "福泉市",
            "code": "550500"
          },
          {
            "cn": "罗甸县",
            "code": "550100"
          },
          {
            "cn": "荔波县",
            "code": "558400"
          },
          {
            "cn": "贵定县",
            "code": "551300"
          },
          {
            "cn": "都匀市",
            "code": "558000"
          },
          {
            "cn": "长顺县",
            "code": "550700"
          },
          {
            "cn": "龙里县",
            "code": "551200"
          }
        ]
      },
      {
        "cn": "黔西南布依族苗族自治州",
        "code": "562400",
        "area": [
          {
            "cn": "兴义市",
            "code": "562400"
          },
          {
            "cn": "兴仁县",
            "code": "562300"
          },
          {
            "cn": "册亨县",
            "code": "552200"
          },
          {
            "cn": "安龙县",
            "code": "552400"
          },
          {
            "cn": "普安县",
            "code": "561500"
          },
          {
            "cn": "晴隆县",
            "code": "561400"
          },
          {
            "cn": "望谟县",
            "code": "552300"
          },
          {
            "cn": "贞丰县",
            "code": "562200"
          }
        ]
      }
    ]
  },
  {
    "cn": "西藏自治区",
    "code": "xizang",
    "citys": [
      {
        "cn": "山南地区",
        "code": "856000",
        "area": [
          {
            "cn": "乃东县",
            "code": "856100"
          },
          {
            "cn": "加查县",
            "code": "856400"
          },
          {
            "cn": "扎囊县",
            "code": "850800"
          },
          {
            "cn": "措美县",
            "code": "856900"
          },
          {
            "cn": "曲松县",
            "code": "856300"
          },
          {
            "cn": "桑日县",
            "code": "856200"
          },
          {
            "cn": "洛扎县",
            "code": "851200"
          },
          {
            "cn": "浪卡子县",
            "code": "851100"
          },
          {
            "cn": "琼结县",
            "code": "856800"
          },
          {
            "cn": "贡嘎县",
            "code": "850700"
          },
          {
            "cn": "错那县",
            "code": "856700"
          },
          {
            "cn": "隆子县",
            "code": "856600"
          }
        ]
      },
      {
        "cn": "拉萨市",
        "code": "850000",
        "area": [
          {
            "cn": "堆龙德庆县",
            "code": "851400"
          },
          {
            "cn": "墨竹工卡县",
            "code": "850200"
          },
          {
            "cn": "尼木县",
            "code": "851600"
          },
          {
            "cn": "当雄县",
            "code": "851500"
          },
          {
            "cn": "曲水县",
            "code": "850600"
          },
          {
            "cn": "达孜县",
            "code": "850100"
          }
        ]
      },
      {
        "cn": "日喀则地区",
        "code": "857000",
        "area": [
          {
            "cn": "亚东县",
            "code": "857600"
          },
          {
            "cn": "仁布县",
            "code": "857200"
          },
          {
            "cn": "仲巴县",
            "code": "858800"
          },
          {
            "cn": "南木林县",
            "code": "857100"
          },
          {
            "cn": "吉隆县",
            "code": "858700"
          },
          {
            "cn": "定日县",
            "code": "858200"
          },
          {
            "cn": "定结县",
            "code": "857900"
          },
          {
            "cn": "岗巴县",
            "code": "857700"
          },
          {
            "cn": "康马县",
            "code": "857500"
          },
          {
            "cn": "拉孜县",
            "code": "858100"
          },
          {
            "cn": "日喀则市",
            "code": "857000"
          },
          {
            "cn": "昂仁县",
            "code": "858500"
          },
          {
            "cn": "江孜县",
            "code": "857400"
          },
          {
            "cn": "白朗县",
            "code": "857300"
          },
          {
            "cn": "聂拉木县",
            "code": "858300"
          },
          {
            "cn": "萨嘎县",
            "code": "858600"
          },
          {
            "cn": "萨迦县",
            "code": "857800"
          },
          {
            "cn": "谢通门县",
            "code": "858900"
          }
        ]
      },
      {
        "cn": "昌都地区",
        "code": "854000",
        "area": [
          {
            "cn": "丁青县",
            "code": "855700"
          },
          {
            "cn": "八宿县",
            "code": "854600"
          },
          {
            "cn": "察雅县",
            "code": "854300"
          },
          {
            "cn": "左贡县",
            "code": "854400"
          },
          {
            "cn": "昌都县",
            "code": "854000"
          },
          {
            "cn": "江达县",
            "code": "854100"
          },
          {
            "cn": "洛隆县",
            "code": "855400"
          },
          {
            "cn": "类乌齐县",
            "code": "855600"
          },
          {
            "cn": "芒康县",
            "code": "854500"
          },
          {
            "cn": "贡觉县",
            "code": "854200"
          },
          {
            "cn": "边坝县",
            "code": "855500"
          }
        ]
      },
      {
        "cn": "林芝地区",
        "code": "860000",
        "area": [
          {
            "cn": "墨脱县",
            "code": "860700"
          },
          {
            "cn": "察隅县",
            "code": "860600"
          },
          {
            "cn": "工布江达县",
            "code": "860200"
          },
          {
            "cn": "朗县",
            "code": "860400"
          },
          {
            "cn": "林芝县",
            "code": "860100"
          },
          {
            "cn": "波密县",
            "code": "860300"
          },
          {
            "cn": "米林县",
            "code": "860500"
          }
        ]
      },
      {
        "cn": "那曲地区",
        "code": "852000",
        "area": [
          {
            "cn": "嘉黎县",
            "code": "852400"
          },
          {
            "cn": "安多县",
            "code": "853400"
          },
          {
            "cn": "尼玛县",
            "code": "853200"
          },
          {
            "cn": "巴青县",
            "code": "852100"
          },
          {
            "cn": "比如县",
            "code": "852300"
          },
          {
            "cn": "班戈县",
            "code": "852500"
          },
          {
            "cn": "申扎县",
            "code": "853100"
          },
          {
            "cn": "索县",
            "code": "852200"
          },
          {
            "cn": "聂荣县",
            "code": "853500"
          },
          {
            "cn": "那曲县",
            "code": "852000"
          }
        ]
      },
      {
        "cn": "阿里地区",
        "code": "859000",
        "area": [
          {
            "cn": "噶尔县",
            "code": "859000"
          },
          {
            "cn": "措勤县",
            "code": "859300"
          },
          {
            "cn": "改则县",
            "code": "859200"
          },
          {
            "cn": "日土县",
            "code": "859700"
          },
          {
            "cn": "普兰县",
            "code": "859500"
          },
          {
            "cn": "札达县",
            "code": "859600"
          },
          {
            "cn": "革吉县",
            "code": "859100"
          }
        ]
      }
    ]
  }
]